zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h

/****************************************************************************************************//**
 * @file     TLE984x.h
 *
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for
 *           TLE984x from Infineon Technologies AG.
 *
 * @version  V1.8
 * @date     28. Oct 2017
 *
 * @note     Generated with SVDConv V2.84c 
 *           from CMSIS SVD File 'TLE984x_UM_SVD.xml' Version 1.5,
 *
 * @note:    Generated for MISRA Compliance, this File is NOT CMSIS compliant.
 *
 * @par      tbd
 *
 *******************************************************************************************************/

/*******************************************************************************
**                      Revision Control History                              **
*******************************************************************************/
/* 
 * V1.8: 2017-10-28:  Position/Mask macros added 
 * V1.7: 2017-10-27:  Include of tle_device.h removed
 * V1.6: 2016-06-28:  Memory definition moved to tle_device.h
 * V1.5: 2016-06-23:  Version covering the TLE984xQX Users Manual 1.0 (2016-06-20)
 *                    no changes compared to V1.4
 * V1.4: 2016-06-07:  Changes:
 *                    MISRA-2012 checked with PC-lint for C/C++ (NT) Vers. 9.00L
 *                    editorial changes
 *                    Flash sizes adapted for TL9842-2 and TLE9843-2
 * V1.3: 2016-02-18:  Covering AE design step. Changes:
 *                    MISRA-2012 checked with PC-lint for C/C++ (NT) Vers. 9.00L
 *                    editorial changes
 *                    adapted Flash and RAM adresses and sizes for whole device portfolio
 *                    PMU->WAKE_CNF_GPIO0 removed (was shared register, PMU->GPUDATA8to11 remains)
 *                    PMU->GPIO_WAKE_STATUS: GPIO2 removed
 *                    PMU->RESET_STS: PMU_IntWDT removed
 *                    PMU->VDDEXT_CTRL.3..5 changed to read-only
 *                    SCU->SYS_STRTUP_STS.PG100TP_NU changed to MRAMINITSTS
 *                    CPU->NCIC_ICER renamed to NVIC_ICER
 * V1.2: 2015-06-10:  Changes:
 *                    Modules T2 and T21 renamed to TIMER2 and TIMER21, due to naming conflict (Register T2 in GPT12)
 *                    Bit PMU_WAKE_STATUS.LIN renamed to PMU_WAKE_STATUS.LIN_WAKE, due to naming conflict with Module LIN
 * V1.1: 2014-12-21:  Changes:
 *                    Bitfields added in CPU->NVIC_ISER, *ICER, *ISPR, *ICPR
 *                    Registers added: CPU->NVIC_IPR0, 1, 2, 3, 4, 5
 *                    PMU->MON_CNF2 added
 *                    SCU->MODPISEL1.XTAL12EN added
 *                    PMU->HIGHSIDE_CTRL: cyclic enable HS0+1 -> HS1+2
 *                    GPT12E->T2CON.T3UDE -> T2UDE (bitname changed)
 *                    ADC2, ch7 added in:
 *                        FILTCOEFF0_7, TH4_7_LOWER, TH4_7_UPPER,
 *                        CNT4_7_LOWER, CNT4_7_UPPER, MMODE0_7
 *                    and minor changes in descriptive text
 *                    
 * V1.0: 2014-08-20:  Initial version
 *                     
 */


/** @addtogroup Infineon Technologies AG
  * @{
  */

/** @addtogroup TLE984x
  * @{
  */

#ifndef TLE984X_H
#define TLE984X_H


#ifdef __cplusplus
extern "C" {
#endif

/* memory definition has been moved to tle_device.h */

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ---------------------  TLE984x Specific Interrupt Numbers  --------------------- */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0000            /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                               /*!< Cortex-M0 processor and core peripherals                              */
#include "system_TLE984x.h"                         /*!< TLE984x System                                                        */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */


/* ================================================================================ */
/* ================                      ADC1                      ================ */
/* ================================================================================ */


/**
  * @brief ADC1 (ADC1)
  */

