zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
typedef struct {                                    /*!< (@ 0x40004000) ADC1 Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004000) ADC1 Control and Status Register                       */
    
    struct {
      __IO uint32_t  PD_N       :  1;               /*!< [0..0] ADC1 Power Down Signal                                         */
      __IO uint32_t  SOOC       :  1;               /*!< [1..1] ADC1 Start of Offset Calibration (software mode)               */
      __IO uint32_t  SOS        :  1;               /*!< [2..2] ADC1 Start of Sampling/Conversion (software mode)              */
           uint32_t             :  1;
      __I  uint32_t  READY      :  1;               /*!< [4..4] HVADC Ready bit                                                */
      __I  uint32_t  CAL_SIGN   :  1;               /*!< [5..5] Output of Comparator to Steer Gain / Offset calibration        */
           uint32_t             :  1;
      __I  uint32_t  EOC        :  1;               /*!< [7..7] ADC1 End of Conversion (software mode)                         */
      __IO uint32_t  SW_CH_SEL  :  4;               /*!< [8..11] Channel for software mode                                     */
           uint32_t             :  6;
      __IO uint32_t  STRTUP_DIS :  1;               /*!< [18..18] DPP1 Startup Disable                                         */
    } bit;                                          /*!< [19] BitSize                                                          */
  } CTRL_STS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x40004004) Sequencer Feedback Register                            */
    
    struct {
      __I  uint32_t  SQ_FB      :  5;               /*!< [0..4] Current Sequence that caused software mode                     */
           uint32_t             :  3;
      __I  uint32_t  SQ_STOP    :  1;               /*!< [8..8] ADC1 Sequencer Stop Signal for DPP                             */
      __I  uint32_t  EIM_ACTIVE :  1;               /*!< [9..9] ADC1 EIM active                                                */
      __I  uint32_t  ESM_ACTIVE :  1;               /*!< [10..10] ADC1 ESM active                                              */
      __I  uint32_t  SQx        :  4;               /*!< [11..14] Current Active ADC1 Sequence                                 */
           uint32_t             :  1;
      __I  uint32_t  CHx        :  4;               /*!< [16..19] Current ADC1 Channel                                         */
    } bit;                                          /*!< [20] BitSize                                                          */
  } SQ_FB;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004008) Channel Setting Bits for Exceptional Interrupt
                                                         Measurement                                                           */
    
    struct {
      __IO uint32_t  EIM_CHx    :  4;               /*!< [0..3] Channel set for exceptional interrupt measurement (EIM)        */
           uint32_t             :  4;
      __IO uint32_t  EIM_REP    :  3;               /*!< [8..10] Repeat count for exceptional interrupt measurement (EIM)      */
      __IO uint32_t  EIM_EN     :  1;               /*!< [11..11] Exceptional interrupt measurement (EIM) Trigger Event
                                                         enable                                                                */
           uint32_t             :  4;
      __IO uint32_t  ADC1_EIM_TRIG_SEL:  3;         /*!< [16..18] Trigger selection for exceptional interrupt measurement
                                                         (EIM)                                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } CHx_EIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000400C) Channel Setting Bits for Exceptional Sequence
                                                         Measurement                                                           */
    
    struct {
      __IO uint32_t  ESM_0      : 12;               /*!< [0..11] Channel Sequence for Exceptional Sequence Measurement
                                                         (ESM)                                                                 */
           uint32_t             :  4;
      __IO uint32_t  ADC1_ESM_TRIG_SEL:  3;         /*!< [16..18] Trigger selection for exceptional interrupt measurement
                                                         (ESM)                                                                 */
           uint32_t             : 11;
      __IO uint32_t  ESM_EN     :  1;               /*!< [30..30] Enable for Exceptional Sequence Measurement Trigger
                                                         Event                                                                 */
      __IO uint32_t  ESM_STS    :  1;               /*!< [31..31] Exceptional Sequence Measurement is finished                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CHx_ESM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004010) Maximum Time for Software Mode                         */
    
    struct {
      __IO uint32_t  MAX_TIME   :  8;               /*!< [0..7] Maximum Time in Software Mode                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MAX_TIME;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004014) Measurement Unit 1 Control Register 2                  */
    
    struct {
      __IO uint32_t  CAL_EN     : 12;               /*!< [0..11] Calibration Enable for Channels 0 to 11                       */
    } bit;                                          /*!< [12] BitSize                                                          */
  } CTRL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004018) Measurement Unit 1 Control Register 3                  */
    
