zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  MCM_PD_N   :  1;               /*!< [0..0] Power Down Signal for MCM                                      */
      __IO uint32_t  SW_MODE    :  1;               /*!< [1..1] SW Mode Enable                                                 */
           uint32_t             :  2;
      __O  uint32_t  EoC_FAIL_CLR:  1;              /*!< [4..4] Fail of ADC End of Conversion Signal Clear                     */
           uint32_t             :  1;
      __I  uint32_t  EoC_FAIL   :  1;               /*!< [6..6] Fail of ADC End of Conversion Signal                           */
      __I  uint32_t  MCM_RDY    :  1;               /*!< [7..7] Ready Signal for MCM after Power On or Reset                   */
      __IO uint32_t  SAMPLE_TIME_HVCH:  4;          /*!< [8..11] Sample time of ADC1                                           */
           uint32_t             :  4;
      __IO uint32_t  SAMPLE_TIME_LVCH:  4;          /*!< [16..19] Sample time of ADC1                                          */
    } bit;                                          /*!< [20] BitSize                                                          */
  } CTRL3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000401C) Measurement Unit 1 Control Register 5                  */
    
    struct {
      __IO uint32_t  FILT_OUT_SEL_11_0: 12;         /*!< [0..11] Output Filter Selection for Channels 0 to 11                  */
    } bit;                                          /*!< [12] BitSize                                                          */
  } CTRL5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004020) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         0-1                                                                   */
    
    struct {
      __IO uint32_t  SQ0        : 12;               /*!< [0..11] Sequence 0 channel enable                                     */
           uint32_t             :  4;
      __IO uint32_t  SQ1        : 12;               /*!< [16..27] Sequence 1 channel enable                                    */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ0_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004024) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         2-3                                                                   */
    
    struct {
      __IO uint32_t  SQ2        : 12;               /*!< [0..11] Sequence 2 channel enable                                     */
           uint32_t             :  4;
      __IO uint32_t  SQ3        : 12;               /*!< [16..27] Sequence 3 channel enable                                    */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ2_3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004028) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         4-5                                                                   */
    
    struct {
      __IO uint32_t  SQ4        : 12;               /*!< [0..11] Sequence 4 channel enable                                     */
           uint32_t             :  4;
      __IO uint32_t  SQ5        : 12;               /*!< [16..27] Sequence 5 channel enable                                    */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ4_5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000402C) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         6-7                                                                   */
    
    struct {
      __IO uint32_t  SQ6        : 12;               /*!< [0..11] Sequence 6 channel enable                                     */
           uint32_t             :  4;
      __IO uint32_t  SQ7        : 12;               /*!< [16..27] Sequence 7 channel enable                                    */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ6_7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004030) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         8-9                                                                   */
    
    struct {
      __IO uint32_t  SQ8        : 12;               /*!< [0..11] Sequence 8 channel enable                                     */
           uint32_t             :  4;
      __IO uint32_t  SQ9        : 12;               /*!< [16..27] Sequence 9 channel enable                                    */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ8_9;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004034) Measurement Unit 1 Channel Enable Bits for Cycle
                                                         10-11                                                                 */
    
    struct {
      __IO uint32_t  SQ10       : 12;               /*!< [0..11] Sequence 10 channel enable                                    */
           uint32_t             :  4;
      __IO uint32_t  SQ11       : 12;               /*!< [16..27] Sequence 11 channel enable                                   */
    } bit;                                          /*!< [28] BitSize                                                          */
  } SQ10_11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004038) Measurement Unit 1 Control Register 4                  */
    
