zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  MAX_CALTIME:  4;               /*!< [0..3] Maximum ADC Calibration Time                                   */
    } bit;                                          /*!< [4] BitSize                                                           */
  } CTRL4;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004040) Lower Comparator Trigger Level Channel 0-3             */
    
    struct {
      __IO uint32_t  CH0_LOW    :  8;               /*!< [0..7] Channel 0 lower trigger level                                  */
      __IO uint32_t  CH1_LOW    :  8;               /*!< [8..15] Channel 1 lower trigger level                                 */
      __IO uint32_t  CH2_LOW    :  8;               /*!< [16..23] Channel 2 lower trigger level                                */
      __IO uint32_t  CH3_LOW    :  8;               /*!< [24..31] Channel 3 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004044) Lower Comparator Trigger Level Channel 4-7             */
    
    struct {
      __IO uint32_t  CH4_LOW    :  8;               /*!< [0..7] Channel 4 lower trigger level                                  */
      __IO uint32_t  CH5_LOW    :  8;               /*!< [8..15] Channel 5 lower trigger level                                 */
      __IO uint32_t  CH6_LOW    :  8;               /*!< [16..23] Channel 6 lower trigger level                                */
      __IO uint32_t  CH7_LOW    :  8;               /*!< [24..31] Channel 7 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH4_7_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004048) Calibration for Channel 0 & 1                          */
    
    struct {
      __IO uint32_t  CALOFFS_CH0:  5;               /*!< [0..4] Offset Calibration for channel 0                               */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH0:  8;               /*!< [8..15] Gain Calibration for channel 0                                */
      __IO uint32_t  CALOFFS_CH1:  5;               /*!< [16..20] Offset Calibration for channel 1                             */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH1:  8;               /*!< [24..31] Gain Calibration for channel 1                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH0_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000404C) Calibration for Channel 2 & 3                          */
    
    struct {
      __IO uint32_t  CALOFFS_CH2:  5;               /*!< [0..4] Offset Calibration for channel 2                               */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH2:  8;               /*!< [8..15] Gain Calibration for channel 2                                */
      __IO uint32_t  CALOFFS_CH3:  5;               /*!< [16..20] Offset Calibration for channel 3                             */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH3:  8;               /*!< [24..31] Gain Calibration for channel 3                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH2_3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004050) Calibration for Channel 4 & 5                          */
    
    struct {
      __IO uint32_t  CALOFFS_CH4:  5;               /*!< [0..4] Offset Calibration for channel 4                               */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH4:  8;               /*!< [8..15] Gain Calibration for channel 4                                */
      __IO uint32_t  CALOFFS_CH5:  5;               /*!< [16..20] Offset Calibration for channel 5                             */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH5:  8;               /*!< [24..31] Gain Calibration for channel 5                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH4_5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004054) Calibration for Channel 6 & 7                          */
    
    struct {
      __IO uint32_t  CALOFFS_CH6:  5;               /*!< [0..4] Offset Calibration for channel 6                               */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH6:  8;               /*!< [8..15] Gain Calibration for channel 6                                */
      __IO uint32_t  CALOFFS_CH7:  5;               /*!< [16..20] Offset Calibration for channel 7                             */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH7:  8;               /*!< [24..31] Gain Calibration for channel 7                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH6_7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004058) Calibration for Channel 8 & 9                          */
    
    struct {
      __IO uint32_t  CALOFFS_CH8:  5;               /*!< [0..4] Offset Calibration for channel 8                               */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH8:  8;               /*!< [8..15] Gain Calibration for channel 8                                */
      __IO uint32_t  CALOFFS_CH9:  5;               /*!< [16..20] Offset Calibration for channel 9                             */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH9:  8;               /*!< [24..31] Gain Calibration for channel 9                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH8_9;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000405C) Calibration for Channel 10 & 11                        */
    
