zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  CALOFFS_CH10:  5;              /*!< [0..4] Offset Calibration for channel 10                              */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH10:  8;              /*!< [8..15] Gain Calibration for channel 10                               */
      __IO uint32_t  CALOFFS_CH11:  5;              /*!< [16..20] Offset Calibration for channel 11                            */
           uint32_t             :  3;
      __IO uint32_t  CALGAIN_CH11:  8;              /*!< [24..31] Gain Calibration for channel 11                              */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH10_11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004060) Filter Coefficients Measurement Unit Channel
                                                         0-11                                                                  */
    
    struct {
      __IO uint32_t  CH0        :  2;               /*!< [0..1] Filter Coefficients ADC channel 0                              */
      __IO uint32_t  CH1        :  2;               /*!< [2..3] Filter Coefficients ADC channel 1                              */
      __IO uint32_t  CH2        :  2;               /*!< [4..5] Filter Coefficients ADC channel 2                              */
      __IO uint32_t  CH3        :  2;               /*!< [6..7] Filter Coefficients ADC channel 3                              */
      __IO uint32_t  CH4        :  2;               /*!< [8..9] Filter Coefficients ADC channel 4                              */
      __IO uint32_t  CH5        :  2;               /*!< [10..11] Filter Coefficients ADC channel 5                            */
      __IO uint32_t  CH6        :  2;               /*!< [12..13] Filter Coefficients ADC channel 6                            */
      __IO uint32_t  CH7        :  2;               /*!< [14..15] Filter Coefficients ADC channel 7                            */
      __IO uint32_t  CH8        :  2;               /*!< [16..17] Filter Coefficients ADC channel 8                            */
      __IO uint32_t  CH9        :  2;               /*!< [18..19] Filter Coefficients ADC channel 9                            */
      __IO uint32_t  CH10       :  2;               /*!< [20..21] Filter Coefficients ADC channel 10                           */
      __IO uint32_t  CH11       :  2;               /*!< [22..23] Filter Coefficients ADC channel 11                           */
    } bit;                                          /*!< [24] BitSize                                                          */
  } FILTCOEFF0_11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004064) ADC1 Interrupt Status 1 Register                       */
    
    struct {
      __IO uint32_t  VBATSEN_IS :  1;               /*!< [0..0] ADC1 Channel 1 Interrupt Status                                */
      __IO uint32_t  VS_IS      :  1;               /*!< [1..1] ADC1 Channel 0 Interrupt Status                                */
      __IO uint32_t  MON1_IS    :  1;               /*!< [2..2] ADC1 Channel 2 Interrupt Status                                */
      __IO uint32_t  MON2_IS    :  1;               /*!< [3..3] ADC1 Channel 3 Interrupt Status                                */
      __IO uint32_t  MON3_IS    :  1;               /*!< [4..4] ADC1 Channel 4 Interrupt Status                                */
      __IO uint32_t  MON4_IS    :  1;               /*!< [5..5] ADC1 Channel 5 Interrupt Status                                */
      __IO uint32_t  MON5_IS    :  1;               /*!< [6..6] ADC1 Channel 6 Interrupt Status                                */
      __IO uint32_t  P2_1_IS    :  1;               /*!< [7..7] ADC1 Channel 7 Interrupt Status                                */
      __IO uint32_t  P2_2_IS    :  1;               /*!< [8..8] ADC1 Channel 8 Interrupt Status                                */
      __IO uint32_t  P2_3_IS    :  1;               /*!< [9..9] ADC1 Channel 9 Interrupt Status                                */
      __IO uint32_t  P2_6_IS    :  1;               /*!< [10..10] ADC1 Channel 10 Interrupt Status                             */
      __IO uint32_t  P2_7_IS    :  1;               /*!< [11..11] ADC1 Channel 11 Interrupt Status                             */
      __IO uint32_t  P2_0_IS    :  1;               /*!< [12..12] ADC1 Channel 12 Interrupt Status                             */
           uint32_t             :  3;
      __IO uint32_t  EIM_IS     :  1;               /*!< [16..16] Exceptional Interrupt Measurement (EIM) Status               */
      __IO uint32_t  ESM_IS     :  1;               /*!< [17..17] Exceptional Sequence Measurement (ESM) Status                */
           uint32_t             :  6;
      __IO uint32_t  DU1LO_IS   :  1;               /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU1UP_IS   :  1;               /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU2LO_IS   :  1;               /*!< [26..26] ADC1 Differential Unit 2 (DU2) lower Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU2UP_IS   :  1;               /*!< [27..27] ADC1 Differential Unit 2 (DU2) upper Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU3LO_IS   :  1;               /*!< [28..28] ADC1 Differential Unit 3 (DU3) lower Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU3UP_IS   :  1;               /*!< [29..29] ADC1 Differential Unit 3 (DU3) upper Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU4LO_IS   :  1;               /*!< [30..30] ADC1 Differential Unit 4 (DU4) lower Channel Interrupt
                                                         Status                                                                */
      __IO uint32_t  DU4UP_IS   :  1;               /*!< [31..31] ADC1 Differential Unit 4 (DU4) upper Channel Interrupt
                                                         Status                                                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } IRQS_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004068) ADC1 Interrupt Enable 1 Register                       */
    
