zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  VBATSEN_IEN:  1;               /*!< [0..0] ADC1 VBAT_SENSE Interrupt Enable                               */
      __IO uint32_t  VS_IEN     :  1;               /*!< [1..1] ADC1 VS Interrupt Enable                                       */
      __IO uint32_t  MON1_IEN   :  1;               /*!< [2..2] ADC1 MON 1 Interrupt Enable                                    */
      __IO uint32_t  MON2_IEN   :  1;               /*!< [3..3] ADC1 MON 2 Interrupt Enable                                    */
      __IO uint32_t  MON3_IEN   :  1;               /*!< [4..4] ADC1 MON 3 Interrupt Enable                                    */
      __IO uint32_t  MON4_IEN   :  1;               /*!< [5..5] ADC1 MON 4 Interrupt Enable                                    */
      __IO uint32_t  MON5_IEN   :  1;               /*!< [6..6] ADC1 MON 5 Interrupt Enable                                    */
      __IO uint32_t  P2_1_IEN   :  1;               /*!< [7..7] ADC1 Port 2.1 Interrupt Enable                                 */
      __IO uint32_t  P2_2_IEN   :  1;               /*!< [8..8] ADC1 Port 2.2 Interrupt Enable                                 */
      __IO uint32_t  P2_3_IEN   :  1;               /*!< [9..9] ADC1 Port 2.3 Interrupt Enable                                 */
      __IO uint32_t  P2_6_IEN   :  1;               /*!< [10..10] ADC1 Port 2.6 Interrupt Enable                               */
      __IO uint32_t  P2_7_IEN   :  1;               /*!< [11..11] ADC1 Port 2.7 Interrupt Enable                               */
      __IO uint32_t  P2_0_IEN   :  1;               /*!< [12..12] ADC1 Port 2.0 Interrupt Enable                               */
           uint32_t             :  3;
      __IO uint32_t  EIM_IEN    :  1;               /*!< [16..16] Exceptional Interrupt Measurement (EIM) Interrupt Enable     */
      __IO uint32_t  ESM_IEN    :  1;               /*!< [17..17] Exceptional Sequence Measurement (ESM) Interrupt Enable      */
           uint32_t             :  6;
      __IO uint32_t  DU1LO_IEN  :  1;               /*!< [24..24] Differential Unit 1 lower Interrupt Enable                   */
      __IO uint32_t  DU1UP_IEN  :  1;               /*!< [25..25] Differential Unit 1 upper Interrupt Enable                   */
      __IO uint32_t  DU2LO_IEN  :  1;               /*!< [26..26] Differential Unit 2 lower Interrupt Enable                   */
      __IO uint32_t  DU2UP_IEN  :  1;               /*!< [27..27] Differential Unit 2 upper Interrupt Enable                   */
      __IO uint32_t  DU3LO_IEN  :  1;               /*!< [28..28] Differential Unit 3 lower Interrupt Enable                   */
      __IO uint32_t  DU3UP_IEN  :  1;               /*!< [29..29] Differential Unit 3 upper Interrupt Enable                   */
      __IO uint32_t  DU4LO_IEN  :  1;               /*!< [30..30] Differential Unit 4 lower Interrupt Enable                   */
      __IO uint32_t  DU4UP_IEN  :  1;               /*!< [31..31] Differential Unit 4 upper Interrupt Enable                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } IRQEN_1;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x4000406C) ADC1 Interrupt Status Clear 1 Register                 */
    
    struct {
      __O  uint32_t  VBATSEN_ISC:  1;               /*!< [0..0] ADC1 VBAT_SENSE Interrupt Status Clear                         */
      __O  uint32_t  VS_ISC     :  1;               /*!< [1..1] ADC1 VS Interrupt Status Clear                                 */
      __O  uint32_t  MON1_ISC   :  1;               /*!< [2..2] ADC1 MON 1 Interrupt Status Clear                              */
      __O  uint32_t  MON2_ISC   :  1;               /*!< [3..3] ADC1 MON 2 Interrupt Status Clear                              */
      __O  uint32_t  MON3_ISC   :  1;               /*!< [4..4] ADC1 MON 3 Interrupt Status Clear                              */
      __O  uint32_t  MON4_ISC   :  1;               /*!< [5..5] ADC1 MON 4 Interrupt Status Clear                              */
      __O  uint32_t  MON5_ISC   :  1;               /*!< [6..6] ADC1 MON 5 Interrupt Status Clear                              */
      __O  uint32_t  P2_1_ISC   :  1;               /*!< [7..7] ADC1 Port 2.1 Interrupt Status Clear                           */
      __O  uint32_t  P2_2_ISC   :  1;               /*!< [8..8] ADC1 Port 2.2 Interrupt Status Clear                           */
      __O  uint32_t  P2_3_ISC   :  1;               /*!< [9..9] ADC1 Port 2.3 Interrupt Status Clear                           */
      __O  uint32_t  P2_6_ISC   :  1;               /*!< [10..10] ADC1 Port 2.6 Interrupt Status Clear                         */
      __O  uint32_t  P2_7_ISC   :  1;               /*!< [11..11] ADC1 Port 2.7 Interrupt Status Clear                         */
      __O  uint32_t  P2_0_ISC   :  1;               /*!< [12..12] ADC1 Port 2.0 Interrupt Status Clear                         */
           uint32_t             :  3;
      __O  uint32_t  EIM_ISC    :  1;               /*!< [16..16] Exceptional Interrupt Measurement (EIM) Status Clear         */
      __O  uint32_t  ESM_ISC    :  1;               /*!< [17..17] Exceptional Sequence Measurement (ESM) Status Clear          */
           uint32_t             :  6;
      __O  uint32_t  DU1LO_ISC  :  1;               /*!< [24..24] Differential Unit 1 lower Interrupt Status Clear             */
      __O  uint32_t  DU1UP_ISC  :  1;               /*!< [25..25] Differential Unit 1 lower Interrupt Status Clear             */
      __O  uint32_t  DU2LO_ISC  :  1;               /*!< [26..26] Differential Unit 2 lower Interrupt Status Clear             */
      __O  uint32_t  DU2UP_ISC  :  1;               /*!< [27..27] Differential Unit 2 lower Interrupt Status Clear             */
      __O  uint32_t  DU3LO_ISC  :  1;               /*!< [28..28] Differential Unit 3 lower Interrupt Status Clear             */
      __O  uint32_t  DU3UP_ISC  :  1;               /*!< [29..29] Differential Unit 3 lower Interrupt Status Clear             */
      __O  uint32_t  DU4LO_ISC  :  1;               /*!< [30..30] Differential Unit 4 lower Interrupt Status Clear             */
      __O  uint32_t  DU4UP_ISC  :  1;               /*!< [31..31] Differential Unit 4 lower Interrupt Status Clear             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } IRQCLR_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004070) ADC1 or Filter Output Channel 0                        */
    
