zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  FILT_OUT_CH0: 12;              /*!< [0..11] ADC or filter output value channel 0                          */
           uint32_t             :  4;
      __IO uint32_t  WFR0       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF0        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF0        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004074) ADC1 or Filter Output Channel 1                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH1: 12;              /*!< [0..11] ADC or filter output value channel 1                          */
           uint32_t             :  4;
      __IO uint32_t  WFR1       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF1        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF1        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004078) ADC1 or Filter Output Channel 2                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH2: 12;              /*!< [0..11] ADC or filter output value channel 2                          */
           uint32_t             :  4;
      __IO uint32_t  WFR2       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF2        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF2        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000407C) ADC1 or Filter Output Channel 3                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH3: 12;              /*!< [0..11] ADC or filter output value channel 3                          */
           uint32_t             :  4;
      __IO uint32_t  WFR3       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF3        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF3        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004080) ADC1 or Filter Output Channel 4                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH4: 12;              /*!< [0..11] ADC or filter output value channel 4                          */
           uint32_t             :  4;
      __IO uint32_t  WFR4       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF4        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF4        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004084) ADC1 or Filter Output Channel 5                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH5: 12;              /*!< [0..11] ADC or filter output value channel 5                          */
           uint32_t             :  4;
      __IO uint32_t  WFR5       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF5        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF5        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004088) ADC1 or Filter Output Channel 6                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH6: 12;              /*!< [0..11] ADC or filter output value channel 6                          */
           uint32_t             :  4;
      __IO uint32_t  WFR6       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF6        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF6        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT6;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000408C) ADC1 or Filter Output Channel 7                        */
    
