zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  FILT_OUT_CH7: 12;              /*!< [0..11] ADC or filter output value channel 7                          */
           uint32_t             :  4;
      __IO uint32_t  WFR7       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF7        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF7        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004090) ADC1 or Filter Output Channel 8                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH8: 12;              /*!< [0..11] ADC or filter output value channel 8                          */
           uint32_t             :  4;
      __IO uint32_t  WFR8       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF8        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF8        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT8;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004094) ADC1 or Filter Output Channel 9                        */
    
    struct {
      __I  uint32_t  FILT_OUT_CH9: 12;              /*!< [0..11] ADC or filter output value channel 9                          */
           uint32_t             :  4;
      __IO uint32_t  WFR9       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF9        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF9        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT9;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004098) ADC1 or Filter Output Channel 10                       */
    
    struct {
      __I  uint32_t  FILT_OUT_CH10: 12;             /*!< [0..11] ADC or filter output value channel 10                         */
           uint32_t             :  4;
      __IO uint32_t  WFR10      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF10       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF10       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT10;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000409C) ADC1 or Filter Output Channel 11                       */
    
    struct {
      __I  uint32_t  FILT_OUT_CH11: 12;             /*!< [0..11] ADC or filter output value channel 11                         */
           uint32_t             :  4;
      __IO uint32_t  WFR11      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF11       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF11       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040A0) ADC1 Differential Channel Output 1                     */
    
    struct {
      __I  uint32_t  DCH1       : 12;               /*!< [0..11] ADC differential output value 1                               */
           uint32_t             :  4;
      __IO uint32_t  DWFR1      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  DVF1       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  DOF1       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } DIFFCH_OUT1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040A4) ADC1 Differential Channel Output 2                     */
    
    struct {
      __I  uint32_t  DCH2       : 12;               /*!< [0..11] ADC differential output value 2                               */
           uint32_t             :  4;
      __IO uint32_t  DWFR2      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  DVF2       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  DOF2       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } DIFFCH_OUT2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040A8) ADC1 Differential Channel Output 3                     */
    
