zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  DCH3       : 12;               /*!< [0..11] ADC differential output value 3                               */
           uint32_t             :  4;
      __IO uint32_t  DWFR3      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  DVF3       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  DOF3       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } DIFFCH_OUT3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040AC) ADC1 Differential Channel Output 4                     */
    
    struct {
      __I  uint32_t  DCH4       : 12;               /*!< [0..11] ADC differential output value 4                               */
           uint32_t             :  4;
      __IO uint32_t  DWFR4      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  DVF4       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  DOF4       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } DIFFCH_OUT4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040B0) Upper Threshold Filter Enable                          */
    
    struct {
      __IO uint32_t  FU_CH0_EN  :  1;               /*!< [0..0] Upper threshold IIR filter enable Channel 0                    */
      __IO uint32_t  FU_CH1_EN  :  1;               /*!< [1..1] Upper threshold IIR filter enable Channel 1                    */
      __IO uint32_t  FU_CH2_EN  :  1;               /*!< [2..2] Upper threshold IIR filter enable Channel 2                    */
      __IO uint32_t  FU_CH3_EN  :  1;               /*!< [3..3] Upper threshold IIR filter enable Channel 3                    */
      __IO uint32_t  FU_CH4_EN  :  1;               /*!< [4..4] Upper threshold IIR filter enable Channel 4                    */
      __IO uint32_t  FU_CH5_EN  :  1;               /*!< [5..5] Upper threshold IIR filter enable Channel 5                    */
      __IO uint32_t  FU_CH6_EN  :  1;               /*!< [6..6] Upper threshold IIR filter enable Channel 6                    */
      __IO uint32_t  FU_CH7_EN  :  1;               /*!< [7..7] Upper threshold IIR filter enable Channel 7                    */
      __IO uint32_t  FU_CH8_EN  :  1;               /*!< [8..8] Upper threshold IIR filter enable Channel 8                    */
      __IO uint32_t  FU_CH9_EN  :  1;               /*!< [9..9] Upper threshold IIR filter enable Channel 9                    */
      __IO uint32_t  FU_CH10_EN :  1;               /*!< [10..10] Upper threshold IIR filter enable Channel 10                 */
      __IO uint32_t  FU_CH11_EN :  1;               /*!< [11..11] Upper threshold IIR filter enable Channel 11                 */
    } bit;                                          /*!< [12] BitSize                                                          */
  } FILT_UP_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040B4) Lower Threshold Filter Enable                          */
    
    struct {
      __IO uint32_t  FL_CH0_EN  :  1;               /*!< [0..0] Lower threshold IIR filter enable Channel 0                    */
      __IO uint32_t  FL_CH1_EN  :  1;               /*!< [1..1] Lower threshold IIR filter enable Channel 1                    */
      __IO uint32_t  FL_CH2_EN  :  1;               /*!< [2..2] Lower threshold IIR filter enable Channel 2                    */
      __IO uint32_t  FL_CH3_EN  :  1;               /*!< [3..3] Lower threshold IIR filter enable Channel 3                    */
      __IO uint32_t  FL_CH4_EN  :  1;               /*!< [4..4] Lower threshold IIR filter enable Channel 4                    */
      __IO uint32_t  FL_CH5_EN  :  1;               /*!< [5..5] Lower threshold IIR filter enable Channel 5                    */
      __IO uint32_t  FL_CH6_EN  :  1;               /*!< [6..6] Lower threshold IIR filter enable Channel 6                    */
      __IO uint32_t  FL_CH7_EN  :  1;               /*!< [7..7] Lower threshold IIR filter enable Channel 7                    */
      __IO uint32_t  FL_CH8_EN  :  1;               /*!< [8..8] Lower threshold IIR filter enable Channel 8                    */
      __IO uint32_t  FL_CH9_EN  :  1;               /*!< [9..9] Lower threshold IIR filter enable Channel 9                    */
      __IO uint32_t  FL_CH10_EN :  1;               /*!< [10..10] Lower threshold IIR filter enable Channel 10                 */
      __IO uint32_t  FL_CH11_EN :  1;               /*!< [11..11] Lower threshold IIR filter enable Channel 11                 */
    } bit;                                          /*!< [12] BitSize                                                          */
  } FILT_LO_CTRL;
  __I  uint32_t  RESERVED1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040BC) ADC1 Status Register                                   */
    
    struct {
      __IO uint32_t  DAC_IN     :  3;               /*!< [0..2] Programs the 2-bit DAC for functional test                     */
           uint32_t             : 13;
      __IO uint32_t  SOC_JITTER :  2;               /*!< [16..17] Programs Soc Clock Jitter                                    */
           uint32_t             : 13;
      __IO uint32_t  SD_FEEDB_ON:  1;               /*!< [31..31] Sigma Delta Feedback Loop                                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } STATUS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040C0) Lower Comparator Trigger Level Channel 8-11            */
    
