zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  CH8_LOW    :  8;               /*!< [0..7] Channel 8 lower trigger level                                  */
      __IO uint32_t  CH9_LOW    :  8;               /*!< [8..15] Channel 9 lower trigger level                                 */
      __IO uint32_t  CH10_LOW   :  8;               /*!< [16..23] Channel 10 lower trigger level                               */
      __IO uint32_t  CH11_LOW   :  8;               /*!< [24..31] Channel 11 lower trigger level                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH8_11_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040C4) Lower Comparator Trigger Level Differential Channel
                                                         1-4                                                                   */
    
    struct {
      __IO uint32_t  DCH1_LOW   :  8;               /*!< [0..7] Differential Channel 1 lower trigger level                     */
      __IO uint32_t  DCH2_LOW   :  8;               /*!< [8..15] Differential Channel 2 lower trigger level                    */
      __IO uint32_t  DCH3_LOW   :  8;               /*!< [16..23] Differential Channel 3 lower trigger level                   */
      __IO uint32_t  DCH4_LOW   :  8;               /*!< [24..31] Differential Channel 4 lower trigger level                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } DCHTH1_4_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040C8) Upper Comparator Trigger Level Channel 0-3             */
    
    struct {
      __IO uint32_t  CH0_UP     :  8;               /*!< [0..7] Channel 0 upper trigger level                                  */
      __IO uint32_t  CH1_UP     :  8;               /*!< [8..15] Channel 1 upper trigger level                                 */
      __IO uint32_t  CH2_UP     :  8;               /*!< [16..23] Channel 2 upper trigger level                                */
      __IO uint32_t  CH3_UP     :  8;               /*!< [24..31] Channel 3 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040CC) Upper Comparator Trigger Level Channel 4-7             */
    
    struct {
      __IO uint32_t  CH4_UP     :  8;               /*!< [0..7] Channel 4 upper trigger level                                  */
      __IO uint32_t  CH5_UP     :  8;               /*!< [8..15] Channel 5 upper trigger level                                 */
      __IO uint32_t  CH6_UP     :  8;               /*!< [16..23] Channel 6upper trigger level                                 */
      __IO uint32_t  CH7_UP     :  8;               /*!< [24..31] Channel 7 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH4_7_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040D0) Upper Comparator Trigger Level Channel 8-11            */
    
    struct {
      __IO uint32_t  CH8_UP     :  8;               /*!< [0..7] Channel 8 upper trigger level                                  */
      __IO uint32_t  CH9_UP     :  8;               /*!< [8..15] Channel 9 upper trigger level                                 */
      __IO uint32_t  CH10_UP    :  8;               /*!< [16..23] Channel 10 upper trigger level                               */
      __IO uint32_t  CH11_UP    :  8;               /*!< [24..31] Channel 11 upper trigger level                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH8_11_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040D4) Upper Comparator Trigger Level Differential Channel
                                                         1-4                                                                   */
    
    struct {
      __IO uint32_t  DCH1_UP    :  8;               /*!< [0..7] Differential Channel 1 upper trigger level                     */
      __IO uint32_t  DCH2_UP    :  8;               /*!< [8..15] Differential Channel 2 upper trigger level                    */
      __IO uint32_t  DCH3_UP    :  8;               /*!< [16..23] Differential Channel 3 upper trigger level                   */
      __IO uint32_t  DCH4_UP    :  8;               /*!< [24..31] Differential Channel 4 upper trigger level                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } DCHTH1_4_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040D8) Lower Counter Trigger Level Channel 0-3                */
    
    struct {
      __IO uint32_t  CNT_LO_CH0 :  3;               /*!< [0..2] Lower timer trigger threshold channel 0                        */
      __IO uint32_t  HYST_LO_CH0:  2;               /*!< [3..4] Channel 0 lower hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH1 :  3;               /*!< [8..10] Lower timer trigger threshold channel 1                       */
      __IO uint32_t  HYST_LO_CH1:  2;               /*!< [11..12] Channel 1 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH2 :  3;               /*!< [16..18] Lower timer trigger threshold channel 2                      */
      __IO uint32_t  HYST_LO_CH2:  2;               /*!< [19..20] Channel 2 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH3 :  3;               /*!< [24..26] Lower timer trigger threshold channel 3                      */
      __IO uint32_t  HYST_LO_CH3:  2;               /*!< [27..28] Channel 3 lower hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT0_3_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040DC) Lower Counter Trigger Level Channel 4-7                */
    
