zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  CNT_LO_CH4 :  3;               /*!< [0..2] Lower timer trigger threshold channel 4                        */
      __IO uint32_t  HYST_LO_CH4:  2;               /*!< [3..4] Channel 4 lower hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH5 :  3;               /*!< [8..10] Lower timer trigger threshold channel 5                       */
      __IO uint32_t  HYST_LO_CH5:  2;               /*!< [11..12] Channel 5 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH6 :  3;               /*!< [16..18] Lower timer trigger threshold channel 6                      */
      __IO uint32_t  HYST_LO_CH6:  2;               /*!< [19..20] Channel 6 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH7 :  3;               /*!< [24..26] Lower timer trigger threshold channel 7                      */
      __IO uint32_t  HYST_LO_CH7:  2;               /*!< [27..28] Channel 7 lower hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT4_7_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040E0) Lower Counter Trigger Level Channel 8-11               */
    
    struct {
      __IO uint32_t  CNT_LO_CH8 :  3;               /*!< [0..2] Lower timer trigger threshold channel 8                        */
      __IO uint32_t  HYST_LO_CH8:  2;               /*!< [3..4] Channel 8 lower hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH9 :  3;               /*!< [8..10] Lower timer trigger threshold channel 9                       */
      __IO uint32_t  HYST_LO_CH9:  2;               /*!< [11..12] Channel 9 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH10:  3;               /*!< [16..18] Lower timer trigger threshold channel 10                     */
      __IO uint32_t  HYST_LO_CH10:  2;              /*!< [19..20] Channel 10 lower hysteresis                                  */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH11:  3;               /*!< [24..26] Lower timer trigger threshold channel 11                     */
      __IO uint32_t  HYST_LO_CH11:  2;              /*!< [27..28] Channel 11 lower hysteresis                                  */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT8_11_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040E4) Lower Counter Trigger Level Differential Channel
                                                         1-4                                                                   */
    
    struct {
      __IO uint32_t  CNT_LO_DCH1:  3;               /*!< [0..2] Lower timer trigger threshold differential channel 1           */
      __IO uint32_t  HYST_LO_DCH1:  2;              /*!< [3..4] Differential Channel 1 lower hysteresis                        */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_DCH2:  3;               /*!< [8..10] Lower timer trigger threshold differential channel 2          */
      __IO uint32_t  HYST_LO_DCH2:  2;              /*!< [11..12] Differential Channel 2 lower hysteresis                      */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_DCH3:  3;               /*!< [16..18] Lower timer trigger threshold differential channel
                                                         3                                                                     */
      __IO uint32_t  HYST_LO_DCH3:  2;              /*!< [19..20] Differential Channel 3 lower hysteresis                      */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_DCH4:  3;               /*!< [24..26] Lower timer trigger threshold differential channel
                                                         4                                                                     */
      __IO uint32_t  HYST_LO_DCH4:  2;              /*!< [27..28] Differential Channel 4 lower hysteresis                      */
    } bit;                                          /*!< [29] BitSize                                                          */
  } DCHCNT1_4_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040E8) Upper Counter Trigger Level Channel 0-3                */
    
    struct {
      __IO uint32_t  CNT_UP_CH0 :  3;               /*!< [0..2] Upper timer trigger threshold channel 0                        */
      __IO uint32_t  HYST_UP_CH0:  2;               /*!< [3..4] Channel 0 upper hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH1 :  3;               /*!< [8..10] Upper timer trigger threshold channel 1                       */
      __IO uint32_t  HYST_UP_CH1:  2;               /*!< [11..12] Channel 1 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH2 :  3;               /*!< [16..18] Upper timer trigger threshold channel 2                      */
      __IO uint32_t  HYST_UP_CH2:  2;               /*!< [19..20] Channel 2 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH3 :  3;               /*!< [24..26] Upper timer trigger threshold channel 3                      */
      __IO uint32_t  HYST_UP_CH3:  2;               /*!< [27..28] Channel 3 upper hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT0_3_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040EC) Upper Counter Trigger Level Channel 4-7                */
    
