zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  CNT_UP_CH4 :  3;               /*!< [0..2] Upper timer trigger threshold channel 4                        */
      __IO uint32_t  HYST_UP_CH4:  2;               /*!< [3..4] Channel 4 upper hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH5 :  3;               /*!< [8..10] Upper timer trigger threshold channel 5                       */
      __IO uint32_t  HYST_UP_CH5:  2;               /*!< [11..12] Channel 5 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH6 :  3;               /*!< [16..18] Upper timer trigger threshold channel 6                      */
      __IO uint32_t  HYST_UP_CH6:  2;               /*!< [19..20] Channel 6 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH7 :  3;               /*!< [24..26] Upper timer trigger threshold channel 7                      */
      __IO uint32_t  HYST_UP_CH7:  2;               /*!< [27..28] Channel 7 upper hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT4_7_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040F0) Upper Counter Trigger Level Channel 8-11               */
    
    struct {
      __IO uint32_t  CNT_UP_CH8 :  3;               /*!< [0..2] Upper timer trigger threshold channel 8                        */
      __IO uint32_t  HYST_UP_CH8:  2;               /*!< [3..4] Channel 8 upper hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH9 :  3;               /*!< [8..10] Upper timer trigger threshold channel 9                       */
      __IO uint32_t  HYST_UP_CH9:  2;               /*!< [11..12] Channel 9 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH10:  3;               /*!< [16..18] Upper timer trigger threshold channel 10                     */
      __IO uint32_t  HYST_UP_CH10:  2;              /*!< [19..20] Channel 10 upper hysteresis                                  */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH11:  3;               /*!< [24..26] Upper timer trigger threshold channel 11                     */
      __IO uint32_t  HYST_UP_CH11:  2;              /*!< [27..28] Channel 11 upper hysteresis                                  */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT8_11_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040F4) Upper Counter Trigger Level Differential Channel
                                                         1-4                                                                   */
    
    struct {
      __IO uint32_t  CNT_UP_DCH1:  3;               /*!< [0..2] Upper timer trigger threshold differential channel 1           */
      __IO uint32_t  HYST_UP_DCH1:  2;              /*!< [3..4] Differential Channel 1 upper hysteresis                        */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_DCH2:  3;               /*!< [8..10] Upper timer trigger threshold differential channel 2          */
      __IO uint32_t  HYST_UP_DCH2:  2;              /*!< [11..12] Differential Channel 2 upper hysteresis                      */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_DCH3:  3;               /*!< [16..18] Upper timer trigger threshold differential channel
                                                         3                                                                     */
      __IO uint32_t  HYST_UP_DCH3:  2;              /*!< [19..20] Differential Channel 3 upper hysteresis                      */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_DCH4:  3;               /*!< [24..26] Upper timer trigger threshold differential channel
                                                         4                                                                     */
      __IO uint32_t  HYST_UP_DCH4:  2;              /*!< [27..28] Differential Channel 4 upper hysteresis                      */
    } bit;                                          /*!< [29] BitSize                                                          */
  } DCHCNT1_4_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040F8) Overvoltage Measurement Mode of Ch 0-11                */
    
    struct {
      __IO uint32_t  MMODE_0    :  2;               /*!< [0..1] Measurement mode Channel 0                                     */
      __IO uint32_t  MMODE_1    :  2;               /*!< [2..3] Measurement mode Channel 1                                     */
      __IO uint32_t  MMODE_2    :  2;               /*!< [4..5] Measurement mode Channel 2                                     */
      __IO uint32_t  MMODE_3    :  2;               /*!< [6..7] Measurement mode Channel 3                                     */
      __IO uint32_t  MMODE_4    :  2;               /*!< [8..9] Measurement mode Channel 4                                     */
      __IO uint32_t  MMODE_5    :  2;               /*!< [10..11] Measurement mode Channel 5                                   */
      __IO uint32_t  MMODE_6    :  2;               /*!< [12..13] Measurement mode Channel 6                                   */
      __IO uint32_t  MMODE_7    :  2;               /*!< [14..15] Measurement mode Channel 7                                   */
      __IO uint32_t  MMODE_8    :  2;               /*!< [16..17] Measurement mode Channel 8                                   */
      __IO uint32_t  MMODE_9    :  2;               /*!< [18..19] Measurement mode Channel 9                                   */
      __IO uint32_t  MMODE_10   :  2;               /*!< [20..21] Measurement mode Channel 10                                  */
      __IO uint32_t  MMODE_11   :  2;               /*!< [22..23] Measurement mode Channel 11                                  */
      __IO uint32_t  MMODE_D1   :  2;               /*!< [24..25] Measurement mode Differential Channel 1                      */
      __IO uint32_t  MMODE_D2   :  2;               /*!< [26..27] Measurement mode Differential Channel 2                      */
      __IO uint32_t  MMODE_D3   :  2;               /*!< [28..29] Measurement mode Differential Channel 3                      */
      __IO uint32_t  MMODE_D4   :  2;               /*!< [30..31] Measurement mode Differential Channel 4                      */
    } bit;                                          /*!< [32] BitSize                                                          */
  } MMODE0_11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x400040FC) Measurement Unit 1 - Differential Unit Input
                                                         Selection Register                                                    */
    
