zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  DU1_EN     :  1;               /*!< [0..0] Differential Unit 1 enable                                     */
           uint32_t             :  3;
      __I  uint32_t  DU1RES_NEG :  1;               /*!< [4..4] Differential Unit 1 result negative                            */
           uint32_t             :  3;
      __IO uint32_t  DU2_EN     :  1;               /*!< [8..8] Differential Unit 2 enable                                     */
           uint32_t             :  3;
      __I  uint32_t  DU2RES_NEG :  1;               /*!< [12..12] Differential Unit 2 result negative                          */
           uint32_t             :  3;
      __IO uint32_t  DU3_EN     :  1;               /*!< [16..16] Differential Unit 3 enable                                   */
           uint32_t             :  3;
      __I  uint32_t  DU3RES_NEG :  1;               /*!< [20..20] Differential Unit 3 result negative                          */
           uint32_t             :  3;
      __IO uint32_t  DU4_EN     :  1;               /*!< [24..24] Differential Unit 4 enable                                   */
           uint32_t             :  3;
      __I  uint32_t  DU4RES_NEG :  1;               /*!< [28..28] Differential Unit 4 result negative                          */
    } bit;                                          /*!< [29] BitSize                                                          */
  } DUIN_SEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004100) ADC1 Interrupt Status 2 Register                       */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  VS_LO_IS   :  1;               /*!< [1..1] ADC1 VS Lower Threshold Interrupt Status                       */
      __IO uint32_t  MON1_LO_IS :  1;               /*!< [2..2] ADC1 MON 1 Lower Threshold Interrupt Status                    */
      __IO uint32_t  MON2_LO_IS :  1;               /*!< [3..3] ADC1 MON 2 Lower Threshold Interrupt Status                    */
      __IO uint32_t  MON3_LO_IS :  1;               /*!< [4..4] ADC1 MON 3 Lower Threshold Interrupt Status                    */
      __IO uint32_t  MON4_LO_IS :  1;               /*!< [5..5] ADC1 MON 4 Lower Threshold Interrupt Status                    */
      __IO uint32_t  MON5_LO_IS :  1;               /*!< [6..6] ADC1 MON 5 Lower Threshold Interrupt Status                    */
      __IO uint32_t  P2_1_LO_IS :  1;               /*!< [7..7] ADC1 Port 2.1 Lower Threshold Interrupt Status                 */
      __IO uint32_t  P2_2_LO_IS :  1;               /*!< [8..8] ADC1 Port 2.2 Lower Threshold Interrupt Status                 */
      __IO uint32_t  P2_3_LO_IS :  1;               /*!< [9..9] ADC1 Port 2.3 Lower Threshold Interrupt Status                 */
      __IO uint32_t  P2_6_LO_IS :  1;               /*!< [10..10] ADC1 Port 2.6 Lower Threshold Interrupt Status               */
      __IO uint32_t  P2_7_LO_IS :  1;               /*!< [11..11] ADC1 Port 2.7 Lower Threshold Interrupt Status               */
           uint32_t             :  5;
      __IO uint32_t  VS_UP_IS   :  1;               /*!< [17..17] ADC1 VS Upper Threshold Interrupt Status                     */
      __IO uint32_t  MON1_UP_IS :  1;               /*!< [18..18] ADC1 MON 1 Upper Threshold Interrupt Status                  */
      __IO uint32_t  MON2_UP_IS :  1;               /*!< [19..19] ADC1 MON 2 Upper Threshold Interrupt Status                  */
      __IO uint32_t  MON3_UP_IS :  1;               /*!< [20..20] ADC1 MON 3 Upper Threshold Interrupt Status                  */
      __IO uint32_t  MON4_UP_IS :  1;               /*!< [21..21] ADC1 MON 4 Upper Threshold Interrupt Status                  */
      __IO uint32_t  MON5_UP_IS :  1;               /*!< [22..22] ADC1 MON 5 Upper Threshold Interrupt Status                  */
      __IO uint32_t  P2_1_UP_IS :  1;               /*!< [23..23] ADC1 Port 2.1 Upper Threshold Interrupt Status               */
      __IO uint32_t  P2_2_UP_IS :  1;               /*!< [24..24] ADC1 Port 2.2 Upper Threshold Interrupt Status               */
      __IO uint32_t  P2_3_UP_IS :  1;               /*!< [25..25] ADC1 Port 2.3 Upper Threshold Interrupt Status               */
      __IO uint32_t  P2_6_UP_IS :  1;               /*!< [26..26] ADC1 Port 2.6 Upper Threshold Interrupt Status               */
      __IO uint32_t  P2_7_UP_IS :  1;               /*!< [27..27] ADC1 Port 2.7 Upper Threshold Interrupt Status               */
    } bit;                                          /*!< [28] BitSize                                                          */
  } IRQS_2;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x40004104) ADC1 Status 2 Register                                 */
    
    struct {
           uint32_t             :  1;
      __I  uint32_t  VS_LO_STS  :  1;               /*!< [1..1] ADC1 VS Lower Threshold Status                                 */
      __I  uint32_t  MON1_LO_STS:  1;               /*!< [2..2] ADC1 MON 1 Lower Threshold Status                              */
      __I  uint32_t  MON2_LO_STS:  1;               /*!< [3..3] ADC1 MON 2 Lower Threshold Status                              */
      __I  uint32_t  MON3_LO_STS:  1;               /*!< [4..4] ADC1 MON 3 Lower Threshold Status                              */
      __I  uint32_t  MON4_LO_STS:  1;               /*!< [5..5] ADC1 MON 4 Lower Threshold Status                              */
      __I  uint32_t  MON5_LO_STS:  1;               /*!< [6..6] ADC1 MON 5 Lower Threshold Status                              */
      __I  uint32_t  P2_1_LO_STS:  1;               /*!< [7..7] ADC1 Port 2.1 Lower Threshold Status                           */
      __I  uint32_t  P2_2_LO_STS:  1;               /*!< [8..8] ADC1 Port 2.2 Lower Threshold Status                           */
      __I  uint32_t  P2_3_LO_STS:  1;               /*!< [9..9] ADC1 Port 2.3 Lower Threshold Status                           */
      __I  uint32_t  P2_6_LO_STS:  1;               /*!< [10..10] ADC1 Port 2.6 Lower Threshold Status                         */
      __I  uint32_t  P2_7_LO_STS:  1;               /*!< [11..11] ADC1 Port 2.7 Lower Threshold Status                         */
           uint32_t             :  5;
      __I  uint32_t  VS_UP_STS  :  1;               /*!< [17..17] ADC1 VS Upper Threshold Status                               */
      __I  uint32_t  MON1_UP_STS:  1;               /*!< [18..18] ADC1 MON 1 Upper Threshold Status                            */
      __I  uint32_t  MON2_UP_STS:  1;               /*!< [19..19] ADC1 MON 2 Upper Threshold Status                            */
      __I  uint32_t  MON3_UP_STS:  1;               /*!< [20..20] ADC1 MON 3 Upper Threshold Status                            */
      __I  uint32_t  MON4_UP_STS:  1;               /*!< [21..21] ADC1 MON 4 Upper Threshold Status                            */
      __I  uint32_t  MON5_UP_STS:  1;               /*!< [22..22] ADC1 MON 5 Upper Threshold Status                            */
      __I  uint32_t  P2_1_UP_STS:  1;               /*!< [23..23] ADC1 Port 2.1 Upper Threshold Status                         */
      __I  uint32_t  P2_2_UP_STS:  1;               /*!< [24..24] ADC1 Port 2.2 Upper Threshold Status                         */
      __I  uint32_t  P2_3_UP_STS:  1;               /*!< [25..25] ADC1 Port 2.3 Upper Threshold Status                         */
      __I  uint32_t  P2_6_UP_STS:  1;               /*!< [26..26] ADC1 Port 2.6 Upper Threshold Status                         */
      __I  uint32_t  P2_7_UP_STS:  1;               /*!< [27..27] ADC1 Port 2.7 Upper Threshold Status                         */
    } bit;                                          /*!< [28] BitSize                                                          */
  } STS_2;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x40004108) ADC1 Interrupt Status Clear 2 Register                 */
    
