zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  1;
      __O  uint32_t  VS_LO_ISC  :  1;               /*!< [1..1] ADC1 VS Lower Threshold Interrupt Status Clear                 */
      __O  uint32_t  MON1_LO_ISC:  1;               /*!< [2..2] ADC1 MON 1 Lower Threshold Interrupt Status Clear              */
      __O  uint32_t  MON2_LO_ISC:  1;               /*!< [3..3] ADC1 MON 2 Lower Threshold Interrupt Status Clear              */
      __O  uint32_t  MON3_LO_ISC:  1;               /*!< [4..4] ADC1 MON 3 Lower Threshold Interrupt Status Clear              */
      __O  uint32_t  MON4_LO_ISC:  1;               /*!< [5..5] ADC1 MON 4 Lower Threshold Interrupt Status Clear              */
      __O  uint32_t  MON5_LO_ISC:  1;               /*!< [6..6] ADC1 MON 5 Lower Threshold Interrupt Status Clear              */
      __O  uint32_t  P2_1_LO_ISC:  1;               /*!< [7..7] ADC1 Port 2.1 Lower Threshold Interrupt Status Clear           */
      __O  uint32_t  P2_2_LO_ISC:  1;               /*!< [8..8] ADC1 Port 2.2 Lower Threshold Interrupt Status Clear           */
      __O  uint32_t  P2_3_LO_ISC:  1;               /*!< [9..9] ADC1 Port 2.3 Lower Threshold Interrupt Status Clear           */
      __O  uint32_t  P2_6_LO_ISC:  1;               /*!< [10..10] ADC1 Port 2.6 Lower Threshold Interrupt Status Clear         */
      __O  uint32_t  P2_7_LO_ISC:  1;               /*!< [11..11] ADC1 Port 2.7 Lower Threshold Interrupt Status Clear         */
           uint32_t             :  5;
      __O  uint32_t  VS_UP_ISC  :  1;               /*!< [17..17] ADC1 VS Upper Threshold Interrupt Status Clear               */
      __O  uint32_t  MON1_UP_ISC:  1;               /*!< [18..18] ADC1 MON 1 Upper Threshold Interrupt Status Clear            */
      __O  uint32_t  MON2_UP_ISC:  1;               /*!< [19..19] ADC1 MON 2 Upper Threshold Interrupt Status Clear            */
      __O  uint32_t  MON3_UP_ISC:  1;               /*!< [20..20] ADC1 MON 3 Upper Threshold Interrupt Status Clear            */
      __O  uint32_t  MON4_UP_ISC:  1;               /*!< [21..21] ADC1 MON 4 Upper Threshold Interrupt Status Clear            */
      __O  uint32_t  MON5_UP_ISC:  1;               /*!< [22..22] ADC1 MON 5 Upper Threshold Interrupt Status Clear            */
      __O  uint32_t  P2_1_UP_ISC:  1;               /*!< [23..23] ADC1 Port 2.1 Upper Threshold Interrupt Status Clear         */
      __O  uint32_t  P2_2_UP_ISC:  1;               /*!< [24..24] ADC1 Port 2.2 Upper Threshold Interrupt Status Clear         */
      __O  uint32_t  P2_3_UP_ISC:  1;               /*!< [25..25] ADC1 Port 2.3 Upper Threshold Interrupt Status Clear         */
      __O  uint32_t  P2_6_UP_ISC:  1;               /*!< [26..26] ADC1 Port 2.6 Upper Threshold Interrupt Status Clear         */
      __O  uint32_t  P2_7_UP_ISC:  1;               /*!< [27..27] ADC1 Port 2.7 Upper Threshold Interrupt Status Clear         */
    } bit;                                          /*!< [28] BitSize                                                          */
  } IRQCLR_2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000410C) ADC1 Interrupt Enable 2 Register                       */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  VS_LO_IEN  :  1;               /*!< [1..1] ADC1 VS Lower Threshold Interrupt Enable                       */
      __IO uint32_t  MON1_LO_IEN:  1;               /*!< [2..2] ADC1 MON 1 Lower Threshold Interrupt Enable                    */
      __IO uint32_t  MON2_LO_IEN:  1;               /*!< [3..3] ADC1 MON 2 Lower Threshold Interrupt Enable                    */
      __IO uint32_t  MON3_LO_IEN:  1;               /*!< [4..4] ADC1 MON 3 Lower Threshold Interrupt Enable                    */
      __IO uint32_t  MON4_LO_IEN:  1;               /*!< [5..5] ADC1 MON 4 Lower Threshold Interrupt Enable                    */
      __IO uint32_t  MON5_LO_IEN:  1;               /*!< [6..6] ADC1 MON 5 Lower Threshold Interrupt Enable                    */
      __IO uint32_t  P2_1_LO_IEN:  1;               /*!< [7..7] ADC1 Port 2.1 Lower Threshold Interrupt Enable                 */
      __IO uint32_t  P2_2_LO_IEN:  1;               /*!< [8..8] ADC1 Port 2.2 Lower Threshold Interrupt Enable                 */
      __IO uint32_t  P2_3_LO_IEN:  1;               /*!< [9..9] ADC1 Port 2.3 Lower Threshold Interrupt Enable                 */
      __IO uint32_t  P2_6_LO_IEN:  1;               /*!< [10..10] ADC1 Port 2.6 Lower Threshold Interrupt Enable               */
      __IO uint32_t  P2_7_LO_IEN:  1;               /*!< [11..11] ADC1 Port 2.7 Lower Threshold Interrupt Enable               */
           uint32_t             :  5;
      __IO uint32_t  VS_UP_IEN  :  1;               /*!< [17..17] ADC1 VS Upper Threshold Interrupt Enable                     */
      __IO uint32_t  MON1_UP_IEN:  1;               /*!< [18..18] ADC1 MON 1 Upper Threshold Interrupt Enable                  */
      __IO uint32_t  MON2_UP_IEN:  1;               /*!< [19..19] ADC1 MON 2 Upper Threshold Interrupt Enable                  */
      __IO uint32_t  MON3_UP_IEN:  1;               /*!< [20..20] ADC1 MON 3 Upper Threshold Interrupt Enable                  */
      __IO uint32_t  MON4_UP_IEN:  1;               /*!< [21..21] ADC1 MON 4 Upper Threshold Interrupt Enable                  */
      __IO uint32_t  MON5_UP_IEN:  1;               /*!< [22..22] ADC1 MON 5 Upper Threshold Interrupt Enable                  */
      __IO uint32_t  P2_1_UP_IEN:  1;               /*!< [23..23] ADC1 Port 2.1 Upper Threshold Interrupt Enable               */
      __IO uint32_t  P2_2_UP_IEN:  1;               /*!< [24..24] ADC1 Port 2.2 Upper Threshold Interrupt Enable               */
      __IO uint32_t  P2_3_UP_IEN:  1;               /*!< [25..25] ADC1 Port 2.3 Upper Threshold Interrupt Enable               */
      __IO uint32_t  P2_6_UP_IEN:  1;               /*!< [26..26] ADC1 Port 2.6 Upper Threshold Interrupt Enable               */
      __IO uint32_t  P2_7_UP_IEN:  1;               /*!< [27..27] ADC1 Port 2.7 Upper Threshold Interrupt Enable               */
    } bit;                                          /*!< [28] BitSize                                                          */
  } IRQEN_2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004110) ADC1 or Filter Output Channel 12                       */
    
