zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  FILT_OUT_CH12: 12;             /*!< [0..11] ADC or filter output value channel 12                         */
           uint32_t             :  4;
      __IO uint32_t  WFR12      :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF12       :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF12       :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUT12;
  __I  uint32_t  RESERVED2[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004120) ADC1 or Filter Output of EIM                           */
    
    struct {
      __I  uint32_t  FILT_OUT_EIM: 12;              /*!< [0..11] ADC or filter output value for last EIM measurement           */
           uint32_t             :  4;
      __IO uint32_t  WFR_EIM    :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF_EIM     :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF_EIM     :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } FILT_OUTEIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004124) ADC1 Status 1 Register                                 */
    
    struct {
           uint32_t             : 24;
      __IO uint32_t  DU1LO_STS  :  1;               /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Status          */
      __IO uint32_t  DU1UP_STS  :  1;               /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Status          */
      __IO uint32_t  DU2LO_STS  :  1;               /*!< [26..26] ADC1 Differential Unit 2 (DU2) lower Channel Status          */
      __IO uint32_t  DU2UP_STS  :  1;               /*!< [27..27] ADC1 Differential Unit 2 (DU2) upper Channel Status          */
      __IO uint32_t  DU3LO_STS  :  1;               /*!< [28..28] ADC1 Differential Unit 3 (DU3) lower Channel Status          */
      __IO uint32_t  DU3UP_STS  :  1;               /*!< [29..29] ADC1 Differential Unit 3 (DU3) upper Channel Status          */
      __IO uint32_t  DU4LO_STS  :  1;               /*!< [30..30] ADC1 Differential Unit 4 (DU4) lower Channel Status          */
      __IO uint32_t  DU4UP_STS  :  1;               /*!< [31..31] ADC1 Differential Unit 4 (DU4) upper Channel Status          */
    } bit;                                          /*!< [32] BitSize                                                          */
  } STS_1;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x40004128) ADC1 Status Clear 1 Register                           */
    
    struct {
           uint32_t             : 24;
      __O  uint32_t  DU1LO_SC   :  1;               /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU1UP_SC   :  1;               /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU2LO_SC   :  1;               /*!< [26..26] ADC1 Differential Unit 2 (DU2) lower Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU2UP_SC   :  1;               /*!< [27..27] ADC1 Differential Unit 2 (DU2) upper Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU3LO_SC   :  1;               /*!< [28..28] ADC1 Differential Unit 3 (DU3) lower Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU3UP_SC   :  1;               /*!< [29..29] ADC1 Differential Unit 3 (DU3) upper Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU4LO_SC   :  1;               /*!< [30..30] ADC1 Differential Unit 4 (DU4) lower Channel Status
                                                         Clear                                                                 */
      __O  uint32_t  DU4UP_SC   :  1;               /*!< [31..31] ADC1 Differential Unit 4 (DU4) upper Channel Status
                                                         Clear                                                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } STSCLR_1;
} ADC1_Type;


/* ================================================================================ */
/* ================                      ADC2                      ================ */
/* ================================================================================ */


/**
  * @brief ADC2 (ADC2)
  */

typedef struct {                                    /*!< (@ 0x4801C000) ADC2 Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C000) ADC2 Control and Status Register                       */
    
    struct {
           uint32_t             :  2;
      __IO uint32_t  SOS        :  1;               /*!< [2..2] ADC2 Start of Sampling/Conversion (software mode)              */
      __I  uint32_t  EOC        :  1;               /*!< [3..3] ADC2 End of Conversion (software mode)                         */
           uint32_t             :  4;
      __IO uint32_t  IN_MUX_SEL :  4;               /*!< [8..11] Channel for software mode                                     */
    } bit;                                          /*!< [12] BitSize                                                          */
  } CTRL_STS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C004) Sequencer Feedback Register                            */
    
