zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  SQ_FB      :  4;               /*!< [0..3] Current Sequence that caused software mode                     */
           uint32_t             :  4;
      __I  uint32_t  SQ_STOP    :  1;               /*!< [8..8] ADC2 Sequencer Stop Signal for DPP                             */
      __I  uint32_t  EIM_ACTIVE :  1;               /*!< [9..9] ADC2 EIM active                                                */
           uint32_t             :  1;
      __I  uint32_t  SQx_STS    :  3;               /*!< [11..13] Current Active ADC2 Sequence                                 */
           uint32_t             :  2;
      __I  uint32_t  CHx_STS    :  4;               /*!< [16..19] Current ADC2 Channel                                         */
    } bit;                                          /*!< [20] BitSize                                                          */
  } SQ_FB;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C008) Channel Settings Bits for Exceptional Interrupt
                                                         Measurement                                                           */
    
    struct {
      __IO uint32_t  CHx_SEL    :  3;               /*!< [0..2] Channel set for exceptional interrupt measurement (EIM)        */
           uint32_t             :  5;
      __IO uint32_t  REP        :  3;               /*!< [8..10] Repeat count for exceptional interrupt measurement (EIM)      */
      __IO uint32_t  EN         :  1;               /*!< [11..11] Exceptional interrupt measurement (EIM) Trigger Event
                                                         enable                                                                */
      __IO uint32_t  SEL        :  1;               /*!< [12..12] Exceptional interrupt measurement (EIM) Trigger select       */
    } bit;                                          /*!< [13] BitSize                                                          */
  } CHx_EIM;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C010) Maximum Time for Software Mode                         */
    
    struct {
      __IO uint32_t  MAX_TIME   :  8;               /*!< [0..7] Maximum Time in Software Mode                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MAX_TIME;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C014) Measurement Unit Control Register 1                    */
    
    struct {
      __IO uint32_t  CALIB_EN_6_0:  7;              /*!< [0..6] Calibration Enable for Channels 6 to 0                         */
    } bit;                                          /*!< [7] BitSize                                                           */
  } CTRL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C018) Measurement Unit Control Register 2                    */
    
    struct {
      __IO uint32_t  MCM_PD_N   :  1;               /*!< [0..0] Power Down Signal for MCM                                      */
           uint32_t             :  6;
      __I  uint32_t  MCM_RDY    :  1;               /*!< [7..7] Ready Signal for MCM after Power On or Reset                   */
      __IO uint32_t  SAMPLE_TIME_int:  4;           /*!< [8..11] Sample time of ADC2                                           */
    } bit;                                          /*!< [12] BitSize                                                          */
  } CTRL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C01C) Measurement Unit Control Register 4                    */
    
    struct {
      __IO uint32_t  FILT_OUT_SEL_6_0:  7;          /*!< [0..6] Output Filter Selection for Channels 0 to 5                    */
    } bit;                                          /*!< [7] BitSize                                                           */
  } CTRL4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C020) Measurement Channel Enable Bits for Cycle 1-4          */
    
    struct {
      __IO uint32_t  SQ1        :  7;               /*!< [0..6] Sequence 1 channel enable                                      */
           uint32_t             :  1;
      __IO uint32_t  SQ2        :  7;               /*!< [8..14] Sequence 2 channel enable                                     */
           uint32_t             :  1;
      __IO uint32_t  SQ3        :  7;               /*!< [16..22] Sequence 3 channel enable                                    */
           uint32_t             :  1;
      __IO uint32_t  SQ4        :  7;               /*!< [24..30] Sequence 4 channel enable                                    */
    } bit;                                          /*!< [31] BitSize                                                          */
  } SQ1_4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C024) Measurement Channel Enable Bits for Cycle 5 -
                                                         8                                                                     */
    
    struct {
      __IO uint32_t  SQ5        :  7;               /*!< [0..6] Sequence 5 channel enable                                      */
           uint32_t             :  1;
      __IO uint32_t  SQ6        :  7;               /*!< [8..14] Sequence 6 channel enable                                     */
           uint32_t             :  1;
      __IO uint32_t  SQ7        :  7;               /*!< [16..22] Sequence 7 channel enable                                    */
    } bit;                                          /*!< [23] BitSize                                                          */
  } SQ5_8;
  __I  uint32_t  RESERVED1[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C034) Calibration for Channel 0 & 1                          */
    
