zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  OFFS_CH0   :  5;               /*!< [0..4] Offset Calibration for channel 0                               */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH0   :  8;               /*!< [8..15] Gain Calibration for channel 0                                */
      __IO uint32_t  OFFS_CH1   :  5;               /*!< [16..20] Offset Calibration for channel 1                             */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH1   :  8;               /*!< [24..31] Gain Calibration for channel 1                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH0_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C038) Calibration for Channel 2 & 3                          */
    
    struct {
      __IO uint32_t  OFFS_CH2   :  5;               /*!< [0..4] Offset Calibration for channel 2                               */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH2   :  8;               /*!< [8..15] Gain Calibration for channel 2                                */
      __IO uint32_t  OFFS_CH3   :  5;               /*!< [16..20] Offset Calibration for channel 3                             */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH3   :  8;               /*!< [24..31] Gain Calibration for channel 3                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH2_3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C03C) Calibration for Channel 4 & 5                          */
    
    struct {
      __IO uint32_t  OFFS_CH4   :  5;               /*!< [0..4] Offset Calibration for channel 4                               */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH4   :  8;               /*!< [8..15] Gain Calibration for channel 4                                */
      __IO uint32_t  OFFS_CH5   :  5;               /*!< [16..20] Offset Calibration for channel 5                             */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH5   :  8;               /*!< [24..31] Gain Calibration for channel 5                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH4_5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C040) Calibration for Channel 6 & 7                          */
    
    struct {
      __IO uint32_t  OFFS_CH6   :  5;               /*!< [0..4] Offset Calibration for channel 6                               */
           uint32_t             :  3;
      __IO uint32_t  GAIN_CH6   :  8;               /*!< [8..15] Gain Calibration for channel 6                                */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CAL_CH6_7;
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C048) Filter Coefficients ADC Channel 0-7                    */
    
    struct {
      __IO uint32_t  A_CH0      :  2;               /*!< [0..1] Filter Coefficient A for ADC channel 0                         */
      __IO uint32_t  A_CH1      :  2;               /*!< [2..3] Filter Coefficient A for ADC channel 1                         */
      __IO uint32_t  A_CH2      :  2;               /*!< [4..5] Filter Coefficient A for ADC channel 2                         */
      __IO uint32_t  A_CH3      :  2;               /*!< [6..7] Filter Coefficient A for ADC channel 3                         */
      __IO uint32_t  A_CH4      :  2;               /*!< [8..9] Filter Coefficient A for ADC channel 4                         */
      __IO uint32_t  A_CH5      :  2;               /*!< [10..11] Filter Coefficient A for ADC channel 5                       */
      __IO uint32_t  A_CH6      :  2;               /*!< [12..13] Filter Coefficient A for ADC channel 6                       */
      __IO uint32_t  A_CH7      :  2;               /*!< [14..15] Filter Coefficient A for ADC channel 7                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } FILTCOEFF0_7;
  __I  uint32_t  RESERVED3;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C050) ADC or Filter Output Channel 0                         */
    
    struct {
      __I  uint32_t  OUT_CH0    : 10;               /*!< [0..9] ADC or filter output value channel 0                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C054) ADC or Filter Output Channel 1                         */
    
    struct {
      __I  uint32_t  OUT_CH1    : 10;               /*!< [0..9] ADC or filter output value channel 1                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT1;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C058) ADC or Filter Output Channel 2                         */
    
    struct {
      __I  uint32_t  OUT_CH2    : 10;               /*!< [0..9] ADC or filter output value channel 2                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT2;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C05C) ADC or Filter Output Channel 3                         */
    
