zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  OUT_CH3    : 10;               /*!< [0..9] ADC or filter output value channel 3                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT3;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C060) ADC or Filter Output Channel 4                         */
    
    struct {
      __I  uint32_t  OUT_CH4    : 10;               /*!< [0..9] ADC or filter output value channel 4                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT4;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C064) ADC or Filter Output Channel 5                         */
    
    struct {
      __I  uint32_t  OUT_CH5    : 10;               /*!< [0..9] ADC or filter output value channel 5                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT5;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C068) ADC or Filter Output Channel 6                         */
    
    struct {
      __I  uint32_t  OUT_CH6    : 10;               /*!< [0..9] ADC or filter output value channel 6                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT6;
  __I  uint32_t  RESERVED4[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C078) Upper Threshold Filter Enable                          */
    
    struct {
      __IO uint32_t  UPEN_Ch0   :  1;               /*!< [0..0] Upper threshold IIR filter enable ch 0                         */
      __IO uint32_t  UPEN_Ch1   :  1;               /*!< [1..1] Upper threshold IIR filter enable ch 1                         */
      __IO uint32_t  UPEN_Ch2   :  1;               /*!< [2..2] Upper threshold IIR filter enable ch 2                         */
      __IO uint32_t  UPEN_Ch3   :  1;               /*!< [3..3] Upper threshold IIR filter enable ch 3                         */
      __IO uint32_t  UPEN_Ch4   :  1;               /*!< [4..4] Upper threshold IIR filter enable ch 4                         */
      __IO uint32_t  UPEN_Ch5   :  1;               /*!< [5..5] Upper threshold IIR filter enable ch 5                         */
      __IO uint32_t  UPEN_Ch6   :  1;               /*!< [6..6] Upper threshold IIR filter enable ch 6                         */
    } bit;                                          /*!< [7] BitSize                                                           */
  } FILT_UP_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C07C) Lower Threshold Filter Enable                          */
    
    struct {
      __IO uint32_t  LOEN_Ch0   :  1;               /*!< [0..0] Lower threshold IIR filter enable ch 0                         */
      __IO uint32_t  LOEN_Ch1   :  1;               /*!< [1..1] Lower threshold IIR filter enable ch 1                         */
      __IO uint32_t  LOEN_Ch2   :  1;               /*!< [2..2] Lower threshold IIR filter enable ch 2                         */
      __IO uint32_t  LOEN_Ch3   :  1;               /*!< [3..3] Lower threshold IIR filter enable ch 3                         */
      __IO uint32_t  LOEN_Ch4   :  1;               /*!< [4..4] Lower threshold IIR filter enable ch 4                         */
      __IO uint32_t  LOEN_Ch5   :  1;               /*!< [5..5] Lower threshold IIR filter enable ch 5                         */
      __IO uint32_t  LOEN_Ch6   :  1;               /*!< [6..6] Lower threshold IIR filter enable ch 6                         */
    } bit;                                          /*!< [7] BitSize                                                           */
  } FILT_LO_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C080) Lower Comparator Trigger Level Channel 0 -3            */
    
    struct {
      __IO uint32_t  THLO_CH0   :  8;               /*!< [0..7] Channel 0 lower trigger level                                  */
      __IO uint32_t  THLO_CH1   :  8;               /*!< [8..15] Channel 1 lower trigger level                                 */
      __IO uint32_t  THLO_CH2   :  8;               /*!< [16..23] Channel 2 lower trigger level                                */
      __IO uint32_t  THLO_CH3   :  8;               /*!< [24..31] Channel 3 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C084) Lower Comparator Trigger Level Channel 4 to 7          */
    
    struct {
      __IO uint32_t  THLO_CH4   :  8;               /*!< [0..7] Channel 4 lower trigger level                                  */
      __IO uint32_t  THLO_CH5   :  8;               /*!< [8..15] Channel 5 lower trigger level                                 */
      __IO uint32_t  THLO_CH6   :  8;               /*!< [16..23] Channel 6 lower trigger level                                */
      __IO uint32_t  THLO_CH7   :  8;               /*!< [24..31] Channel 7 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH4_7_LOWER;
  __I  uint32_t  RESERVED5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C08C) Upper Comparator Trigger Level Channel 0-3             */
    
    struct {
      __IO uint32_t  THUP_CH0   :  8;               /*!< [0..7] Channel 0 upper trigger level                                  */
      __IO uint32_t  THUP_CH1   :  8;               /*!< [8..15] Channel 1 upper trigger level                                 */
      __IO uint32_t  THUP_CH2   :  8;               /*!< [16..23] Channel 2 upper trigger level                                */
      __IO uint32_t  THUP_CH3   :  8;               /*!< [24..31] Channel 3 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C090) Upper Comparator Trigger Level Channel 4 -7            */
    
