zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  THUP_CH4   :  8;               /*!< [0..7] Channel 4 upper trigger level                                  */
      __IO uint32_t  THUP_CH5   :  8;               /*!< [8..15] Channel 5 upper trigger level                                 */
      __IO uint32_t  THUP_CH6   :  8;               /*!< [16..23] Channel 6 upper trigger level                                */
      __IO uint32_t  THUP_CH7   :  8;               /*!< [24..31] Channel 7 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH4_7_UPPER;
  __I  uint32_t  RESERVED6;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C098) Lower Counter Trigger Level Channel 0 - 3              */
    
    struct {
      __IO uint32_t  CNT_LO_CH0 :  3;               /*!< [0..2] Lower timer trigger threshold channel 0                        */
      __IO uint32_t  HYST_LO_CH0:  2;               /*!< [3..4] Channel 0 lower hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH1 :  3;               /*!< [8..10] Lower timer trigger threshold channel 1                       */
      __IO uint32_t  HYST_LO_CH1:  2;               /*!< [11..12] Channel 1 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH2 :  3;               /*!< [16..18] Lower timer trigger threshold channel 2                      */
      __IO uint32_t  HYST_LO_CH2:  2;               /*!< [19..20] Channel 2 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH3 :  3;               /*!< [24..26] Lower timer trigger threshold channel 3                      */
      __IO uint32_t  HYST_LO_CH3:  2;               /*!< [27..28] Channel 3 lower hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT0_3_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C09C) Lower Counter Trigger Level Channel 4 to 7             */
    
    struct {
      __IO uint32_t  CNT_LO_CH4 :  3;               /*!< [0..2] Lower timer trigger threshold channel 4                        */
      __IO uint32_t  HYST_LO_CH4:  2;               /*!< [3..4] Channel 4 lower hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH5 :  3;               /*!< [8..10] Lower timer trigger threshold channel 5                       */
      __IO uint32_t  HYST_LO_CH5:  2;               /*!< [11..12] Channel 5 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH6 :  3;               /*!< [16..18] Lower timer trigger threshold channel 6                      */
      __IO uint32_t  HYST_LO_CH6:  2;               /*!< [19..20] Channel 6 lower hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_LO_CH7 :  3;               /*!< [24..26] Lower timer trigger threshold channel 6                      */
      __IO uint32_t  HYST_LO_CH7:  2;               /*!< [27..28] Channel 6 lower hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT4_7_LOWER;
  __I  uint32_t  RESERVED7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C0A4) Upper Counter Trigger Level Channel 0 - 3              */
    
    struct {
      __IO uint32_t  CNT_UP_CH0 :  3;               /*!< [0..2] Upper timer trigger threshold channel 0                        */
      __IO uint32_t  HYST_UP_CH0:  2;               /*!< [3..4] Channel 0 upper hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH1 :  3;               /*!< [8..10] Upper timer trigger threshold channel 1                       */
      __IO uint32_t  HYST_UP_CH1:  2;               /*!< [11..12] Channel 1 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH2 :  3;               /*!< [16..18] Upper timer trigger threshold channel 2                      */
      __IO uint32_t  HYST_UP_CH2:  2;               /*!< [19..20] Channel 2 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH3 :  3;               /*!< [24..26] Upper timer trigger threshold channel 3                      */
      __IO uint32_t  HYST_UP_CH3:  2;               /*!< [27..28] Channel 3 upper hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT0_3_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C0A8) Upper Counter Trigger Level Channel 4 to 7             */
    
    struct {
      __IO uint32_t  CNT_UP_CH4 :  3;               /*!< [0..2] Upper timer trigger threshold channel 4                        */
      __IO uint32_t  HYST_UP_CH4:  2;               /*!< [3..4] Channel 4 upper hysteresis                                     */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH5 :  3;               /*!< [8..10] Upper timer trigger threshold channel 5                       */
      __IO uint32_t  HYST_UP_CH5:  2;               /*!< [11..12] Channel 5 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH6 :  3;               /*!< [16..18] Upper timer trigger threshold channel 6                      */
      __IO uint32_t  HYST_UP_CH6:  2;               /*!< [19..20] Channel 6 upper hysteresis                                   */
           uint32_t             :  3;
      __IO uint32_t  CNT_UP_CH7 :  3;               /*!< [24..26] Upper timer trigger threshold channel 7                      */
      __IO uint32_t  HYST_UP_CH7:  2;               /*!< [27..28] Channel 7 upper hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT4_7_UPPER;
  __I  uint32_t  RESERVED8;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C0B0) Measurement Mode of Ch 0-7                             */
    
