zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  MSEL_Ch0   :  2;               /*!< [0..1] Measurement mode ch 0                                          */
      __IO uint32_t  MSEL_Ch1   :  2;               /*!< [2..3] Measurement mode ch 1                                          */
      __IO uint32_t  MSEL_Ch2   :  2;               /*!< [4..5] Measurement mode ch 2                                          */
      __IO uint32_t  MSEL_Ch3   :  2;               /*!< [6..7] Measurement mode ch 3                                          */
      __IO uint32_t  MSEL_Ch4   :  2;               /*!< [8..9] Measurement mode ch 4                                          */
      __IO uint32_t  MSEL_Ch5   :  2;               /*!< [10..11] Measurement mode ch 5                                        */
      __IO uint32_t  MSEL_Ch6   :  2;               /*!< [12..13] Measurement mode ch 6                                        */
      __IO uint32_t  MSEL_Ch7   :  2;               /*!< [14..15] Measurement mode ch 7                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } MMODE0_7;
  __I  uint32_t  RESERVED9[2];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C0BC) ADC2 HV Status Register                                */
    
    struct {
           uint32_t             :  1;
      __I  uint32_t  READY      :  1;               /*!< [1..1] HVADC Ready bit                                                */
    } bit;                                          /*!< [2] BitSize                                                           */
  } STATUS;
} ADC2_Type;


/* ================================================================================ */
/* ================                      CCU6                      ================ */
/* ================================================================================ */


/**
  * @brief CCU6 (CCU6)
  */

/*lint -e46 field type should be _Bool, unsigned int or signed int [MISRA 2012 Rule 6.1, required] */

typedef struct {                                    /*!< (@ 0x4000C000) CCU6 Structure                                         */
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C000) Capture/Compare Register for Channel CC63              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel CC63 Compare Value Low Byte                           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC63R;
  __I  uint16_t  RESERVED;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C004) Timer Control Register 4                               */
    
    struct {
      __O  uint16_t  T12RR      :  1;               /*!< [0..0] Timer T12 Run Reset                                            */
      __O  uint16_t  T12RS      :  1;               /*!< [1..1] Timer T12 Run Set                                              */
      __O  uint16_t  T12RES     :  1;               /*!< [2..2] Timer T12 Reset                                                */
      __O  uint16_t  DTRES      :  1;               /*!< [3..3] Dead-Time Counter Reset                                        */
           uint16_t             :  1;
      __O  uint16_t  T12CNT     :  1;               /*!< [5..5] Timer T12 Count Event                                          */
      __O  uint16_t  T12STR     :  1;               /*!< [6..6] Timer T12 Shadow Transfer Request                              */
      __O  uint16_t  T12STD     :  1;               /*!< [7..7] Timer T12 Shadow Transfer Disable                              */
      __O  uint16_t  T13RR      :  1;               /*!< [8..8] Timer T13 Run Reset                                            */
      __O  uint16_t  T13RS      :  1;               /*!< [9..9] Timer T13 Run Set                                              */
      __O  uint16_t  T13RES     :  1;               /*!< [10..10] Timer T13 Reset                                              */
           uint16_t             :  2;
      __O  uint16_t  T13CNT     :  1;               /*!< [13..13] Timer T13 Count Event                                        */
      __O  uint16_t  T13STR     :  1;               /*!< [14..14] Timer T13 Shadow Transfer Request                            */
      __O  uint16_t  T13STD     :  1;               /*!< [15..15] Timer T13 Shadow Transfer Disable                            */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TCTR4;
  __I  uint16_t  RESERVED1;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C008) Multi-Channel Mode Output Shadow Register              */
    
    struct {
      __IO uint16_t  MCMPS      :  6;               /*!< [0..5] Multi-Channel PWM Pattern Shadow                               */
           uint16_t             :  1;
      __O  uint16_t  STRMCM     :  1;               /*!< [7..7] Shadow Transfer Request for MCMPS                              */
      __IO uint16_t  EXPHS      :  3;               /*!< [8..10] Expected Hall Pattern Shadow                                  */
      __IO uint16_t  CURHS      :  3;               /*!< [11..13] Current Hall Pattern Shadow                                  */
           uint16_t             :  1;
      __O  uint16_t  STRHP      :  1;               /*!< [15..15] Shadow Transfer Request for the Hall Pattern                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } MCMOUTS;
  __I  uint16_t  RESERVED2;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C00C) Capture/Compare Interrupt Status Reset Register        */
    
