zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __O  uint16_t  RCC60R     :  1;               /*!< [0..0] Reset Capture, Compare-Match Rising Edge Flag                  */
      __O  uint16_t  RCC60F     :  1;               /*!< [1..1] Reset Capture, Compare-Match Falling Edge Flag                 */
      __O  uint16_t  RCC61R     :  1;               /*!< [2..2] Reset Capture, Compare-Match Rising Edge Flag                  */
      __O  uint16_t  RCC61F     :  1;               /*!< [3..3] Reset Capture, Compare-Match Falling Edge Flag                 */
      __O  uint16_t  RCC62R     :  1;               /*!< [4..4] Reset Capture, Compare-Match Rising Edge Flag                  */
      __O  uint16_t  RCC62F     :  1;               /*!< [5..5] Reset Capture, Compare-Match Falling Edge Flag                 */
      __O  uint16_t  RT12OM     :  1;               /*!< [6..6] Reset Timer T12 One-Match Flag                                 */
      __O  uint16_t  RT12PM     :  1;               /*!< [7..7] Reset Timer T12 Period-Match Flag                              */
      __O  uint16_t  RT13CM     :  1;               /*!< [8..8] Reset Timer T13 Compare-Match Flag                             */
      __O  uint16_t  RT13PM     :  1;               /*!< [9..9] Reset Timer T13 Period-Match Flag                              */
      __O  uint16_t  RTRPF      :  1;               /*!< [10..10] Reset Trap Flag                                              */
           uint16_t             :  1;
      __O  uint16_t  RCHE       :  1;               /*!< [12..12] Reset Correct Hall Event Flag                                */
      __O  uint16_t  RWHE       :  1;               /*!< [13..13] Reset Wrong Hall Event Flag                                  */
      __O  uint16_t  RIDLE      :  1;               /*!< [14..14] Reset IDLE Flag                                              */
      __O  uint16_t  RSTR       :  1;               /*!< [15..15] Reset STR Flag                                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } ISR;
  __I  uint16_t  RESERVED3;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C010) Compare State Modification Register                    */
    
    struct {
      __O  uint16_t  MCC60S     :  1;               /*!< [0..0] Capture/Compare Status Modification Bit 0 (Set)                */
      __O  uint16_t  MCC61S     :  1;               /*!< [1..1] Capture/Compare Status Modification Bit 1 (Set)                */
      __O  uint16_t  MCC62S     :  1;               /*!< [2..2] Capture/Compare Status Modification Bit 2 (Set)                */
           uint16_t             :  3;
      __O  uint16_t  MCC63S     :  1;               /*!< [6..6] Capture/Compare Status Modification Bits (Set)                 */
           uint16_t             :  1;
      __O  uint16_t  MCC60R     :  1;               /*!< [8..8] Capture/Compare Status Modification Bit 0(Reset)               */
      __O  uint16_t  MCC61R     :  1;               /*!< [9..9] Capture/Compare Status Modification Bit 1(Reset)               */
      __O  uint16_t  MCC62R     :  1;               /*!< [10..10] Capture/Compare Status Modification Bit 2(Reset)             */
           uint16_t             :  3;
      __O  uint16_t  MCC63R     :  1;               /*!< [14..14] Capture/Compare Status Modification Bits (Reset)             */
    } bit;                                          /*!< [15] BitSize                                                          */
  } CMPMODIF;
  __I  uint16_t  RESERVED4;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C014) Capture/Compare Shadow Register for Channel CC60       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel 0 Capture/Compare Value           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC60SR;
  __I  uint16_t  RESERVED5;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C018) Capture/Compare Shadow Register for Channel CC61       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel 1 Capture/Compare Value           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC61SR;
  __I  uint16_t  RESERVED6;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C01C) Capture/Compare Shadow Register for Channel CC62       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel 2 Capture/Compare Value           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC62SR;
  __I  uint16_t  RESERVED7;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C020) Capture/Compare Shadow Register for Channel CC63       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel CC63 Compare Value                */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC63SR;
  __I  uint16_t  RESERVED8;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C024) Timer T12 Period Register                              */
    
    struct {
      __IO uint16_t  T12PV      : 16;               /*!< [0..15] T12 Period Value                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12PR;
  __I  uint16_t  RESERVED9;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C028) Timer T13 Period Register                              */
    
