zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint16_t  T13PV      : 16;               /*!< [0..15] T13 Period Value                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T13PR;
  __I  uint16_t  RESERVED10;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C02C) Dead-Time Control Register for Timer T12 Low           */
    
    struct {
      __IO uint16_t  DTM        :  8;               /*!< [0..7] Dead-Time                                                      */
      __IO uint16_t  DTE0       :  1;               /*!< [8..8] Dead-Time Enable Bit 0                                         */
      __IO uint16_t  DTE1       :  1;               /*!< [9..9] Dead-Time Enable Bit 1                                         */
      __IO uint16_t  DTE2       :  1;               /*!< [10..10] Dead-Time Enable Bit 2                                       */
           uint16_t             :  1;
      __I  uint16_t  DTR0       :  1;               /*!< [12..12] Dead-Time Run Indication Bit 0                               */
      __I  uint16_t  DTR1       :  1;               /*!< [13..13] Dead-Time Run Indication Bit 1                               */
      __I  uint16_t  DTR2       :  1;               /*!< [14..14] Dead-Time Run Indication Bit 2                               */
    } bit;                                          /*!< [15] BitSize                                                          */
  } T12DTC;
  __I  uint16_t  RESERVED11;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C030) Timer Control Register 0                               */
    
    struct {
      __IO uint16_t  T12CLK     :  3;               /*!< [0..2] Timer T12 Input Clock Select                                   */
      __IO uint16_t  T12PRE     :  1;               /*!< [3..3] Timer T12 Prescaler Bit                                        */
      __I  uint16_t  T12R       :  1;               /*!< [4..4] Timer T12 Run Bit                                              */
      __I  uint16_t  STE12      :  1;               /*!< [5..5] Timer T12 Shadow Transfer Enable                               */
      __I  uint16_t  CDIR       :  1;               /*!< [6..6] Count Direction of Timer T12                                   */
      __IO uint16_t  CTM        :  1;               /*!< [7..7] T12 Operating Mode                                             */
      __IO uint16_t  T13CLK     :  3;               /*!< [8..10] Timer T13 Input Clock Select                                  */
      __IO uint16_t  T13PRE     :  1;               /*!< [11..11] Timer T13 Prescaler Bit                                      */
      __I  uint16_t  T13R       :  1;               /*!< [12..12] Timer T13 Run Bit                                            */
      __I  uint16_t  STE13      :  1;               /*!< [13..13] Timer T13 Shadow Transfer Enable                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } TCTR0;
  __I  uint16_t  RESERVED12;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C034) Capture/Compare Register for Channel CC60              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel 0 Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC60R;
  __I  uint16_t  RESERVED13;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C038) Capture/Compare Register for Channel CC61              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel 1 Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC61R;
  __I  uint16_t  RESERVED14;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C03C) Capture/Compare Register for Channel CC62              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel 2 Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC62R;
  __I  uint16_t  RESERVED15;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C040) T12 Capture/Compare Mode Select Register               */
    
    struct {
      __IO uint16_t  MSEL60     :  4;               /*!< [0..3] Capture/Compare Mode Selection                                 */
      __IO uint16_t  MSEL61     :  4;               /*!< [4..7] Capture/Compare Mode Selection                                 */
      __IO uint16_t  MSEL62     :  4;               /*!< [8..11] Capture/Compare Mode Selection                                */
      __IO uint16_t  HSYNC      :  3;               /*!< [12..14] Hall Synchronization                                         */
      __IO uint16_t  DBYP       :  1;               /*!< [15..15] Delay Bypass                                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12MSEL;
  __I  uint16_t  RESERVED16;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C044) Capture/Compare Interrupt Enable Register              */
    
    struct {
      __IO uint16_t  ENCC60R    :  1;               /*!< [0..0] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 0                                                             */
      __IO uint16_t  ENCC60F    :  1;               /*!< [1..1] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 0                                                         */
      __IO uint16_t  ENCC61R    :  1;               /*!< [2..2] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 1                                                             */
      __IO uint16_t  ENCC61F    :  1;               /*!< [3..3] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 1                                                         */
      __IO uint16_t  ENCC62R    :  1;               /*!< [4..4] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 2                                                             */
      __IO uint16_t  ENCC62F    :  1;               /*!< [5..5] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 2                                                         */
      __IO uint16_t  ENT12OM    :  1;               /*!< [6..6] Enable Interrupt for T12 One-Match                             */
      __IO uint16_t  ENT12PM    :  1;               /*!< [7..7] Enable Interrupt for T12 Period-Match                          */
      __IO uint16_t  ENT13CM    :  1;               /*!< [8..8] Enable Interrupt for T13 Compare-Match                         */
      __IO uint16_t  ENT13PM    :  1;               /*!< [9..9] Enable Interrupt for T13 Period-Match                          */
      __IO uint16_t  ENTRPF     :  1;               /*!< [10..10] Enable Interrupt for Trap Flag                               */
           uint16_t             :  1;
      __IO uint16_t  ENCHE      :  1;               /*!< [12..12] Enable Interrupt for Correct Hall Event                      */
      __IO uint16_t  ENWHE      :  1;               /*!< [13..13] Enable Interrupt for Wrong Hall Event                        */
      __IO uint16_t  ENIDLE     :  1;               /*!< [14..14] Enable Idle                                                  */
      __IO uint16_t  ENSTR      :  1;               /*!< [15..15] Enable Multi-Channel Mode Shadow Transfer Interrupt          */
    } bit;                                          /*!< [16] BitSize                                                          */
  } IEN;
  __I  uint16_t  RESERVED17;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C048) Capture/Compare Interrupt Node Pointer Register        */
    
