zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint16_t  INPCC60    :  2;               /*!< [0..1] Interrupt Node Pointer for Channel 0 Interrupts                */
      __IO uint16_t  INPCC61    :  2;               /*!< [2..3] Interrupt Node Pointer for Channel 1 Interrupts                */
      __IO uint16_t  INPCC62    :  2;               /*!< [4..5] Interrupt Node Pointer for Channel 2 Interrupts                */
      __IO uint16_t  INPCHE     :  2;               /*!< [6..7] Interrupt Node Pointer for the CHE Interrupt                   */
      __IO uint16_t  INPERR     :  2;               /*!< [8..9] Interrupt Node Pointer for Error Interrupts                    */
      __IO uint16_t  INPT12     :  2;               /*!< [10..11] Interrupt Node Pointer for Timer T12 Interrupts              */
      __IO uint16_t  INPT13     :  2;               /*!< [12..13] Interrupt Node Pointer for Timer T13 Interrupts              */
    } bit;                                          /*!< [14] BitSize                                                          */
  } INP;
  __I  uint16_t  RESERVED18;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C04C) Capture/Compare Interrupt Status Set Register          */
    
    struct {
      __O  uint16_t  SCC60R     :  1;               /*!< [0..0] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC60F     :  1;               /*!< [1..1] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  SCC61R     :  1;               /*!< [2..2] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC61F     :  1;               /*!< [3..3] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  SCC62R     :  1;               /*!< [4..4] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC62F     :  1;               /*!< [5..5] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  ST12OM     :  1;               /*!< [6..6] Set Timer T12 One-Match Flag                                   */
      __O  uint16_t  ST12PM     :  1;               /*!< [7..7] Set Timer T12 Period-Match Flag                                */
      __O  uint16_t  ST13CM     :  1;               /*!< [8..8] Set Timer T13 Compare-Match Flag                               */
      __O  uint16_t  ST13PM     :  1;               /*!< [9..9] Set Timer T13 Period-Match Flag                                */
      __O  uint16_t  STRPF      :  1;               /*!< [10..10] Set Trap Flag                                                */
      __O  uint16_t  SWHC       :  1;               /*!< [11..11] Software Hall Compare                                        */
      __O  uint16_t  SCHE       :  1;               /*!< [12..12] Set Correct Hall Event Flag                                  */
      __O  uint16_t  SWHE       :  1;               /*!< [13..13] Set Wrong Hall Event Flag                                    */
      __O  uint16_t  SIDLE      :  1;               /*!< [14..14] Set IDLE Flag                                                */
      __O  uint16_t  SSTR       :  1;               /*!< [15..15] Set STR Flag                                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } ISS;
  __I  uint16_t  RESERVED19;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C050) Passive State Level Register                           */
    
    struct {
      __IO uint16_t  PSL        :  6;               /*!< [0..5] Compare Outputs Passive State Level                            */
           uint16_t             :  1;
      __IO uint16_t  PSL63      :  1;               /*!< [7..7] Passive State Level of Output COUT63                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PSLR;
  __I  uint16_t  RESERVED20;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C054) Multi-Channel Mode Control Register                    */
    
    struct {
      __IO uint16_t  SWSEL      :  3;               /*!< [0..2] Switching Selection                                            */
           uint16_t             :  1;
      __IO uint16_t  SWSYN      :  2;               /*!< [4..5] Switching Synchronization                                      */
           uint16_t             :  2;
      __IO uint16_t  STE12U     :  1;               /*!< [8..8] Shadow Transfer Enable for T12 Upcounting                      */
      __IO uint16_t  STE12D     :  1;               /*!< [9..9] Shadow Transfer Enable for T12 Downcounting                    */
      __IO uint16_t  STE13U     :  1;               /*!< [10..10] Shadow Transfer Enable for T13 Upcounting                    */
    } bit;                                          /*!< [11] BitSize                                                          */
  } MCMCTR;
  __I  uint16_t  RESERVED21;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C058) Timer Control Register 2                               */
    
    struct {
      __IO uint16_t  T12SSC     :  1;               /*!< [0..0] Timer T12 Single Shot Control                                  */
      __IO uint16_t  T13SSC     :  1;               /*!< [1..1] Timer T13 Single Shot Control                                  */
      __IO uint16_t  T13TEC     :  3;               /*!< [2..4] T13 Trigger Event Control                                      */
      __IO uint16_t  T13TED     :  2;               /*!< [5..6] Timer T13 Trigger Event Direction                              */
           uint16_t             :  1;
      __IO uint16_t  T12RSEL    :  2;               /*!< [8..9] Timer T12 External Run Selection                               */
      __IO uint16_t  T13RSEL    :  2;               /*!< [10..11] Timer T13 External Run Selection                             */
    } bit;                                          /*!< [12] BitSize                                                          */
  } TCTR2;
  __I  uint16_t  RESERVED22;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C05C) Modulation Control Register                            */
    
