zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint16_t  T12MODEN   :  6;               /*!< [0..5] T12 Modulation Enable                                          */
           uint16_t             :  1;
      __IO uint16_t  MCMEN      :  1;               /*!< [7..7] Multi-Channel Mode Enable                                      */
      __IO uint16_t  T13MODEN   :  6;               /*!< [8..13] T13 Modulation Enable                                         */
           uint16_t             :  1;
      __IO uint16_t  ECT13O     :  1;               /*!< [15..15] Enable Compare Timer T13 Output                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } MODCTR;
  __I  uint16_t  RESERVED23;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C060) Trap Control Register                                  */
    
    struct {
      __IO uint16_t  TRPM10     :  2;               /*!< [0..1] Trap Mode Control Bits 1, 0                                    */
      __IO uint16_t  TRPM2      :  1;               /*!< [2..2] Trap Mode Control Bit 2                                        */
           uint16_t             :  5;
      __IO uint16_t  TRPEN      :  6;               /*!< [8..13] Trap Enable Control                                           */
      __IO uint16_t  TRPEN13    :  1;               /*!< [14..14] Trap Enable Control for Timer T13                            */
      __IO uint16_t  TRPPEN     :  1;               /*!< [15..15] Trap Pin Enable                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TRPCTR;
  __I  uint16_t  RESERVED24;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C064) Multi-Channel Mode Output Register                     */
    
    struct {
      __I  uint16_t  MCMP       :  6;               /*!< [0..5] Multi-Channel PWM Pattern                                      */
      __I  uint16_t  R          :  1;               /*!< [6..6] Reminder Flag                                                  */
           uint16_t             :  1;
      __I  uint16_t  EXPH       :  3;               /*!< [8..10] Expected Hall Pattern                                         */
      __I  uint16_t  CURH       :  3;               /*!< [11..13] Current Hall Pattern                                         */
    } bit;                                          /*!< [14] BitSize                                                          */
  } MCMOUT;
  __I  uint16_t  RESERVED25;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C068) Capture/Compare Interrupt Status Register              */
    
    struct {
      __I  uint16_t  ICC60R     :  1;               /*!< [0..0] Capture, Compare-Match Rising Edge Flag                        */
      __I  uint16_t  ICC60F     :  1;               /*!< [1..1] Capture, Compare-Match Falling Edge Flag                       */
      __I  uint16_t  ICC61R     :  1;               /*!< [2..2] Capture, Compare-Match Rising Edge Flag                        */
      __I  uint16_t  ICC61F     :  1;               /*!< [3..3] Capture, Compare-Match Falling Edge Flag                       */
      __I  uint16_t  ICC62R     :  1;               /*!< [4..4] Capture, Compare-Match Rising Edge Flag                        */
      __I  uint16_t  ICC62F     :  1;               /*!< [5..5] Capture, Compare-Match Falling Edge Flag                       */
      __I  uint16_t  T12OM      :  1;               /*!< [6..6] Timer T12 One-Match Flag                                       */
      __I  uint16_t  T12PM      :  1;               /*!< [7..7] Timer T12 Period-Match Flag                                    */
      __I  uint16_t  T13CM      :  1;               /*!< [8..8] Timer T13 Compare-Match Flag                                   */
      __I  uint16_t  T13PM      :  1;               /*!< [9..9] Timer T13 Period-Match Flag                                    */
      __I  uint16_t  TRPF       :  1;               /*!< [10..10] Trap Flag                                                    */
      __I  uint16_t  TRPS       :  1;               /*!< [11..11] Trap State                                                   */
      __I  uint16_t  CHE        :  1;               /*!< [12..12] Correct Hall Event                                           */
      __I  uint16_t  WHE        :  1;               /*!< [13..13] Wrong Hall Event                                             */
      __I  uint16_t  IDLE       :  1;               /*!< [14..14] IDLE State                                                   */
      __I  uint16_t  STR        :  1;               /*!< [15..15] Multi-Channel Mode Shadow Transfer Request                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } IS;
  __I  uint16_t  RESERVED26;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C06C) Port Input Select Register 0                           */
    
    struct {
      __IO uint16_t  ISCC60     :  2;               /*!< [0..1] Input Select for CC60                                          */
      __IO uint16_t  ISCC61     :  2;               /*!< [2..3] Input Select for CC61                                          */
      __IO uint16_t  ISCC62     :  2;               /*!< [4..5] Input Select for CC62                                          */
      __IO uint16_t  ISTRP      :  2;               /*!< [6..7] Input Select for CTRAP                                         */
      __IO uint16_t  ISPOS0     :  2;               /*!< [8..9] Input Select for CCPOS0                                        */
      __IO uint16_t  ISPOS1     :  2;               /*!< [10..11] Input Select for CCPOS1                                      */
      __IO uint16_t  ISPOS2     :  2;               /*!< [12..13] Input Select for CCPOS2                                      */
      __IO uint16_t  IST12HR    :  2;               /*!< [14..15] Input Select for T12HR                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } PISEL0;
  __I  uint16_t  RESERVED27[3];
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C074) Port Input Select Register 2                           */
    
