zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint16_t  IST13HR    :  2;               /*!< [0..1] Input Select for T13HR                                         */
      __IO uint16_t  ISCNT12    :  2;               /*!< [2..3] Input Select for T12 Counting Input                            */
      __IO uint16_t  ISCNT13    :  2;               /*!< [4..5] Input Select for T13 Counting Input                            */
      __IO uint16_t  T12EXT     :  1;               /*!< [6..6] Extension for T12HR Inputs                                     */
      __IO uint16_t  T13EXT     :  1;               /*!< [7..7] Extension for T13HR Inputs                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PISEL2;
  __I  uint16_t  RESERVED28;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C078) Timer T12 Counter Register                             */
    
    struct {
      __IO uint16_t  T12CV      : 16;               /*!< [0..15] Timer T12 Counter Value                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12;
  __I  uint16_t  RESERVED29;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C07C) Timer T13 Counter Register                             */
    
    struct {
      __IO uint16_t  T13CV      : 16;               /*!< [0..15] Timer T13 Counter Value                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T13;
  __I  uint16_t  RESERVED30;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C080) Compare State Register                                 */
    
    struct {
      __I  uint16_t  CC60ST     :  1;               /*!< [0..0] Capture/Compare State Bits                                     */
      __I  uint16_t  CC61ST     :  1;               /*!< [1..1] Capture/Compare State Bits                                     */
      __I  uint16_t  CC62ST     :  1;               /*!< [2..2] Capture/Compare State Bits                                     */
      __I  uint16_t  CCPOS0     :  1;               /*!< [3..3] Sampled Hall Pattern Bit 0                                     */
      __I  uint16_t  CCPOS1     :  1;               /*!< [4..4] Sampled Hall Pattern Bit 1                                     */
      __I  uint16_t  CCPOS2     :  1;               /*!< [5..5] Sampled Hall Pattern Bit 2                                     */
      __I  uint16_t  CC63ST     :  1;               /*!< [6..6] Capture/Compare State Bits                                     */
           uint16_t             :  1;
      __IO uint16_t  CC60PS     :  1;               /*!< [8..8] Passive State Select for Compare Outputs                       */
      __IO uint16_t  COUT60PS   :  1;               /*!< [9..9] Passive State Select for Compare Outputs                       */
      __IO uint16_t  CC61PS     :  1;               /*!< [10..10] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT61PS   :  1;               /*!< [11..11] Passive State Select for Compare Outputs                     */
      __IO uint16_t  CC62PS     :  1;               /*!< [12..12] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT62PS   :  1;               /*!< [13..13] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT63PS   :  1;               /*!< [14..14] Passive State Select for Compare Outputs                     */
      __IO uint16_t  T13IM      :  1;               /*!< [15..15] T13 Inverted Modulation                                      */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CMPSTAT;
} CCU6_Type;

/*lint +e46 */


/* ================================================================================ */
/* ================                       CPU                      ================ */
/* ================================================================================ */


/**
  * @brief CPU (CPU)
  */

typedef struct {                                    /*!< (@ 0xE000E000) CPU Structure                                          */
  __I  uint32_t  RESERVED[4];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E010) SysTick Control and Status Register                    */
    
    struct {
      __IO uint32_t  ENABLE     :  1;               /*!< [0..0] Enable                                                         */
      __IO uint32_t  TICKINT    :  1;               /*!< [1..1] TICKINT                                                        */
      __IO uint32_t  CLKSOURCE  :  1;               /*!< [2..2] CLK Source                                                     */
           uint32_t             : 13;
      __IO uint32_t  COUNTFLAG  :  1;               /*!< [16..16] Count Flag                                                   */
    } bit;                                          /*!< [17] BitSize                                                          */
  } SYSTICK_CSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E014) SysTick Reload Value Register                          */
    
    struct {
      __IO uint32_t  RELOAD     : 24;               /*!< [0..23] Reload                                                        */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYSTICK_RVR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E018) SysTick Current Value Register                         */
    
    struct {
      __IO uint32_t  CURRENT    : 24;               /*!< [0..23] Current                                                       */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYSTICK_CVR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000E01C) SysTick Calibration Value Register                     */
    
