zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  TENMS      : 24;               /*!< [0..23] Tenms                                                         */
           uint32_t             :  6;
      __I  uint32_t  SKEW       :  1;               /*!< [30..30] Skew                                                         */
      __I  uint32_t  NOREF      :  1;               /*!< [31..31] No Reference Clock                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SYSTICK_CALIB;
  __I  uint32_t  RESERVED1[56];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E100) Interrupt Set-Enable                                   */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Set for GPT1                                         */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Set for GPT2                                         */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Set for MU, ADC2                                     */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Set for ADC1                                         */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Set for CCU6 SR0                                     */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Set for CCU6 SR1                                     */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Set for CCU6 SR2                                     */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Set for CCU6 SR3                                     */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Set for SSC1                                         */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Set for SSC2                                         */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Set for UART1                                      */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Set for UART2                                      */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Set for External Int 0                             */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Set for External Int 1                             */
      __IO uint32_t  Int_WAKEUP :  1;               /*!< [14..14] Interrupt Set for WAKEUP                                     */
           uint32_t             :  2;
      __IO uint32_t  Int_LS1    :  1;               /*!< [17..17] Interrupt Set for LS1                                        */
      __IO uint32_t  Int_LS2    :  1;               /*!< [18..18] Interrupt Set for LS2                                        */
      __IO uint32_t  Int_HS1    :  1;               /*!< [19..19] Interrupt Set for HS1                                        */
      __IO uint32_t  Int_HS2    :  1;               /*!< [20..20] Interrupt Set for HS2                                        */
      __IO uint32_t  Int_DU     :  1;               /*!< [21..21] Interrupt Set for Differential Unit                          */
      __IO uint32_t  Int_MON    :  1;               /*!< [22..22] Interrupt Set for MON                                        */
      __IO uint32_t  Int_PORT2  :  1;               /*!< [23..23] Interrupt Set for PORT2                                      */
    } bit;                                          /*!< [24] BitSize                                                          */
  } NVIC_ISER;
  __I  uint32_t  RESERVED2[31];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E180) Interrupt Clear-Enable                                 */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Clear for GPT1                                       */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Clear for GPT2                                       */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Clear for MU, ADC2                                   */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Clear for ADC1                                       */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Clear for CCU6 SR0                                   */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Clear for CCU6 SR1                                   */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Clear for CCU6 SR2                                   */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Clear for CCU6 SR3                                   */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Clear for SSC1                                       */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Clear for SSC2                                       */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Clear for UART1                                    */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Clear for UART2                                    */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Clear for External Int 0                           */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Clear for External Int 1                           */
      __IO uint32_t  Int_WAKEUP :  1;               /*!< [14..14] Interrupt Clear for WAKEUP                                   */
           uint32_t             :  2;
      __IO uint32_t  Int_LS1    :  1;               /*!< [17..17] Interrupt Clear for LS1                                      */
      __IO uint32_t  Int_LS2    :  1;               /*!< [18..18] Interrupt Clear for LS2                                      */
      __IO uint32_t  Int_HS1    :  1;               /*!< [19..19] Interrupt Clear for HS1                                      */
      __IO uint32_t  Int_HS2    :  1;               /*!< [20..20] Interrupt Clear for HS2                                      */
      __IO uint32_t  Int_DU     :  1;               /*!< [21..21] Interrupt Clear for Differential Unit                        */
      __IO uint32_t  Int_MON    :  1;               /*!< [22..22] Interrupt Clear for MON                                      */
      __IO uint32_t  Int_PORT2  :  1;               /*!< [23..23] Interrupt Clear for PORT2                                    */
    } bit;                                          /*!< [24] BitSize                                                          */
  } NVIC_ICER;
  __I  uint32_t  RESERVED3[31];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E200) Interrupt Set-Pending                                  */
    
