zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Set Pending for GPT1                                 */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Set Pending for GPT2                                 */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Set Pending for MU, ADC2                             */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Set Pending for ADC1                                 */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Set Pending for CCU6 SR0                             */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Set Pending for CCU6 SR1                             */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Set Pending for CCU6 SR2                             */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Set Pending for CCU6 SR3                             */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Set Pending for SSC1                                 */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Set Pending for SSC2                                 */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Set Pending for UART1                              */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Set Pending for UART2                              */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Set Pending for External Int 0                     */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Set Pending for External Int 1                     */
      __IO uint32_t  Int_WAKEUP :  1;               /*!< [14..14] Interrupt Set Pending for WAKEUP                             */
           uint32_t             :  2;
      __IO uint32_t  Int_LS1    :  1;               /*!< [17..17] Interrupt Set Pending for LS1                                */
      __IO uint32_t  Int_LS2    :  1;               /*!< [18..18] Interrupt Set Pending for LS2                                */
      __IO uint32_t  Int_HS1    :  1;               /*!< [19..19] Interrupt Set Pending for HS1                                */
      __IO uint32_t  Int_HS2    :  1;               /*!< [20..20] Interrupt Set Pending for HS2                                */
      __IO uint32_t  Int_DU     :  1;               /*!< [21..21] Interrupt Set Pending for Differential Unit                  */
      __IO uint32_t  Int_MON    :  1;               /*!< [22..22] Interrupt Set Pending for MON                                */
      __IO uint32_t  Int_PORT2  :  1;               /*!< [23..23] Interrupt Set Pending for PORT2                              */
    } bit;                                          /*!< [24] BitSize                                                          */
  } NVIC_ISPR;
  __I  uint32_t  RESERVED4[31];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E280) Interrupt Clear-Pending                                */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Clear Pending for GPT1                               */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Clear Pending for GPT2                               */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Clear Pending for MU, ADC2                           */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Clear Pending for ADC1                               */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Clear Pending for CCU6 SR0                           */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Clear Pending for CCU6 SR1                           */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Clear Pending for CCU6 SR2                           */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Clear Pending for CCU6 SR3                           */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Clear Pending for SSC1                               */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Clear Pending for SSC2                               */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Clear Pending for UART1                            */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Clear Pending for UART2                            */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Clear Pending for External Int 0                   */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Clear Pending for External Int 1                   */
      __IO uint32_t  Int_WAKEUP :  1;               /*!< [14..14] Interrupt Clear Pending for WAKEUP                           */
           uint32_t             :  2;
      __IO uint32_t  Int_LS1    :  1;               /*!< [17..17] Interrupt Clear Pending for LS1                              */
      __IO uint32_t  Int_LS2    :  1;               /*!< [18..18] Interrupt Clear Pending for LS2                              */
      __IO uint32_t  Int_HS1    :  1;               /*!< [19..19] Interrupt Clear Pending for HS1                              */
      __IO uint32_t  Int_HS2    :  1;               /*!< [20..20] Interrupt Clear Pending for HS2                              */
      __IO uint32_t  Int_DU     :  1;               /*!< [21..21] Interrupt Clear Pending for Differential Unit                */
      __IO uint32_t  Int_MON    :  1;               /*!< [22..22] Interrupt Clear Pending for MON                              */
      __IO uint32_t  Int_PORT2  :  1;               /*!< [23..23] Interrupt Clear Pending for PORT2                            */
    } bit;                                          /*!< [24] BitSize                                                          */
  } NVIC_ICPR;
  __I  uint32_t  RESERVED5[95];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E400) Interrupt Priority                                     */
    
