zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  PRI_GPT1   :  8;               /*!< [0..7] Priority for GPT1                                              */
      __IO uint32_t  PRI_GPT2   :  8;               /*!< [8..15] Priority for GPT2                                             */
      __IO uint32_t  PRI_ADC2   :  8;               /*!< [16..23] Priority for MU, ADC2                                        */
      __IO uint32_t  PRI_ADC1   :  8;               /*!< [24..31] Priority for ADC1                                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E404) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_CCU6SR0:  8;               /*!< [0..7] Priority for CCU6 SR0                                          */
      __IO uint32_t  PRI_CCU6SR1:  8;               /*!< [8..15] Priority for CCU6 SR1                                         */
      __IO uint32_t  PRI_CCU6SR2:  8;               /*!< [16..23] Priority for CCU6 SR2                                        */
      __IO uint32_t  PRI_CCU6SR3:  8;               /*!< [24..31] Priority for CCU6 SR3                                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E408) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_SSC1   :  8;               /*!< [0..7] Priority for CCU6 SSC1                                         */
      __IO uint32_t  PRI_SSC2   :  8;               /*!< [8..15] Priority for CCU6 SSC2                                        */
      __IO uint32_t  PRI_UART1  :  8;               /*!< [16..23] Priority for CCU6 UART1                                      */
      __IO uint32_t  PRI_UART2  :  8;               /*!< [24..31] Priority for CCU6 UART2                                      */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E40C) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_EXINT0 :  8;               /*!< [0..7] Priority for External Int 0                                    */
      __IO uint32_t  PRI_EXINT1 :  8;               /*!< [8..15] Priority for External Int 1                                   */
      __IO uint32_t  PRI_WAKEUP :  8;               /*!< [16..23] Priority for WAKEUP                                          */
    } bit;                                          /*!< [24] BitSize                                                          */
  } NVIC_IPR3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E410) Interrupt Priority                                     */
    
    struct {
           uint32_t             :  8;
      __IO uint32_t  PRI_LS1    :  8;               /*!< [8..15] Priority for LS1                                              */
      __IO uint32_t  PRI_LS2    :  8;               /*!< [16..23] Priority for LS2                                             */
      __IO uint32_t  PRI_HS1    :  8;               /*!< [24..31] Priority for HS1                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E414) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_HS2    :  8;               /*!< [0..7] Priority for HS2                                               */
      __IO uint32_t  PRI_DU     :  8;               /*!< [8..15] Priority for Differential Unit                                */
      __IO uint32_t  PRI_MON    :  8;               /*!< [16..23] Priority for MON                                             */
      __IO uint32_t  PRI_PORT2  :  8;               /*!< [24..31] Priority for PORT2                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR5;
  __I  uint32_t  RESERVED6[570];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000ED00) CPU ID Base Register                                   */
    
    struct {
      __I  uint32_t  REVISION   :  4;               /*!< [0..3] Revision Number                                                */
      __I  uint32_t  PARTNO     : 12;               /*!< [4..15] Part Number                                                   */
      __I  uint32_t  CONSTANT   :  4;               /*!< [16..19] Constant                                                     */
      __I  uint32_t  VARIANT    :  4;               /*!< [20..23] Variant Number                                               */
      __I  uint32_t  IMPLEMENTER:  8;               /*!< [24..31] Implementer Code                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CPUID;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED04) Interrupt Control and State Register                   */
    
    struct {
      __I  uint32_t  VECTACTIVE :  6;               /*!< [0..5] VECTACTIVE                                                     */
           uint32_t             :  6;
      __I  uint32_t  VECTPENDING:  6;               /*!< [12..17] VECTPENDING                                                  */
           uint32_t             :  4;
      __I  uint32_t  ISRPENDING :  1;               /*!< [22..22] Interrupt Pending Flag                                       */
           uint32_t             :  2;
      __O  uint32_t  PENDSTCLR  :  1;               /*!< [25..25] SysTick Exception Clear Pending                              */
      __IO uint32_t  PENDSTSET  :  1;               /*!< [26..26] SysTick Exception Set Pending                                */
      __O  uint32_t  PENDSVCLR  :  1;               /*!< [27..27] PENDSV Clear Pending                                         */
      __IO uint32_t  PENDSVSET  :  1;               /*!< [28..28] PENDSV Set Pending                                           */
           uint32_t             :  2;
      __IO uint32_t  NMIPENDSET :  1;               /*!< [31..31] NMI Set Pending                                              */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ICSR;
  __I  uint32_t  RESERVED7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED0C) Application Interrupt/Reset Control Register           */
    
