zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  1;
      __O  uint32_t  VECTCLRACTIVE:  1;             /*!< [1..1] VECTCLRACTIVE                                                  */
      __O  uint32_t  SYSRESETREQ:  1;               /*!< [2..2] System Reset Request                                           */
           uint32_t             : 12;
      __I  uint32_t  ENDIANNESS :  1;               /*!< [15..15] Data Endianness                                              */
      __IO uint32_t  VECTKEY    : 16;               /*!< [16..31] Vector Key                                                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } AIRCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED10) System Control Register                                */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  SLEEPONEXIT:  1;               /*!< [1..1] Sleep on Exit                                                  */
      __IO uint32_t  SLEEPDEEP  :  1;               /*!< [2..2] Sleep Deep                                                     */
           uint32_t             :  1;
      __IO uint32_t  SEVONPEND  :  1;               /*!< [4..4] SEVONPEND                                                      */
    } bit;                                          /*!< [5] BitSize                                                           */
  } SCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED14) Configuration Control Register                         */
    
    struct {
           uint32_t             :  3;
      __IO uint32_t  UNALIGN_TRP:  1;               /*!< [3..3] UNALIGN_TRP                                                    */
           uint32_t             :  5;
      __IO uint32_t  STKALIGN   :  1;               /*!< [9..9] STKALIGN                                                       */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CCR;
  __I  uint32_t  RESERVED8;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED1C) System Handler Priority Register 2                     */
    
    struct {
           uint32_t             : 24;
      __IO uint32_t  PRI_11     :  8;               /*!< [24..31] Priority of System Handler 11, SVCall                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED20) System Handler Priority Register 3                     */
    
    struct {
           uint32_t             : 16;
      __IO uint32_t  PRI_14     :  8;               /*!< [16..23] Priority of System Handler 14, PendSV                        */
      __IO uint32_t  PRI_15     :  8;               /*!< [24..31] Priority of System Handler 15, SysTick                       */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR3;
} CPU_Type;


/* ================================================================================ */
/* ================                     GPT12E                     ================ */
/* ================================================================================ */


/**
  * @brief GPT12E (GPT12E)
  */

typedef struct {                                    /*!< (@ 0x40010000) GPT12E Structure                                       */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x40010000) Module Identification Register                         */
    
    struct {
      __I  uint32_t  MOD_REV    :  8;               /*!< [0..7] Module Revision Number                                         */
      __I  uint32_t  MOD_TYPE   :  8;               /*!< [8..15] Module Identification Number                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } ID;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010004) Port Input Select Register                             */
    
    struct {
      __IO uint32_t  IST2IN     :  1;               /*!< [0..0] Input Select for T2IN                                          */
      __IO uint32_t  IST2EUD    :  1;               /*!< [1..1] Input Select for T2EUD                                         */
      __IO uint32_t  IST3IN     :  2;               /*!< [2..3] Input Select for T3IN                                          */
      __IO uint32_t  IST3EUD    :  2;               /*!< [4..5] Input Select for T3EUD                                         */
      __IO uint32_t  IST4IN     :  2;               /*!< [6..7] Input Select for T4IN                                          */
      __IO uint32_t  IST4EUD    :  2;               /*!< [8..9] Input Select for TEUD                                          */
      __IO uint32_t  IST5IN     :  1;               /*!< [10..10] Input Select for T5IN                                        */
      __IO uint32_t  IST5EUD    :  1;               /*!< [11..11] Input Select for T5EUD                                       */
      __IO uint32_t  IST6IN     :  1;               /*!< [12..12] Input Select for T6IN                                        */
      __IO uint32_t  IST6EUD    :  1;               /*!< [13..13] Input Select for T6EUD                                       */
      __IO uint32_t  ISCAPIN    :  2;               /*!< [14..15] Input Select for CAPIN                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } PISEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010008) Timer T2 Control Register                              */
    
