zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  T2I        :  3;               /*!< [0..2] Timer T2 Input Parameter Selection                             */
      __IO uint32_t  T2M        :  3;               /*!< [3..5] Timer T2 Input Mode Control                                    */
      __IO uint32_t  T2R        :  1;               /*!< [6..6] Timer T2 Input Run Bit                                         */
      __IO uint32_t  T2UD       :  1;               /*!< [7..7] Timer T2 Up/Down Control                                       */
      __IO uint32_t  T2UDE      :  1;               /*!< [8..8] Timer T2 External Up/Down Enable                               */
      __IO uint32_t  T2RC       :  1;               /*!< [9..9] Timer T2 Remote Control                                        */
           uint32_t             :  2;
      __IO uint32_t  T2IRIDIS   :  1;               /*!< [12..12] Timer T2 Interrupt Disable                                   */
      __IO uint32_t  T2EDGE     :  1;               /*!< [13..13] Timer T2 Edge Detection                                      */
      __IO uint32_t  T2CHDIR    :  1;               /*!< [14..14] Timer T2 Count Direction Change                              */
      __I  uint32_t  T2DIR      :  1;               /*!< [15..15] Timer T2 Rotation Direction                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T2CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001000C) Timer T3 Control Register                              */
    
    struct {
      __IO uint32_t  T3I        :  3;               /*!< [0..2] Timer T3 Input Parameter Selection                             */
      __IO uint32_t  T3M        :  3;               /*!< [3..5] Timer T3 Input Mode Control                                    */
      __IO uint32_t  T3R        :  1;               /*!< [6..6] Timer T3 Input Run Bit                                         */
      __IO uint32_t  T3UD       :  1;               /*!< [7..7] Timer T3 Up/Down Control                                       */
      __IO uint32_t  T3UDE      :  1;               /*!< [8..8] Timer T3 External Up/Down Enable                               */
      __IO uint32_t  T3OE       :  1;               /*!< [9..9] Overflow/Underflow Output Enable                               */
      __IO uint32_t  T3OTL      :  1;               /*!< [10..10] Timer T3 Overflow Toggle Latch                               */
      __IO uint32_t  BPS1       :  2;               /*!< [11..12] GPT1 Block Prescaler Control                                 */
      __IO uint32_t  T3EDGE     :  1;               /*!< [13..13] Timer T3 Edge Detection Flag                                 */
      __IO uint32_t  T3CHDIR    :  1;               /*!< [14..14] Timer T3 Count Direction Change Flag                         */
      __I  uint32_t  T3DIR      :  1;               /*!< [15..15] Timer T3 Rotation Direction Flag                             */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T3CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010010) Timer T4 Control Register                              */
    
    struct {
      __IO uint32_t  T4I        :  3;               /*!< [0..2] Timer T4 Input Parameter Selection                             */
      __IO uint32_t  T4M        :  3;               /*!< [3..5] Timer T4 Mode Control (Basic Operating Mode)                   */
      __IO uint32_t  T4R        :  1;               /*!< [6..6] Timer T4 Input Run Bit                                         */
      __IO uint32_t  T4UD       :  1;               /*!< [7..7] Timer T2 Up/Down Control                                       */
      __IO uint32_t  T4UDE      :  1;               /*!< [8..8] Timer T4 External Up/Down Enable                               */
      __IO uint32_t  T4RC       :  1;               /*!< [9..9] Timer T4 Remote Control                                        */
      __IO uint32_t  CLRT2EN    :  1;               /*!< [10..10] Clear Timer T2 Enable                                        */
      __IO uint32_t  CLRT3EN    :  1;               /*!< [11..11] Clear Timer T3 Enable                                        */
      __IO uint32_t  T4IRDIS    :  1;               /*!< [12..12] Timer T4 Interrupt Disable                                   */
      __IO uint32_t  T4EDGE     :  1;               /*!< [13..13] Timer T4 Edge Direction                                      */
      __IO uint32_t  T4CHDIR    :  1;               /*!< [14..14] Timer T4 Count Direction Change                              */
      __I  uint32_t  T4RDIR     :  1;               /*!< [15..15] Timer T4 Rotation Direction                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T4CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010014) Timer T5 Control Register                              */
    
    struct {
      __IO uint32_t  T5I        :  3;               /*!< [0..2] Timer T5 Input Parameter Selection                             */
      __IO uint32_t  T5M        :  2;               /*!< [3..4] Timer T5 Input Mode Control                                    */
           uint32_t             :  1;
      __IO uint32_t  T5R        :  1;               /*!< [6..6] Timer T5 Run Bit                                               */
      __IO uint32_t  T5UD       :  1;               /*!< [7..7] Timer T2 Up/Down Control                                       */
      __IO uint32_t  T5UDE      :  1;               /*!< [8..8] Timer T5 External Up/Down Enable                               */
      __IO uint32_t  T5RC       :  1;               /*!< [9..9] Timer T5 Remote Control                                        */
      __IO uint32_t  CT3        :  1;               /*!< [10..10] Timer T3 Capture Trigger Enable                              */
           uint32_t             :  1;
      __IO uint32_t  CI         :  2;               /*!< [12..13] Register CAPREL Capture Trigger Selection                    */
      __IO uint32_t  T5CLR      :  1;               /*!< [14..14] Timer T5 Clear Enable Bit                                    */
      __IO uint32_t  T5SC       :  1;               /*!< [15..15] Timer T5 Capture Mode Enable                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T5CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010018) Timer T6 Control Register                              */
    
