zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  T6I        :  3;               /*!< [0..2] Timer T6 Input Parameter Selection                             */
      __IO uint32_t  T6M        :  3;               /*!< [3..5] Timer T6 Mode Control                                          */
      __IO uint32_t  T6R        :  1;               /*!< [6..6] Timer T6 Input Run Bit                                         */
      __IO uint32_t  T6UD       :  1;               /*!< [7..7] Timer T6 Up/Down Control                                       */
      __IO uint32_t  T6UDE      :  1;               /*!< [8..8] Timer T6 External Up/Down Enable                               */
      __IO uint32_t  T6OE       :  1;               /*!< [9..9] Overflow/Underflow Output Enable                               */
      __IO uint32_t  T6OTL      :  1;               /*!< [10..10] Timer T6 Overflow Toggle Latch                               */
      __IO uint32_t  BPS2       :  2;               /*!< [11..12] GPT2 Block Prescaler Control                                 */
           uint32_t             :  1;
      __IO uint32_t  T6CLR      :  1;               /*!< [14..14] Timer T6 Clear Enable Bit                                    */
      __IO uint32_t  T6SR       :  1;               /*!< [15..15] Timer T6 Reload Mode Enable                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T6CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001001C) Capture/Reload Register                                */
    
    struct {
      __IO uint32_t  CAPREL     : 16;               /*!< [0..15] Current reload value or Captured value                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CAPREL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010020) Timer T2 Count Register                                */
    
    struct {
      __IO uint32_t  T2         : 16;               /*!< [0..15] Timer T2 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010024) Timer T3 Count Register                                */
    
    struct {
      __IO uint32_t  T3         : 16;               /*!< [0..15] Timer T3 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010028) Timer T4 Count Register                                */
    
    struct {
      __IO uint32_t  T4         : 16;               /*!< [0..15] Timer T4 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001002C) Timer 5 Count Register                                 */
    
    struct {
      __IO uint32_t  T5         : 16;               /*!< [0..15] Timer T5 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40010030) Timer 6 Count Register                                 */
    
    struct {
      __IO uint32_t  T6         : 16;               /*!< [0..15] Timer T6 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T6;
} GPT12E_Type;


/* ================================================================================ */
/* ================                       HS                       ================ */
/* ================================================================================ */


/**
  * @brief HS (HS)
  */

typedef struct {                                    /*!< (@ 0x40024000) HS Structure                                           */
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40024004) High Side Driver Control                               */
    
    struct {
      __IO uint32_t  HS1_EN     :  1;               /*!< [0..0] High Side 1 Enable                                             */
      __IO uint32_t  HS1_PWM    :  1;               /*!< [1..1] High Side 1 PWM Enable                                         */
      __IO uint32_t  HS1_ON     :  1;               /*!< [2..2] High Side 1 On                                                 */
      __IO uint32_t  HS1_OL_EN  :  1;               /*!< [3..3] High Side 1 Open Load Detection Enable                         */
           uint32_t             :  3;
      __IO uint32_t  HS1_CYC_ON_ACTIVE:  1;         /*!< [7..7] High Side 1 Cyclic ON Driver                                   */
      __IO uint32_t  HS1_SRCTL_SEL:  1;             /*!< [8..8] High Side 1 Slew Rate Control select                           */
           uint32_t             :  3;
      __IO uint32_t  HS1_OC_SEL :  2;               /*!< [12..13] High Side 1 Overcurrent Threshold Selection                  */
           uint32_t             :  2;
      __IO uint32_t  HS2_EN     :  1;               /*!< [16..16] High Side 2 Enable                                           */
      __IO uint32_t  HS2_PWM    :  1;               /*!< [17..17] High Side 2 PWM Enable                                       */
      __IO uint32_t  HS2_ON     :  1;               /*!< [18..18] High Side 2 On                                               */
      __IO uint32_t  HS2_OL_EN  :  1;               /*!< [19..19] High Side 2 Open Load Detection Enable                       */
           uint32_t             :  3;
      __IO uint32_t  HS2_CYC_ON_ACTIVE:  1;         /*!< [23..23] High Side 2 Cyclic ON Driver                                 */
      __IO uint32_t  HS2_SRCTL_SEL:  1;             /*!< [24..24] High Side 2 Slew Rate Control select                         */
           uint32_t             :  3;
      __IO uint32_t  HS2_OC_SEL :  2;               /*!< [28..29] High Side 1 Overcurrent Threshold Selection                  */
    } bit;                                          /*!< [30] BitSize                                                          */
  } CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40024008) High Side Driver Interrupt Status                      */
    
