zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  5;
      __IO uint32_t  HS1_OT_IS  :  1;               /*!< [5..5] High Side 1 Overtemperature Interrupt Status                   */
      __IO uint32_t  HS1_OL_IS  :  1;               /*!< [6..6] High Side 1 Open Load Interrupt Status                         */
      __IO uint32_t  HS1_OC_IS  :  1;               /*!< [7..7] High Side 1 Overcurrent Interrupt Status                       */
           uint32_t             :  5;
      __IO uint32_t  HS1_OT_STS :  1;               /*!< [13..13] High Side 1 Overtemperature Status                           */
      __IO uint32_t  HS1_OL_STS :  1;               /*!< [14..14] High Side 1 Open Load Interrupt Status                       */
           uint32_t             :  6;
      __IO uint32_t  HS2_OT_IS  :  1;               /*!< [21..21] High Side 2 Overtemperature Interrupt Status                 */
      __IO uint32_t  HS2_OL_IS  :  1;               /*!< [22..22] High Side 2 Open Load Interrupt Status                       */
      __IO uint32_t  HS2_OC_IS  :  1;               /*!< [23..23] High Side 2 Overcurrent Interrupt Status                     */
           uint32_t             :  5;
      __IO uint32_t  HS2_OT_STS :  1;               /*!< [29..29] High Side 2 Overtemperature Status                           */
      __IO uint32_t  HS2_OL_STS :  1;               /*!< [30..30] High Side 2 Open Load Interrupt Status                       */
    } bit;                                          /*!< [31] BitSize                                                          */
  } IRQS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x4002400C) High Side Driver Interrupt Status Clear Register       */
    
    struct {
           uint32_t             :  5;
      __O  uint32_t  HS1_OT_ISC :  1;               /*!< [5..5] High Side 1 Overtemperature Interrupt Status Clear             */
      __O  uint32_t  HS1_OL_ISC :  1;               /*!< [6..6] High Side 1 Open Load Interrupt Status Clear                   */
      __O  uint32_t  HS1_OC_ISC :  1;               /*!< [7..7] High Side 1 Overcurrent Interrupt Status Clear                 */
           uint32_t             :  5;
      __O  uint32_t  HS1_OT_SC  :  1;               /*!< [13..13] High Side 1 Overtemperature Status Clear                     */
      __O  uint32_t  HS1_OL_SC  :  1;               /*!< [14..14] High Side 1 Open Load Status Clear                           */
           uint32_t             :  6;
      __O  uint32_t  HS2_OT_ISC :  1;               /*!< [21..21] High Side 2 Overtemperature Interrupt Status Clear           */
      __O  uint32_t  HS2_OL_ISC :  1;               /*!< [22..22] High Side 2 Open Load Interrupt Status Clear                 */
      __O  uint32_t  HS2_OC_ISC :  1;               /*!< [23..23] High Side 2 Overcurrent Interrupt Status Clear               */
           uint32_t             :  5;
      __O  uint32_t  HS2_OT_SC  :  1;               /*!< [29..29] High Side 2 Overtemperature Status Clear                     */
      __O  uint32_t  HS2_OL_SC  :  1;               /*!< [30..30] High Side 2 Open Load Status Clear                           */
    } bit;                                          /*!< [31] BitSize                                                          */
  } IRQCLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40024010) High Side Driver Interrupt Enable Register             */
    
    struct {
           uint32_t             :  5;
      __IO uint32_t  HS1_OT_IEN :  1;               /*!< [5..5] High Side 1 Overtemperature interrupt enable                   */
      __IO uint32_t  HS1_OL_IEN :  1;               /*!< [6..6] High Side 1 Open Load interrupt enable                         */
      __IO uint32_t  HS1_OC_IEN :  1;               /*!< [7..7] High Side 1 Overcurrent interrupt enable                       */
           uint32_t             : 13;
      __IO uint32_t  HS2_OT_IEN :  1;               /*!< [21..21] High Side 2 Overtemperature interrupt enable                 */
      __IO uint32_t  HS2_OL_IEN :  1;               /*!< [22..22] High Side 2 Open Load interrupt enable                       */
      __IO uint32_t  HS2_OC_IEN :  1;               /*!< [23..23] High Side 2 Overcurrent interrupt enable                     */
    } bit;                                          /*!< [24] BitSize                                                          */
  } IRQEN;
  __I  uint32_t  RESERVED1[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4002401C) High Side Driver 1 TRIM                                */
    
    struct {
      __IO uint32_t  HS1_OL_BTFILT_SEL:  2;         /*!< [0..1] Blanking Time Filter Select for HS1 Open Load Detection        */
           uint32_t             :  6;
      __IO uint32_t  HS1_OC_OT_BTFILT_SEL:  2;      /*!< [8..9] Blanking Time Filter Select for HS1 Overcurrent / Overtemperature
                                                         Detection                                                             */
    } bit;                                          /*!< [10] BitSize                                                          */
  } HS1_TRIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40024020) High Side Driver 2 TRIM                                */
    
    struct {
      __IO uint32_t  HS2_OL_BTFILT_SEL:  2;         /*!< [0..1] Blanking Time Filter Select for HS2 Open Load Detection        */
           uint32_t             :  6;
      __IO uint32_t  HS2_OC_OT_BTFILT_SEL:  2;      /*!< [8..9] Blanking Time Filter Select for HS2 Overcurrent / Overtemperature
                                                         Detection                                                             */
    } bit;                                          /*!< [10] BitSize                                                          */
  } HS2_TRIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40024024) High Side PWM Source Selection Register                */
    
