zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  HS2_SRC_SEL:  3;               /*!< [0..2] HS2 PWM Source Selection                                       */
      __IO uint32_t  HS1_SRC_SEL:  3;               /*!< [3..5] HS1 PWM Source Selection                                       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } PWMSRCSEL;
} HS_Type;


/* ================================================================================ */
/* ================                       LIN                      ================ */
/* ================================================================================ */


/**
  * @brief LIN (LIN)
  */

typedef struct {                                    /*!< (@ 0x4801E000) LIN Structure                                          */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801E000) LIN Transceiver Control                                */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  MODE       :  2;               /*!< [1..2] LIN transceiver power mode control                             */
           uint32_t             :  1;
      __I  uint32_t  MODE_FB    :  3;               /*!< [4..6] Feedback Signals for LIN Transmitter Mode Settings             */
           uint32_t             :  2;
      __IO uint32_t  TXD        :  1;               /*!< [9..9] LIN Transmitter switch on (only used when LIN_HV_MODE
                                                         is set)                                                               */
      __I  uint32_t  RXD        :  1;               /*!< [10..10] Output Signal of Receiver                                    */
      __IO uint32_t  SM         :  2;               /*!< [11..12] LIN Transmitter Slope mode control                           */
      __I  uint32_t  FB_SM1     :  1;               /*!< [13..13] Feedback Signal 1 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM2     :  1;               /*!< [14..14] Feedback Signal 2 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM3     :  1;               /*!< [15..15] Feedback Signal 3 for Slope Mode Setting                     */
           uint32_t             :  5;
      __IO uint32_t  HV_MODE    :  1;               /*!< [21..21] LIN Transceiver High Voltage Input - Output Mode             */
    } bit;                                          /*!< [22] BitSize                                                          */
  } CTRL;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801E004) LIN Transceiver Interrupt Status                       */
    
    struct {
           uint32_t             :  3;
      __I  uint32_t  M_SM_ERR_IS:  1;               /*!< [3..3] LIN Transceiver Mode Error - Slope Mode Error Interrupt
                                                         Status                                                                */
      __I  uint32_t  OT_IS      :  1;               /*!< [4..4] LIN Receiver Overtemperature Interrupt Status                  */
      __I  uint32_t  OC_IS      :  1;               /*!< [5..5] LIN Receiver Overcurrent Interrupt Status                      */
      __I  uint32_t  TXD_TMOUT_IS:  1;              /*!< [6..6] LIN TXD time-out Interrupt Status                              */
           uint32_t             :  1;
      __I  uint32_t  M_SM_ERR_STS:  1;              /*!< [8..8] LIN Transceiver Mode Error - Slope Mode Error Status           */
      __I  uint32_t  OT_STS     :  1;               /*!< [9..9] LIN Receiver Overtemperature Status                            */
           uint32_t             :  1;
      __I  uint32_t  TXD_TMOUT_STS:  1;             /*!< [11..11] LIN TXD time-out Status                                      */
    } bit;                                          /*!< [12] BitSize                                                          */
  } IRQS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x4801E008) LIN Transceiver Interrupt Status Register Clear        */
    
    struct {
           uint32_t             :  3;
      __O  uint32_t  M_SM_ERR_ISC:  1;              /*!< [3..3] LIN Transceiver Mode Error - Slope Mode Error Interrupt
                                                         Status Clear                                                          */
      __O  uint32_t  OT_ISC     :  1;               /*!< [4..4] LIN Receiver Overtemperature Interrupt Status / Status
                                                         Clear                                                                 */
      __O  uint32_t  OC_ISC     :  1;               /*!< [5..5] LIN Receiver Overcurrent Interrupt Status Clear                */
      __O  uint32_t  TXD_TMOUT_ISC:  1;             /*!< [6..6] LIN TXD time-out Interrupt Status Clear                        */
           uint32_t             :  1;
      __O  uint32_t  M_SM_ERR_SC:  1;               /*!< [8..8] LIN Transceiver Mode Error - Slope Mode Error Status
                                                         Clear                                                                 */
      __O  uint32_t  OT_SC      :  1;               /*!< [9..9] LIN Receiver Overtemperature Status Clear                      */
           uint32_t             :  1;
      __O  uint32_t  TXD_TMOUT_SC:  1;              /*!< [11..11] LIN TXD time-out Status Clear                                */
    } bit;                                          /*!< [12] BitSize                                                          */
  } IRQCLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801E00C) LIN Transceiver Interrupt Enable Register              */
    
    struct {
           uint32_t             :  3;
      __IO uint32_t  M_SM_ERR_IEN:  1;              /*!< [3..3] LIN Transceiver Mode - Slope Mode Error interrupt enable       */
      __IO uint32_t  OT_IEN     :  1;               /*!< [4..4] LIN Transceiver Overtemperature interrupt enable               */
      __IO uint32_t  OC_IEN     :  1;               /*!< [5..5] LIN Transceiver Overcurrent interrupt enable                   */
      __IO uint32_t  TXD_TMOUT_IEN:  1;             /*!< [6..6] LIN Transceiver TxD-Timeout interrupt enable                   */
    } bit;                                          /*!< [7] BitSize                                                           */
  } IRQEN;
} LIN_Type;


/* ================================================================================ */
/* ================                       LS                       ================ */
/* ================================================================================ */


/**
  * @brief LS (LS)
  */

typedef struct {                                    /*!< (@ 0x4001C000) LS Structure                                           */
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C004) Low Side Driver Control                                */
    
