zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  LS1_EN     :  1;               /*!< [0..0] Low-Side switch 1 Enable                                       */
      __IO uint32_t  LS1_PWM    :  1;               /*!< [1..1] Low-Side switch 1 PWM Enable                                   */
      __IO uint32_t  LS1_ON     :  1;               /*!< [2..2] Low-Side switch 1 On/Off                                       */
      __IO uint32_t  LS1_OL_EN  :  1;               /*!< [3..3] Open load Detection Enable                                     */
           uint32_t             :  4;
      __IO uint32_t  LS1_SRCTL_SEL:  1;             /*!< [8..8] Low-Side switch 1 Slew Rate selection                          */
           uint32_t             :  7;
      __IO uint32_t  LS2_EN     :  1;               /*!< [16..16] Low-Side switch 2 Enable                                     */
      __IO uint32_t  LS2_PWM    :  1;               /*!< [17..17] Low-Side switch 2 PWM Enable                                 */
      __IO uint32_t  LS2_ON     :  1;               /*!< [18..18] Low-Side switch 2 On/Off                                     */
      __IO uint32_t  LS2_OL_EN  :  1;               /*!< [19..19] Open load Detection Enable                                   */
           uint32_t             :  4;
      __IO uint32_t  LS2_SRCTL_SEL:  1;             /*!< [24..24] Low-Side switch 2 Slew Rate selection                        */
    } bit;                                          /*!< [25] BitSize                                                          */
  } CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C008) Low Side Driver Interrupt Status                       */
    
    struct {
           uint32_t             :  4;
      __IO uint32_t  LS1_OT_PREWARN_IS:  1;         /*!< [4..4] Low-Side 1 Overtemperature Prewarning Interrupt Status         */
      __IO uint32_t  LS1_OT_IS  :  1;               /*!< [5..5] Low-Side 1 Overtemperature Interrupt Status                    */
      __IO uint32_t  LS1_OL_IS  :  1;               /*!< [6..6] Low-Side 1 Open Load Interrupt Status                          */
      __IO uint32_t  LS1_OC_IS  :  1;               /*!< [7..7] Low-Side 1 Overcurrent Interrupt Status                        */
           uint32_t             :  4;
      __IO uint32_t  LS1_OT_PREWARN_STS:  1;        /*!< [12..12] Low-Side 1 Overtemperature Prewarning Status                 */
      __IO uint32_t  LS1_OT_STS :  1;               /*!< [13..13] Low-Side 1 Overtemperature Status                            */
      __IO uint32_t  LS1_OL_STS :  1;               /*!< [14..14] Low-Side 1 Open Load Status                                  */
           uint32_t             :  5;
      __IO uint32_t  LS2_OT_PREWARN_IS:  1;         /*!< [20..20] Low-Side 2 Overtemperature Prewarning Interrupt Status       */
      __IO uint32_t  LS2_OT_IS  :  1;               /*!< [21..21] Low-Side 2 Overtemperature Interrupt Status                  */
      __IO uint32_t  LS2_OL_IS  :  1;               /*!< [22..22] Low-Side 2 Open Load Interrupt Status                        */
      __IO uint32_t  LS2_OC_IS  :  1;               /*!< [23..23] Low-Side 2 Overcurrent Interrupt Status                      */
           uint32_t             :  4;
      __IO uint32_t  LS2_OT_PREWARN_STS:  1;        /*!< [28..28] Low-Side 2 Overtemperature Prewarning Status                 */
      __IO uint32_t  LS2_OT_STS :  1;               /*!< [29..29] Low-Side 2 Overtemperature Status                            */
      __IO uint32_t  LS2_OL_STS :  1;               /*!< [30..30] Low-Side 2 Open Load Status                                  */
    } bit;                                          /*!< [31] BitSize                                                          */
  } IRQS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x4001C00C) Low Side Driver Interrupt Status Register Clear        */
    
    struct {
           uint32_t             :  4;
      __O  uint32_t  LS1_OT_PREWARN_ISC:  1;        /*!< [4..4] Low-Side 1 Overtemperature prewarn interrupt status clear      */
      __O  uint32_t  LS1_OT_ISC :  1;               /*!< [5..5] Low-Side 1 Overtemperature interrupt status clear              */
      __O  uint32_t  LS1_OL_ISC :  1;               /*!< [6..6] Low-Side 1 Open Load interrupt status clear                    */
      __O  uint32_t  LS1_OC_ISC :  1;               /*!< [7..7] Low-Side 1 Overcurrent interrupt status clear                  */
           uint32_t             :  4;
      __O  uint32_t  LS1_OT_PREWARN_SC:  1;         /*!< [12..12] Low-Side 1 Overtemperature prewarn status clear              */
      __O  uint32_t  LS1_OT_SC  :  1;               /*!< [13..13] Low-Side 1 Overtemperature status clear                      */
      __O  uint32_t  LS1_OL_SC  :  1;               /*!< [14..14] Low-Side 1 Open Load status clear                            */
           uint32_t             :  5;
      __O  uint32_t  LS2_OT_PREWARN_ISC:  1;        /*!< [20..20] Low-Side 2Overtemperature prewarn interrupt status
                                                         clear                                                                 */
      __O  uint32_t  LS2_OT_ISC :  1;               /*!< [21..21] Low-Side 2 Overtemperature interrupt status clear            */
      __O  uint32_t  LS2_OL_ISC :  1;               /*!< [22..22] Low-Side 2 Open Load interrupt status clear                  */
      __O  uint32_t  LS2_OC_ISC :  1;               /*!< [23..23] Low-Side 2 Overcurrent interrupt status clear                */
           uint32_t             :  4;
      __O  uint32_t  LS2_OT_PREWARN_SC:  1;         /*!< [28..28] Low-Side 2 Overtemperature prewarn status clear              */
      __O  uint32_t  LS2_OT_SC  :  1;               /*!< [29..29] Low-Side switch 2 Overtemperature status Clear               */
      __O  uint32_t  LS2_OL_SC  :  1;               /*!< [30..30] Low-Side 2 Open Load status clear                            */
    } bit;                                          /*!< [31] BitSize                                                          */
  } IRQCLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C010) Low Side Driver Interrupt Enable Register              */
    
