zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  4;
      __IO uint32_t  LS1_OT_PREWARN_IEN:  1;        /*!< [4..4] Low-Side 1 Overtemperature prewarn interrupt enable            */
      __IO uint32_t  LS1_OT_IEN :  1;               /*!< [5..5] Low-Side 1 Overtemperature interrupt enable                    */
      __IO uint32_t  LS1_OL_IEN :  1;               /*!< [6..6] Low-Side 1 Open Load interrupt enable                          */
      __IO uint32_t  LS1_OC_IEN :  1;               /*!< [7..7] Low-Side 1 Overcurrent interrupt enable                        */
           uint32_t             : 12;
      __IO uint32_t  LS2_OT_PREWARN_IEN:  1;        /*!< [20..20] Low-Side 2 Overtemperature prewarn interrupt enable          */
      __IO uint32_t  LS2_OT_IEN :  1;               /*!< [21..21] Low-Side 2 Overtemperature interrupt enable                  */
      __IO uint32_t  LS2_OL_IEN :  1;               /*!< [22..22] Low-Side 2 Open Load interrupt enable                        */
      __IO uint32_t  LS2_OC_IEN :  1;               /*!< [23..23] Low-Side 2 Overcurrent interrupt enable                      */
    } bit;                                          /*!< [24] BitSize                                                          */
  } IRQEN;
  __I  uint32_t  RESERVED1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C018) Low Side Trimming Register                             */
    
    struct {
      __IO uint32_t  LS1_OL_BTFILT_SEL:  2;         /*!< [0..1] Open load Blank Time Select for LS1                            */
           uint32_t             :  6;
      __IO uint32_t  LS1_OC_BTFILT_SEL:  2;         /*!< [8..9] Overcurrent BlankTime Select for LS1                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } LS1_TRIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C01C) Low Side PWM Source Selection Register                 */
    
    struct {
      __IO uint32_t  LS2_SRC_SEL:  3;               /*!< [0..2] LS2 PWM Source Selection                                       */
      __IO uint32_t  LS1_SRC_SEL:  3;               /*!< [3..5] LS1 PWM Source Selection                                       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } PWMSRCSEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4001C020) Low Side Trimming Register                             */
    
    struct {
      __IO uint32_t  LS2_OL_BTFILT_SEL:  2;         /*!< [0..1] Open load Blank Time Select for LS2                            */
           uint32_t             :  6;
      __IO uint32_t  LS2_OC_BTFILT_SEL:  2;         /*!< [8..9] Overcurrent BlankTime Select for LS2                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } LS2_TRIM;
} LS_Type;


/* ================================================================================ */
/* ================                       MF                       ================ */
/* ================================================================================ */


/**
  * @brief MF (MF)
  */

typedef struct {                                    /*!< (@ 0x48018000) MF Structure                                           */
  __I  uint32_t  RESERVED[4];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x48018010) Temperature Sensor Control Register                    */
    
    struct {
           uint32_t             :  4;
      __I  uint32_t  LS_OTWARN_STS:  1;             /*!< [4..4] Low Side Overtemperature Warning (MU) Status                   */
      __I  uint32_t  LS_OT_STS  :  1;               /*!< [5..5] Low Side Overtemperature (MU) Status                           */
      __I  uint32_t  SYS_OTWARN_STS:  1;            /*!< [6..6] System Overtemperature Warning (MU) Status                     */
      __I  uint32_t  SYS_OT_STS :  1;               /*!< [7..7] System Overtemperature (MU) Status                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } TEMPSENSE_CTRL;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x48018014) Reference 1 Status Register                            */
    
    struct {
           uint32_t             :  4;
      __I  uint32_t  REFBG_LOTHWARN_STS:  1;        /*!< [4..4] Status for Undervoltage Threshold Measurement of internal
                                                         VAREF                                                                 */
      __I  uint32_t  REFBG_UPTHWARN_STS:  1;        /*!< [5..5] Status for Overvoltage Threshold Measurement of internal
                                                         VAREF                                                                 */
    } bit;                                          /*!< [6] BitSize                                                           */
  } REF1_STS;
} MF_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief PMU (PMU)
  */

typedef struct {                                    /*!< (@ 0x50004000) PMU Structure                                          */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50004000) Main wake status register                              */
    
    struct {
      __I  uint32_t  LIN_WAKE   :  1;               /*!< [0..0] Wake-up via LIN- Message                                       */
      __I  uint32_t  MON        :  1;               /*!< [1..1] Wake-up via MON which is a logical OR combination of
                                                         all Wake_STS_MON bits                                                 */
      __I  uint32_t  GPIO0      :  1;               /*!< [2..2] Wake-up via GPIO0 which is a logical OR combination of
                                                         all Wake_STS_GPIO0 bits                                               */
      __I  uint32_t  GPIO1      :  1;               /*!< [3..3] Wake-up via GPIO1 which is a logical OR combination of
                                                         all Wake_STS_GPIO1 bits                                               */
      __I  uint32_t  CYC_WAKE   :  1;               /*!< [4..4] Wake-up caused by Cyclic Wake                                  */
      __I  uint32_t  FAIL       :  1;               /*!< [5..5] Wake-up after VDDEXT Fail                                      */
      __I  uint32_t  GPIO2      :  1;               /*!< [6..6] Wake-up via GPIO2 which is a logical OR combination of
                                                         all Wake_STS_GPIO2 bits                                               */
           uint32_t             :  1;
      __I  uint32_t  MON1_WAKE_STS:  1;             /*!< [8..8] Status of MON1                                                 */
      __I  uint32_t  MON2_WAKE_STS:  1;             /*!< [9..9] Status of MON2                                                 */
      __I  uint32_t  MON3_WAKE_STS:  1;             /*!< [10..10] Status of MON3                                               */
      __I  uint32_t  MON4_WAKE_STS:  1;             /*!< [11..11] Status of MON4                                               */
      __I  uint32_t  MON5_WAKE_STS:  1;             /*!< [12..12] Status of MON5                                               */
           uint32_t             :  4;
      __I  uint32_t  VDDEXT_OT  :  1;               /*!< [17..17] Wake VDDEXT Overtemperature                                  */
      __I  uint32_t  VDDEXT_UV  :  1;               /*!< [18..18] Wake VDDEXT Undervoltage                                     */
    } bit;                                          /*!< [19] BitSize                                                          */
  } WAKE_STATUS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50004004) GPIO Port wake status register                         */
    
