zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  GPIO0_STS_0:  1;               /*!< [0..0] Status of GPIO0_0                                              */
      __I  uint32_t  GPIO0_STS_1:  1;               /*!< [1..1] Status of GPIO0_1                                              */
      __I  uint32_t  GPIO0_STS_2:  1;               /*!< [2..2] Status of GPIO0_2                                              */
      __I  uint32_t  GPIO0_STS_3:  1;               /*!< [3..3] Status of GPIO0_3                                              */
      __I  uint32_t  GPIO0_STS_4:  1;               /*!< [4..4] Status of GPIO0_4                                              */
           uint32_t             :  3;
      __I  uint32_t  GPIO1_STS_0:  1;               /*!< [8..8] Wake GPIO1_0                                                   */
      __I  uint32_t  GPIO1_STS_1:  1;               /*!< [9..9] Wake GPIO1_1                                                   */
      __I  uint32_t  GPIO1_STS_2:  1;               /*!< [10..10] Wake GPIO1_2                                                 */
           uint32_t             :  1;
      __I  uint32_t  GPIO1_STS_4:  1;               /*!< [12..12] Wake GPIO1_4                                                 */
    } bit;                                          /*!< [13] BitSize                                                          */
  } GPIO_WAKE_STATUS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004008) Voltage Reg Status Register                            */
    
    struct {
      __I  uint32_t  PMU_1V5_OVERVOLT:  1;          /*!< [0..0] Overvoltage at VDDC regulator                                  */
      __I  uint32_t  PMU_1V5_OVERLOAD:  1;          /*!< [1..1] Overload at VDDC regulator                                     */
      __IO uint32_t  PMU_1V5_FAIL_EN:  1;           /*!< [2..2] Enabling of VDDC status information as interrupt source        */
           uint32_t             :  1;
      __I  uint32_t  PMU_5V_OVERVOLT:  1;           /*!< [4..4] Overvoltage at VDDP regulator                                  */
      __I  uint32_t  PMU_5V_OVERLOAD:  1;           /*!< [5..5] Overload at VDDP regulator                                     */
      __IO uint32_t  PMU_5V_FAIL_EN:  1;            /*!< [6..6] Enabling of VDDP status information as interrupt source        */
    } bit;                                          /*!< [7] BitSize                                                           */
  } SUPPLY_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000400C) VDDEXT Control                                         */
    
    struct {
      __IO uint32_t  VDDEXT_ENABLE:  1;             /*!< [0..0] VDDEXT Supply Enable                                           */
      __IO uint32_t  VDDEXT_CYC_EN:  1;             /*!< [1..1] VDDEXT Supply for Cyclic Sense Enable                          */
      __IO uint32_t  VDDEXT_FAIL_EN:  1;            /*!< [2..2] Enabling of VDDEXT Supply status information as interrupt
                                                         source                                                                */
      __I  uint32_t  VDDEXT_OT_IS:  1;              /*!< [3..3] VDDEXT Supply Overtemperature Interrupt Status                 */
      __I  uint32_t  VDDEXT_UV_IS:  1;              /*!< [4..4] VDDEXT Supply Undervoltage Interrupt Status                    */
      __I  uint32_t  VDDEXT_OT_STS:  1;             /*!< [5..5] VDDEXT Supply Overtemperature Status                           */
      __I  uint32_t  VDDEXT_OT  :  1;               /*!< [6..6] VDDEXT Supply Overtemperature                                  */
      __I  uint32_t  VDDEXT_STABLE:  1;             /*!< [7..7] VDDEXT Supply Stable                                           */
           uint32_t             :  3;
      __O  uint32_t  VDDEXT_OT_ISC:  1;             /*!< [11..11] VDDEXT Supply Overtemperature Interrupt Status clear         */
      __O  uint32_t  VDDEXT_UV_ISC:  1;             /*!< [12..12] VDDEXT Supply Undervoltage Interrupt Status clear            */
      __O  uint32_t  VDDEXT_OT_SC:  1;              /*!< [13..13] VDDEXT Supply Overtemperature Status clear                   */
    } bit;                                          /*!< [14] BitSize                                                          */
  } VDDEXT_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004010) Reset Status Register                                  */
    
    struct {
      __IO uint32_t  SYS_FAIL   :  1;               /*!< [0..0] Flag which indicates a reset caused by a System Fail
                                                         reported in the corresponding Fail Register                           */
      __IO uint32_t  PMU_WAKE   :  1;               /*!< [1..1] Flag which indicates a reset caused by Stop-Exit               */
      __IO uint32_t  PMU_SleepEX:  1;               /*!< [2..2] Flag which indicates a reset caused by Sleep-Exit              */
      __IO uint32_t  PMU_LPR    :  1;               /*!< [3..3] Low Priority Resets                                            */
      __IO uint32_t  PMU_ClkWDT :  1;               /*!< [4..4] Clock Watchdog (CLKWDT) Reset Flag                             */
      __IO uint32_t  PMU_ExtWDT :  1;               /*!< [5..5] External Watchdog (WDT1) Reset Flag                            */
      __IO uint32_t  PMU_PIN    :  1;               /*!< [6..6] PIN-Reset Flag                                                 */
      __IO uint32_t  PMU_VS_POR :  1;               /*!< [7..7] Power-On Reset Flag                                            */
           uint32_t             :  1;
      __IO uint32_t  PMU_SOFT   :  1;               /*!< [9..9] Soft-Reset Flag                                                */
      __IO uint32_t  LOCKUP     :  1;               /*!< [10..10] Lockup-Reset Flag                                            */
    } bit;                                          /*!< [11] BitSize                                                          */
  } RESET_STS;
  __I  uint32_t  RESERVED[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004020) PMU Sleep Behavior Register                            */
    
