zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  WAKE_W_RST :  1;               /*!< [0..0] Wake-up with reset execution                                   */
      __IO uint32_t  EN_0V9_N   :  1;               /*!< [1..1] Enables the reduction of the VDDC regulator output to
                                                         0.9 V during Stop-Mode                                                */
      __IO uint32_t  CYC_WAKE_EN:  1;               /*!< [2..2] Enabling Cyclic Wake                                           */
      __IO uint32_t  CYC_SENSE_EN:  1;              /*!< [3..3] Enabling Cyclic Sense                                          */
      __IO uint32_t  RFU        :  1;               /*!< [4..4] Reserved for Future Use                                        */
           uint32_t             :  3;
      __IO uint32_t  CYC_SENSE_M03:  4;             /*!< [8..11] Mantissa                                                      */
      __IO uint32_t  CYC_SENSE_E01:  2;             /*!< [12..13] Exponent                                                     */
           uint32_t             :  2;
      __IO uint32_t  CYC_WAKE_M03:  4;              /*!< [16..19] Mantissa                                                     */
      __IO uint32_t  CYC_WAKE_E01:  2;              /*!< [20..21] Exponent                                                     */
           uint32_t             :  2;
      __IO uint32_t  CYC_SENSE_S_DEL:  3;           /*!< [24..26] Sample Delay in Cyclic Sense Mode                            */
    } bit;                                          /*!< [27] BitSize                                                          */
  } SLEEP;
  __I  uint32_t  RESERVED1[4];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004034) Settings Monitor 1-4                                   */
    
    struct {
      __IO uint32_t  MON1_EN    :  1;               /*!< [0..0] MON1 Enable                                                    */
      __IO uint32_t  MON1_FALL  :  1;               /*!< [1..1] MON1 Wake-up on Falling Edge Enable                            */
      __IO uint32_t  MON1_RISE  :  1;               /*!< [2..2] MON1 Wake-up on Rising Edge Enable                             */
      __IO uint32_t  MON1_CYC   :  1;               /*!< [3..3] MON1 for Cycle Sense Enable                                    */
      __IO uint32_t  MON1_PD    :  1;               /*!< [4..4] Pull-Down Current Source for MON1 Input Enable                 */
      __IO uint32_t  MON1_PU    :  1;               /*!< [5..5] Pull-Up Current Source for MON1 Input Enable                   */
           uint32_t             :  1;
      __I  uint32_t  MON1_STS   :  1;               /*!< [7..7] MON1 Status Input                                              */
      __IO uint32_t  MON2_EN    :  1;               /*!< [8..8] MON2 Enable                                                    */
      __IO uint32_t  MON2_FALL  :  1;               /*!< [9..9] MON2 Wake-up on Falling Edge Enable                            */
      __IO uint32_t  MON2_RISE  :  1;               /*!< [10..10] MON2 Wake-up on Rising Edge Enable                           */
      __IO uint32_t  MON2_CYC   :  1;               /*!< [11..11] MON2 for Cycle Sense Enable                                  */
      __IO uint32_t  MON2_PD    :  1;               /*!< [12..12] Pull-Down Current Source for MON2 Input Enable               */
      __IO uint32_t  MON2_PU    :  1;               /*!< [13..13] Pull-Up Current Source for MON2 Input Enable                 */
           uint32_t             :  1;
      __I  uint32_t  MON2_STS   :  1;               /*!< [15..15] MON2 Status Input                                            */
      __IO uint32_t  MON3_EN    :  1;               /*!< [16..16] MON3 Enable                                                  */
      __IO uint32_t  MON3_FALL  :  1;               /*!< [17..17] MON3 Wake-up on Falling Edge Enable                          */
      __IO uint32_t  MON3_RISE  :  1;               /*!< [18..18] MON3 Wake-up on Rising Edge Enable                           */
      __IO uint32_t  MON3_CYC   :  1;               /*!< [19..19] MON3 for Cycle Sense Enable                                  */
      __IO uint32_t  MON3_PD    :  1;               /*!< [20..20] Pull-Down Current Source for MON3 Input Enable               */
      __IO uint32_t  MON3_PU    :  1;               /*!< [21..21] Pull-Up Current Source for MON3 Input Enable                 */
           uint32_t             :  1;
      __I  uint32_t  MON3_STS   :  1;               /*!< [23..23] MON3 Status Input                                            */
      __IO uint32_t  MON4_EN    :  1;               /*!< [24..24] MON4 Enable                                                  */
      __IO uint32_t  MON4_FALL  :  1;               /*!< [25..25] MON4 Wake-up on Falling Edge Enable                          */
      __IO uint32_t  MON4_RISE  :  1;               /*!< [26..26] MON4 Wake-up on Rising Edge Enable                           */
      __IO uint32_t  MON4_CYC   :  1;               /*!< [27..27] MON4 for Cycle Sense Enable                                  */
      __IO uint32_t  MON4_PD    :  1;               /*!< [28..28] Pull-Down Current Source for MON4 Input Enable               */
      __IO uint32_t  MON4_PU    :  1;               /*!< [29..29] Pull-Up Current Source for MON4 Input Enable                 */
           uint32_t             :  1;
      __I  uint32_t  MON4_STS   :  1;               /*!< [31..31] MON4 Status Input                                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } MON_CNF1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004038) Settings Monitor 5                                     */
    
    struct {
      __IO uint32_t  MON5_EN    :  1;               /*!< [0..0] MON5 Enable                                                    */
      __IO uint32_t  MON5_FALL  :  1;               /*!< [1..1] MON5 Wake-up on Falling Edge Enable                            */
      __IO uint32_t  MON5_RISE  :  1;               /*!< [2..2] MON5 Wake-up on Rising Edge Enable                             */
      __IO uint32_t  MON5_CYC   :  1;               /*!< [3..3] MON5 for Cycle Sense Enable                                    */
      __IO uint32_t  MON5_PD    :  1;               /*!< [4..4] Pull-Down Current Source for MON5 Input Enable                 */
      __IO uint32_t  MON5_PU    :  1;               /*!< [5..5] Pull-Up Current Source for MON5 Input Enable                   */
           uint32_t             :  1;
      __I  uint32_t  MON5_STS   :  1;               /*!< [7..7] MON5 Status Input                                              */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MON_CNF2;
  __I  uint32_t  RESERVED2[5];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50004050) LIN Wake Enable                                        */
    
