zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  7;
      __IO uint32_t  LIN_EN     :  1;               /*!< [7..7] Lin Wake enable                                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } LIN_WAKE_EN;
  __I  uint32_t  RESERVED3[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000405C) High-side Control Register                             */
    
    struct {
           uint32_t             :  2;
      __IO uint32_t  HS1_CYC_EN :  1;               /*!< [2..2] High-side 1 switch enable for cyclic sense                     */
           uint32_t             :  7;
      __IO uint32_t  HS2_CYC_EN :  1;               /*!< [10..10] High-side 2 switch enable for cyclic sense                   */
    } bit;                                          /*!< [11] BitSize                                                          */
  } HIGHSIDE_CTRL;
  __I  uint32_t  RESERVED4[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000406C) Reset Blind Time Register                              */
    
    struct {
      __IO uint32_t  RST_TFB    :  2;               /*!< [0..1] Reset Pin Blind Time Selection Bits                            */
    } bit;                                          /*!< [2] BitSize                                                           */
  } CNF_RST_TFB;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50004070) WFS System Fail Register                               */
    
    struct {
      __I  uint32_t  SUPP_SHORT :  1;               /*!< [0..0] Supply Short                                                   */
      __I  uint32_t  SUPP_TMOUT :  1;               /*!< [1..1] Supply Time Out                                                */
      __I  uint32_t  PMU_1V5_OVL:  1;               /*!< [2..2] VDDC Overload Flag                                             */
      __I  uint32_t  PMU_5V_OVL :  1;               /*!< [3..3] VDDP Overload Flag                                             */
      __I  uint32_t  SYS_CLK_WDT:  1;               /*!< [4..4] System Clock (fsys)Watchdog Fail                               */
      __I  uint32_t  SYS_OT     :  1;               /*!< [5..5] System Overtemperature Indication Flag                         */
      __I  uint32_t  WDT1_SEQ_FAIL:  1;             /*!< [6..6] External Watchdog (WDT1) Sequential Fail                       */
      __I  uint32_t  LP_CLKWD   :  1;               /*!< [7..7] LP_CLKWD                                                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WFS;
  __I  uint32_t  RESERVED5[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000407C) GPREG CNF                                              */
    
    struct {
      __IO uint32_t  SEL_GPIO   :  1;               /*!< [0..0] SEL_GPIO                                                       */
    } bit;                                          /*!< [1] BitSize                                                           */
  } CPREG_CNF;
  __I  uint32_t  RESERVED6[11];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500040AC) PMU Wake-up Timing Register                            */
    
    struct {
      __IO uint32_t  CNF_LIN_FT :  1;               /*!< [0..0] Wake-up Filter time for LIN WAKE                               */
      __IO uint32_t  CNF_MON_FT :  1;               /*!< [1..1] Wake-up Filter time for Monitoring Inputs                      */
      __IO uint32_t  CNF_GPIO_FT:  2;               /*!< [2..3] Wake-up Filter time for General Purpose IO                     */
    } bit;                                          /*!< [4] BitSize                                                           */
  } CNF_WAKE_FILTER;
  __I  uint32_t  RESERVED7[4];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500040C0) General Purpose User DATA0to3                          */
    
    struct {
      __IO uint32_t  DATA0      :  8;               /*!< [0..7] DATA0 Storage Byte                                             */
      __IO uint32_t  DATA1      :  8;               /*!< [8..15] DATA1 Storage Byte                                            */
      __IO uint32_t  DATA2      :  8;               /*!< [16..23] DATA2 Storage Byte                                           */
      __IO uint32_t  DATA3      :  8;               /*!< [24..31] DATA3 Storage Byte                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } GPUDATA0to3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500040C4) General Purpose User DATA4to7                          */
    
    struct {
      __IO uint32_t  DATA4      :  8;               /*!< [0..7] DATA4 Storage Byte                                             */
      __IO uint32_t  DATA5      :  8;               /*!< [8..15] DATA5 Storage Byte                                            */
      __IO uint32_t  DATA6      :  8;               /*!< [16..23] DATA6 Storage Byte                                           */
      __IO uint32_t  DATA7      :  8;               /*!< [24..31] DATA7 Storage Byte                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } GPUDATA4to7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500040C8) General Purpose User DATA8to11                         */
    
    struct {
      __IO uint32_t  DATA8      :  8;               /*!< [0..7] DATA8 Storage Byte                                             */
      __IO uint32_t  DATA9      :  8;               /*!< [8..15] DATA9 Storage Byte                                            */
      __IO uint32_t  DATA10     :  8;               /*!< [16..23] DATA10 Storage Byte                                          */
      __IO uint32_t  DATA11     :  8;               /*!< [24..31] DATA11 Storage Byte                                          */
    } bit;                                          /*!< [32] BitSize                                                          */
  } GPUDATA8to11;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500040CC) Wake Configuration GPIO Port 1 Register                */
    
