zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  RI_0       :  1;               /*!< [0..0] Port 1_0 Wake-up on Rising Edge enable                         */
      __IO uint32_t  RI_1       :  1;               /*!< [1..1] Port 1_1 Wake-up on Rising Edge enable                         */
      __IO uint32_t  RI_2       :  1;               /*!< [2..2] Port 1_2 Wake-up on Rising Edge enable                         */
      __IO uint32_t  RI_3       :  1;               /*!< [3..3] Port 1_3 Wake-up on Rising Edge enable                         */
      __IO uint32_t  RI_4       :  1;               /*!< [4..4] Port 1_4 Wake-up on Rising Edge enable                         */
           uint32_t             :  3;
      __IO uint32_t  FA_0       :  1;               /*!< [8..8] Port 1_0 Wake-up on Falling Edge enable                        */
      __IO uint32_t  FA_1       :  1;               /*!< [9..9] Port 1_1 Wake-up on Falling Edge enable                        */
      __IO uint32_t  FA_2       :  1;               /*!< [10..10] Port 1_2 Wake-up on Falling Edge enable                      */
      __IO uint32_t  FA_3       :  1;               /*!< [11..11] Port 1_3 Wake-up on Falling Edge enable                      */
      __IO uint32_t  FA_4       :  1;               /*!< [12..12] Port 1_4 Wake-up on Falling Edge enable                      */
           uint32_t             :  3;
      __IO uint32_t  CYC_0      :  1;               /*!< [16..16] GPIO1_0 input for cycle sense enable                         */
      __IO uint32_t  CYC_1      :  1;               /*!< [17..17] GPIO1_1 input for cycle sense enable                         */
      __IO uint32_t  CYC_2      :  1;               /*!< [18..18] GPIO1_2 input for cycle sense enable                         */
      __IO uint32_t  CYC_3      :  1;               /*!< [19..19] GPIO1_3 input for cycle sense enable                         */
      __IO uint32_t  CYC_4      :  1;               /*!< [20..20] GPIO1_4 input for cycle sense enable                         */
    } bit;                                          /*!< [21] BitSize                                                          */
  } WAKE_CNF_GPIO1;
} PMU_Type;


/* ================================================================================ */
/* ================                      PORT                      ================ */
/* ================================================================================ */


/**
  * @brief PORT (PORT)
  */

typedef struct {                                    /*!< (@ 0x48028000) PORT Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028000) Port 0 Data Register                                   */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 0 Pin 0 Data Value                                        */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 0 Pin 1 Data Value                                        */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 0 Pin 2 Data Value                                        */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Port 0 Pin 3 Data Value                                        */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 0 Pin 4 Data Value                                        */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Port 0 Pin 5 Data Value                                        */
           uint32_t             : 10;
      __I  uint32_t  PP0_STS    :  1;               /*!< [16..16] Port 0 Pin 0 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __I  uint32_t  PP1_STS    :  1;               /*!< [17..17] Port 0 Pin 1 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __I  uint32_t  PP2_STS    :  1;               /*!< [18..18] Port 0 Pin 2 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __I  uint32_t  PP3_STS    :  1;               /*!< [19..19] Port 0 Pin 3 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __I  uint32_t  PP4_STS    :  1;               /*!< [20..20] Port 0 Pin 4 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __I  uint32_t  PP5_STS    :  1;               /*!< [21..21] Port 0 Pin 5 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
    } bit;                                          /*!< [22] BitSize                                                          */
  } P0_DATA;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028004) Port 0 Direction Register                              */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 0 Pin 0 Direction Control                                 */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 0 Pin 1 Direction Control                                 */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 0 Pin 2 Direction Control                                 */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Port 0 Pin 3 Direction Control                                 */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 0 Pin 4 Direction Control                                 */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Port 0 Pin 5 Direction Control                                 */
           uint32_t             : 10;
      __IO uint32_t  PP0_INEN   :  1;               /*!< [16..16] Port 0 Pin 0 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP1_INEN   :  1;               /*!< [17..17] Port 0 Pin 1 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP2_INEN   :  1;               /*!< [18..18] Port 0 Pin 2 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP3_INEN   :  1;               /*!< [19..19] Port 0 Pin 3 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP4_INEN   :  1;               /*!< [20..20] Port 0 Pin 4 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP5_INEN   :  1;               /*!< [21..21] Port 0 Pin 5 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
    } bit;                                          /*!< [22] BitSize                                                          */
  } P0_DIR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028008) Port 0 Open Drain Control Register                     */
    
