zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 0 Pin 0 Open Drain Mode                                   */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 0 Pin 1 Open Drain Mode                                   */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 0 Pin 2 Open Drain Mode                                   */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Port 0 Pin 3 Open Drain Mode                                   */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 0 Pin 4 Open Drain Mode                                   */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Port 0 Pin 5 Open Drain Mode                                   */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P0_OD;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4802800C) Port 0 Pull-Up/Pull-Down Select Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 0 Bit 0                          */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Select Port 0 Bit 1                          */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 0 Bit 2                          */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Pull-Up/Pull-Down Select Port 0 Bit 3                          */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 0 Bit 4                          */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Pull-Up/Pull-Down Select Port 0 Bit 5                          */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P0_PUDSEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028010) Port 0 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 0 Bit 0                       */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Enable at Port 0 Bit 1                       */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 0 Bit 2                       */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Pull-Up/Pull-Down Enable at Port 0 Bit 3                       */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 0 Bit 4                       */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Pull-Up/Pull-Down Enable at Port 0 Bit 5                       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P0_PUDEN;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028014) Port 0 Alternate Select Register 0                     */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] See                                                            */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] See                                                            */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] See                                                            */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] See                                                            */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] See                                                            */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] See                                                            */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P0_ALTSEL0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028018) Port 0 Alternate Select Register 1                     */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] See                                                            */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] See                                                            */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] See                                                            */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] See                                                            */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] See                                                            */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] See                                                            */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P0_ALTSEL1;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028020) Port 1 Data Register                                   */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 1 Pin 0 Data Value                                        */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 1 Pin 1 Data Value                                        */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 1 Pin 2 Data Value                                        */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 1 Pin 4 Data Value                                        */
           uint32_t             : 11;
      __IO uint32_t  PP0_STS    :  1;               /*!< [16..16] Port 1 Pin 0 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __IO uint32_t  PP1_STS    :  1;               /*!< [17..17] Port 1 Pin 1 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
      __IO uint32_t  PP2_STS    :  1;               /*!< [18..18] Port 1 Pin 2 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
           uint32_t             :  1;
      __IO uint32_t  PP4_STS    :  1;               /*!< [20..20] Port 1 Pin 4 Data Value (read back of Port Data when
                                                         IO is configured as output)                                           */
    } bit;                                          /*!< [21] BitSize                                                          */
  } P1_DATA;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028024) Port 1 Direction Register                              */
    
