zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 1 Pin 0 Direction Control                                 */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 1 Pin 1 Direction Control                                 */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 1 Pin 2 Direction Control                                 */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 1 Pin 4 Direction Control                                 */
           uint32_t             : 11;
      __IO uint32_t  PP0_INEN   :  1;               /*!< [16..16] Port 1 Pin 0 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP1_INEN   :  1;               /*!< [17..17] Port 1 Pin 1 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
      __IO uint32_t  PP2_INEN   :  1;               /*!< [18..18] Port 1 Pin 2 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
           uint32_t             :  1;
      __IO uint32_t  PP4_INEN   :  1;               /*!< [20..20] Port 1 Pin 4 Input Schmitt Trigger enable (only valid
                                                         if IO is configured as output)                                        */
    } bit;                                          /*!< [21] BitSize                                                          */
  } P1_DIR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028028) Port 1 Open Drain Control Register                     */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 1 Pin 0 Open Drain Mode                                   */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 1 Pin 1 Open Drain Mode                                   */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 1 Pin 2 Open Drain Mode                                   */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 1 Pin 4 Open Drain Mode                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_OD;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4802802C) Port 1 Pull-Up/Pull-Down Select Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 1 Bit 0                          */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Select Port 1 Bit 1                          */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 1 Bit 2                          */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 1 Bit 4                          */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_PUDSEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028030) Port 1 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 1 Bit 0                       */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Enable at Port 1 Bit 1                       */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 1 Bit 2                       */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 1 Bit 4                       */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_PUDEN;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028034) Port 1 Alternate Select Register 0                     */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] See                                                            */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] See                                                            */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] See                                                            */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] See                                                            */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_ALTSEL0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028038) Port 1 Alternate Select Register 1                     */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] See                                                            */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] See                                                            */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] See                                                            */
           uint32_t             :  1;
      __IO uint32_t  PP4        :  1;               /*!< [4..4] See                                                            */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_ALTSEL1;
  __I  uint32_t  RESERVED1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028040) Port 2 Data Register                                   */
    
