zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 2 Pin 0 Data Value                                        */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 2 Pin 1 Data Value                                        */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 2 Pin 2 Data Value                                        */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Port 2 Pin 3 Data Value                                        */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 2 Pin 4 Data Value                                        */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Port 2 Pin 5 Data Value                                        */
      __IO uint32_t  PP6        :  1;               /*!< [6..6] Port 2 Pin 6 Data Value                                        */
      __IO uint32_t  PP7        :  1;               /*!< [7..7] Port 2 Pin 7 Data Value                                        */
    } bit;                                          /*!< [8] BitSize                                                           */
  } P2_DATA;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028044) Port 2 Direction Register                              */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Port 2 Pin 0 Driver Control                                    */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Port 2 Pin 1 Driver Control                                    */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Port 2 Pin 2 Driver Control                                    */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Port 2 Pin 3 Driver Control                                    */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Port 2 Pin 4 Driver Control                                    */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Port 2 Pin 5 Driver Control                                    */
      __IO uint32_t  PP6        :  1;               /*!< [6..6] Port 2 Pin 6 Driver Control                                    */
      __IO uint32_t  PP7        :  1;               /*!< [7..7] Port 2 Pin 7 Driver Control                                    */
    } bit;                                          /*!< [8] BitSize                                                           */
  } P2_DIR;
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4802804C) Port 2 Pull-Up/Pull-Down Select Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 2 Bit 0                          */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Select Port 2 Bit 1                          */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 2 Bit 2                          */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Pull-Up/Pull-Down Select Port 2 Bit 3                          */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 2 Bit 4                          */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Pull-Up/Pull-Down Select Port 2 Bit 5                          */
      __IO uint32_t  PP6        :  1;               /*!< [6..6] Pull-Up/Pull-Down Select Port 2 Bit 6                          */
      __IO uint32_t  PP7        :  1;               /*!< [7..7] Pull-Up/Pull-Down Select Port 2 Bit 7                          */
    } bit;                                          /*!< [8] BitSize                                                           */
  } P2_PUDSEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48028050) Port 2 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint32_t  PP0        :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 2 Bit 0                       */
      __IO uint32_t  PP1        :  1;               /*!< [1..1] Pull-Up/Pull-Down Enable at Port 2 Bit 1                       */
      __IO uint32_t  PP2        :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 2 Bit 2                       */
      __IO uint32_t  PP3        :  1;               /*!< [3..3] Pull-Up/Pull-Down Enable at Port 2 Bit 3                       */
      __IO uint32_t  PP4        :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 2 Bit 4                       */
      __IO uint32_t  PP5        :  1;               /*!< [5..5] Pull-Up/Pull-Down Enable at Port 2 Bit 5                       */
      __IO uint32_t  PP6        :  1;               /*!< [6..6] Pull-Up/Pull-Down Enable at Port 2 Bit 6                       */
      __IO uint32_t  PP7        :  1;               /*!< [7..7] Pull-Up/Pull-Down Enable at Port 2 Bit 7                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } P2_PUDEN;
} PORT_Type;


/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */


/**
  * @brief SCU (SCU)
  */

typedef struct {                                    /*!< (@ 0x50005000) SCU Structure                                          */
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005000) NMI Status Clear Register                              */
    
    struct {
           uint32_t             :  1;
      __O  uint32_t  FNMIPLLC   :  1;               /*!< [1..1] PLL NMI Flag                                                   */
      __O  uint32_t  FNMINVMC   :  1;               /*!< [2..2] NVM Operation Complete NMI Flag                                */
      __O  uint32_t  FNMIOTC    :  1;               /*!< [3..3] Overtemperature NMI Flag                                       */
      __O  uint32_t  FNMIOWDC   :  1;               /*!< [4..4] Oscillator Watchdog NMI Flag                                   */
      __O  uint32_t  FNMIMAPC   :  1;               /*!< [5..5] NVM Map Error NMI Flag                                         */
      __O  uint32_t  FNMIECCC   :  1;               /*!< [6..6] ECC Error NMI Flag                                             */
      __O  uint32_t  FNMISUPC   :  1;               /*!< [7..7] Supply Prewarning NMI Flag                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMISRCLR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005004) Interrupt Request Register 0                           */
    
