zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __I  uint32_t  EXINT0R    :  1;               /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge        */
      __I  uint32_t  EXINT0F    :  1;               /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge       */
      __I  uint32_t  EXINT1R    :  1;               /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge        */
      __I  uint32_t  EXINT1F    :  1;               /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge       */
      __I  uint32_t  EXINT2R    :  1;               /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge        */
      __I  uint32_t  EXINT2F    :  1;               /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } IRCON0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005008) Interrupt Request Register 1                           */
    
    struct {
      __I  uint32_t  MON1R      :  1;               /*!< [0..0] Interrupt Flag for MON1x on rising edge                        */
      __I  uint32_t  MON1F      :  1;               /*!< [1..1] Interrupt Flag for MON1x on falling edge                       */
      __I  uint32_t  MON2R      :  1;               /*!< [2..2] Interrupt Flag for MON2x on rising edge                        */
      __I  uint32_t  MON2F      :  1;               /*!< [3..3] Interrupt Flag for MON2x on falling edge                       */
      __I  uint32_t  MON3R      :  1;               /*!< [4..4] Interrupt Flag for MON3x on rising edge                        */
      __I  uint32_t  MON3F      :  1;               /*!< [5..5] Interrupt Flag for MON3x on falling edge                       */
      __I  uint32_t  MON4R      :  1;               /*!< [6..6] Interrupt Flag for MON4x on rising edge                        */
      __I  uint32_t  MON4F      :  1;               /*!< [7..7] Interrupt Flag for MON4x on falling edge                       */
      __I  uint32_t  MON5R      :  1;               /*!< [8..8] Interrupt Flag for MON5x on rising edge                        */
      __I  uint32_t  MON5F      :  1;               /*!< [9..9] Interrupt Flag for MON5x on falling edge                       */
    } bit;                                          /*!< [10] BitSize                                                          */
  } IRCON1;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5000500C) Interrupt Request Register 2                           */
    
    struct {
      __I  uint32_t  EIR1       :  1;               /*!< [0..0] Error Interrupt Flag for SSC1                                  */
      __I  uint32_t  TIR1       :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC1                               */
      __I  uint32_t  RIR1       :  1;               /*!< [2..2] Receive Interrupt Flag for SSC1                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON2;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005010) Interrupt Request Register 3                           */
    
    struct {
      __I  uint32_t  EIR2       :  1;               /*!< [0..0] Error Interrupt Flag for SSC2                                  */
      __I  uint32_t  TIR2       :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC2                               */
      __I  uint32_t  RIR2       :  1;               /*!< [2..2] Receive Interrupt Flag for SSC2                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON3;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005014) Interrupt Request Register 4                           */
    
    struct {
      __I  uint32_t  CCU6SR0    :  1;               /*!< [0..0] Interrupt Flag 0 for CCU6                                      */
           uint32_t             :  3;
      __I  uint32_t  CCU6SR1    :  1;               /*!< [4..4] Interrupt Flag 1 for CCU6                                      */
           uint32_t             : 11;
      __I  uint32_t  CCU6SR2    :  1;               /*!< [16..16] Interrupt Flag 2 for CCU6                                    */
           uint32_t             :  3;
      __I  uint32_t  CCU6SR3    :  1;               /*!< [20..20] Interrupt Flag 3 for CCU6                                    */
    } bit;                                          /*!< [21] BitSize                                                          */
  } IRCON4;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005018) NMI Status Register                                    */
    
    struct {
           uint32_t             :  1;
      __I  uint32_t  FNMIPLL    :  1;               /*!< [1..1] PLL NMI Flag                                                   */
      __I  uint32_t  FNMINVM    :  1;               /*!< [2..2] NVM Operation Complete NMI Flag                                */
      __I  uint32_t  FNMIOT     :  1;               /*!< [3..3] Overtemperature NMI Flag                                       */
      __I  uint32_t  FNMIOWD    :  1;               /*!< [4..4] Oscillator Watchdog NMI Flag                                   */
      __I  uint32_t  FNMIMAP    :  1;               /*!< [5..5] NVM Map Error NMI Flag                                         */
      __I  uint32_t  FNMIECC    :  1;               /*!< [6..6] ECC Error NMI Flag                                             */
      __I  uint32_t  FNMISUP    :  1;               /*!< [7..7] Supply Prewarning NMI Flag                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMISR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000501C) Interrupt Enable Register 0                            */
    
