zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             : 31;
      __IO uint32_t  EA         :  1;               /*!< [31..31] Global Interrupt Mask                                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } IEN0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005020) Vector Table Reallocation Register                     */
    
    struct {
      __IO uint32_t  VTOR_BYP   :  2;               /*!< [0..1] Vector Table Bypass Mode                                       */
    } bit;                                          /*!< [2] BitSize                                                           */
  } VTOR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005024) NMI Control Register                                   */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  NMIPLL     :  1;               /*!< [1..1] PLL Loss of Lock NMI Enable                                    */
      __IO uint32_t  NMINVM     :  1;               /*!< [2..2] NVM Operation Complete NMI Enable                              */
      __IO uint32_t  NMIOT      :  1;               /*!< [3..3] NMI OT Enable                                                  */
      __IO uint32_t  NMIOWD     :  1;               /*!< [4..4] Oscillator Watchdog NMI Enable                                 */
      __IO uint32_t  NMIMAP     :  1;               /*!< [5..5] NVM Map Error NMI Enable                                       */
      __IO uint32_t  NMIECC     :  1;               /*!< [6..6] ECC Error NMI Enable                                           */
      __IO uint32_t  NMISUP     :  1;               /*!< [7..7] Supply Prewarning NMI Enable                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMICON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005028) External Interrupt Control Register 0                  */
    
    struct {
      __IO uint32_t  EXINT0     :  2;               /*!< [0..1] External Interrupt 0 Trigger Select                            */
      __IO uint32_t  EXINT1     :  2;               /*!< [2..3] External Interrupt 1 Trigger Select                            */
      __IO uint32_t  EXINT2     :  2;               /*!< [4..5] External Interrupt 2 Trigger Select                            */
    } bit;                                          /*!< [6] BitSize                                                           */
  } EXICON0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000502C) External Interrupt Control Register 1                  */
    
    struct {
      __IO uint32_t  MON1       :  2;               /*!< [0..1] MON1 Input Trigger Select                                      */
      __IO uint32_t  MON2       :  2;               /*!< [2..3] MON2 Input Trigger Select                                      */
      __IO uint32_t  MON3       :  2;               /*!< [4..5] MON3 Input Trigger Select                                      */
      __IO uint32_t  MON4       :  2;               /*!< [6..7] MON4 Input Trigger Select                                      */
      __IO uint32_t  MON5       :  2;               /*!< [8..9] MON5 Input Trigger Select                                      */
    } bit;                                          /*!< [10] BitSize                                                          */
  } EXICON1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005030) Peripheral Interrupt Enable Register 1                 */
    
    struct {
      __IO uint32_t  EIREN1     :  1;               /*!< [0..0] SSC 1 Error Interrupt Enable                                   */
      __IO uint32_t  TIREN1     :  1;               /*!< [1..1] SSC 1 Transmit Interrupt Enable                                */
      __IO uint32_t  RIREN1     :  1;               /*!< [2..2] SSC 1 Receive Interrupt Enable                                 */
           uint32_t             :  5;
      __IO uint32_t  EIREN2     :  1;               /*!< [8..8] SSC 2 Error Interrupt Enable                                   */
      __IO uint32_t  TIREN2     :  1;               /*!< [9..9] SSC 2 Transmit Interrupt Enable                                */
      __IO uint32_t  RIREN2     :  1;               /*!< [10..10] SSC 2 Receive Interrupt Enable                               */
    } bit;                                          /*!< [11] BitSize                                                          */
  } MODIEN1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005034) Peripheral Interrupt Enable Register 2                 */
    
    struct {
      __IO uint32_t  RIEN1      :  1;               /*!< [0..0] UART 1 Receive Interrupt Enable                                */
      __IO uint32_t  TIEN1      :  1;               /*!< [1..1] UART 1 Transmit Interrupt Enable                               */
           uint32_t             :  3;
      __IO uint32_t  EXINT2_EN  :  1;               /*!< [5..5] External Interrupt 2 Enable                                    */
      __IO uint32_t  RIEN2      :  1;               /*!< [6..6] UART 2 Receive Interrupt Enable                                */
      __IO uint32_t  TIEN2      :  1;               /*!< [7..7] UART 2 Transmit Interrupt Enable                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODIEN2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005038) Peripheral Interrupt Enable Register 3                 */
    
    struct {
      __IO uint32_t  IE0        :  1;               /*!< [0..0] External Interrupt Enable                                      */
    } bit;                                          /*!< [1] BitSize                                                           */
  } MODIEN3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000503C) Peripheral Interrupt Enable Register 4                 */
    
