zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  IE1        :  1;               /*!< [0..0] External Interrupt Enable                                      */
    } bit;                                          /*!< [1] BitSize                                                           */
  } MODIEN4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005040) Power Mode Control Register 0                          */
    
    struct {
      __IO uint32_t  XTAL_ON    :  1;               /*!< [0..0] OSC_HP Operation in Power Down Mode                            */
      __IO uint32_t  SL         :  1;               /*!< [1..1] Sleep Mode Enable. Active High.                                */
      __IO uint32_t  PD         :  1;               /*!< [2..2] Power Down Mode (Stop mode) Enable. Active High.               */
      __IO uint32_t  SD         :  1;               /*!< [3..3] Slow Down Mode Enable. Active High.                            */
    } bit;                                          /*!< [4] BitSize                                                           */
  } PMCON0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005044) PLL Control Register                                   */
    
    struct {
      __I  uint32_t  LOCK       :  1;               /*!< [0..0] PLL Lock Status Flag                                           */
      __IO uint32_t  RESLD      :  1;               /*!< [1..1] Restart Lock Detection                                         */
      __IO uint32_t  OSCDISC    :  1;               /*!< [2..2] Oscillator Disconnect                                          */
      __IO uint32_t  VCOBYP     :  1;               /*!< [3..3] PLL VCO Bypass Mode Select                                     */
      __IO uint32_t  NDIV       :  4;               /*!< [4..7] PLL N-Divider                                                  */
           uint32_t             :  2;
      __O  uint32_t  UNPROT_OSCDISC:  1;            /*!< [10..10] Unprotect write access of OSC_DISC                           */
      __O  uint32_t  UNPROT_VCOBYP:  1;             /*!< [11..11] Unprotect write access of VCO_BYP                            */
    } bit;                                          /*!< [12] BitSize                                                          */
  } PLL_CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005048) Clock Control Register 1                               */
    
    struct {
      __IO uint32_t  CLKREL     :  4;               /*!< [0..3] Slow Down Clock Divider for fCCLK Generation                   */
      __IO uint32_t  K2DIV      :  2;               /*!< [4..5] PLL K2-Divider                                                 */
      __IO uint32_t  K1DIV      :  1;               /*!< [6..6] PLL K1-Divider                                                 */
           uint32_t             :  1;
      __IO uint32_t  PDIV       :  2;               /*!< [8..9] PLL PDIV-Divider                                               */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CMCON1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000504C) Clock Control Register 2                               */
    
    struct {
      __IO uint32_t  PBA0CLKREL :  1;               /*!< [0..0] PBA0 Clock Divider                                             */
    } bit;                                          /*!< [1] BitSize                                                           */
  } CMCON2;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005054) Analog Peripheral Clock Control Register               */
    
    struct {
      __IO uint32_t  APCLK_SET  :  1;               /*!< [0..0] Set and Overtake Flag for Clock Settings                       */
           uint32_t             :  7;
      __IO uint32_t  CLKWDT_IE  :  1;               /*!< [8..8] Clock Watchdog Interrupt Enable                                */
    } bit;                                          /*!< [9] BitSize                                                           */
  } APCLK_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005058) Analog Peripheral Clock Register                       */
    
    struct {
      __IO uint32_t  APCLK1FAC  :  2;               /*!< [0..1] Analog Module Clock Factor                                     */
           uint32_t             :  6;
      __IO uint32_t  APCLK2FAC  :  5;               /*!< [8..12] Slow Down Clock Divider for TFILT_CLK Generation              */
           uint32_t             : 11;
      __IO uint32_t  BGCLK_SEL  :  1;               /*!< [24..24] Bandgap Clock Selection                                      */
      __IO uint32_t  BGCLK_DIV  :  1;               /*!< [25..25] Bandgap Clock Divider                                        */
    } bit;                                          /*!< [26] BitSize                                                          */
  } APCLK;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5000505C) Analog Peripheral Clock Status Register                */
    
    struct {
      __I  uint32_t  APCLK1STS  :  2;               /*!< [0..1] Analog Peripherals Clock Status                                */
           uint32_t             :  6;
      __I  uint32_t  APCLK2STS  :  2;               /*!< [8..9] Analog Peripherals Clock Status                                */
           uint32_t             :  6;
      __I  uint32_t  APCLK3STS  :  1;               /*!< [16..16] Loss of Clock Status                                         */
           uint32_t             :  7;
      __I  uint32_t  PLL_LOCK   :  1;               /*!< [24..24] PLL LOCK Status                                              */
    } bit;                                          /*!< [25] BitSize                                                          */
  } APCLK_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005060) Peripheral Management Control Register                 */
    
