zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  ADC1_DIS   :  1;               /*!< [0..0] ADC1 Disable Request. Active high.                             */
      __IO uint32_t  SSC1_DIS   :  1;               /*!< [1..1] SSC1 Disable Request. Active high.                             */
      __IO uint32_t  CCU_DIS    :  1;               /*!< [2..2] CCU Disable Request. Active high.                              */
      __IO uint32_t  T2_DIS     :  1;               /*!< [3..3] T2 Disable Request. Active high.                               */
      __IO uint32_t  GPT12_DIS  :  1;               /*!< [4..4] General Purpose Timer 12 Disable Request. Active high.         */
           uint32_t             :  3;
      __IO uint32_t  SSC2_DIS   :  1;               /*!< [8..8] SSC2 Disable Request. Active high.                             */
           uint32_t             :  1;
      __IO uint32_t  T21_DIS    :  1;               /*!< [10..10] T21 Disable Request. Active high.                            */
    } bit;                                          /*!< [11] BitSize                                                          */
  } PMCON;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005064) Analog Peripheral Clock Status Clear Register          */
    
    struct {
      __O  uint32_t  APCLK1SCLR :  1;               /*!< [0..0] Analog Peripherals Clock Status Clear                          */
           uint32_t             :  7;
      __O  uint32_t  APCLK2SCLR :  1;               /*!< [8..8] Analog Peripherals Clock Status Clear                          */
           uint32_t             :  7;
      __O  uint32_t  APCLK3SCLR :  1;               /*!< [16..16] Analog Peripherals Clock 3 Status Clear                      */
           uint32_t             :  7;
      __O  uint32_t  PLL_LOCK_SCLR:  1;             /*!< [24..24] PLL Lock Status Clear                                        */
    } bit;                                          /*!< [25] BitSize                                                          */
  } APCLK_SCLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005068) Reset Control Register                                 */
    
    struct {
      __IO uint32_t  LOCKUP     :  1;               /*!< [0..0] Lockup Flag                                                    */
           uint32_t             :  6;
      __IO uint32_t  LOCKUP_EN  :  1;               /*!< [7..7] Lockup Reset Enable Flag                                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } RSTCON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000506C) ADC1 Peripheral Clock Register                         */
    
    struct {
      __IO uint32_t  ADC1_CLK_DIV:  4;              /*!< [0..3] ADC1 Clock divider                                             */
           uint32_t             :  4;
      __IO uint32_t  DPP1_CLK_DIV:  2;              /*!< [8..9] ADC1 Post processing clock divider                             */
    } bit;                                          /*!< [10] BitSize                                                          */
  } ADC1_CLK;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005070) System Control Register 0                              */
    
    struct {
           uint32_t             :  4;
      __I  uint32_t  NVMCLKFAC  :  2;               /*!< [4..5] NVM Access Clock Factor                                        */
      __IO uint32_t  SYSCLKSEL  :  2;               /*!< [6..7] System Clock Select                                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SYSCON0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005074) System Startup Status Register                         */
    
    struct {
      __IO uint32_t  INIT_FAIL  :  1;               /*!< [0..0] Initialization at startup failed                               */
      __IO uint32_t  MRAMINITSTS:  1;               /*!< [1..1] Map RAM Initialisation Status                                  */
      __IO uint32_t  PG100TP_CHKS_ERR:  1;          /*!< [2..2] 100 TP Page Checksum Error                                     */
    } bit;                                          /*!< [3] BitSize                                                           */
  } SYS_STRTUP_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005078) Wakeup Interrupt Control Register                      */
    
    struct {
      __IO uint32_t  WAKEUPEN   :  1;               /*!< [0..0] Wakeup Interrupt Enable                                        */
    } bit;                                          /*!< [1] BitSize                                                           */
  } WAKECON;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5000507C) Interrupt Request Register 5                           */
    
    struct {
      __I  uint32_t  WAKEUP     :  1;               /*!< [0..0] Interrupt Flag for Wakeup                                      */
    } bit;                                          /*!< [1] BitSize                                                           */
  } IRCON5;
  __I  uint32_t  RESERVED1[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005088) Baud Rate Control Register 1                           */
    
    struct {
      __IO uint32_t  BR1_R      :  1;               /*!< [0..0] Baud Rate Generator Run Control Bit                            */
      __IO uint32_t  BR1_PRE    :  3;               /*!< [1..3] Prescaler Bit                                                  */
    } bit;                                          /*!< [4] BitSize                                                           */
  } BCON1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000508C) Baud Rate Timer/Reload Register, Low Byte 1            */
    
