zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  BG1_FD_SEL :  5;               /*!< [0..4] Fractional Divider Selection                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } BGL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005090) Baud Rate Timer/Reload Register                        */
    
    struct {
      __IO uint32_t  BG1_BR_VALUE: 11;              /*!< [0..10] Baud Rate Timer/Reload Value UART1                            */
    } bit;                                          /*!< [11] BitSize                                                          */
  } BG1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005094) LIN Status Register                                    */
    
    struct {
      __IO uint32_t  BRDIS      :  1;               /*!< [0..0] Baud Rate Detection Disable                                    */
      __IO uint32_t  BGSEL      :  2;               /*!< [1..2] Baud Rate Select for Detection                                 */
      __I  uint32_t  BRK        :  1;               /*!< [3..3] Break Field Flag                                               */
      __I  uint32_t  EOFSYN     :  1;               /*!< [4..4] End of SYN Byte Interrupt Flag                                 */
      __I  uint32_t  ERRSYN     :  1;               /*!< [5..5] SYN Byte Error Interrupt Flag                                  */
      __IO uint32_t  SYNEN      :  1;               /*!< [6..6] End of SYN Byte and SYN Byte Error Interrupts Enable           */
    } bit;                                          /*!< [7] BitSize                                                           */
  } LINST;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50005098) Baud Rate Control Register 2                           */
    
    struct {
      __IO uint32_t  BR2_R      :  1;               /*!< [0..0] Baud Rate Generator Run Control Bit                            */
      __IO uint32_t  BR2_PRE    :  3;               /*!< [1..3] Prescaler Bit                                                  */
    } bit;                                          /*!< [4] BitSize                                                           */
  } BCON2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000509C) Baud Rate Timer/Reload Register, Low Byte 2            */
    
    struct {
      __IO uint32_t  BG2_FD_SEL :  5;               /*!< [0..4] Fractional Divider Selection                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } BGL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050A0) Baud Rate Timer/Reload Register                        */
    
    struct {
      __IO uint32_t  BG2_BR_VALUE: 11;              /*!< [0..10] Baud Rate Timer/Reload Value UART2                            */
    } bit;                                          /*!< [11] BitSize                                                          */
  } BG2;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x500050A4) LIN Status Clear Register                              */
    
    struct {
           uint32_t             :  3;
      __O  uint32_t  BRKC       :  1;               /*!< [3..3] Break Field Flag Clear                                         */
      __O  uint32_t  EOFSYNC    :  1;               /*!< [4..4] End of SYN Byte Interrupt Flag Clear                           */
      __O  uint32_t  ERRSYNC    :  1;               /*!< [5..5] SYN Byte Error Interrupt Flag                                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } LINSCLR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x500050A8) Identity Register                                      */
    
    struct {
      __I  uint32_t  VERID      :  3;               /*!< [0..2] Version ID                                                     */
      __I  uint32_t  PRODID     :  5;               /*!< [3..7] Product ID                                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } ID;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050AC) Password Register                                      */
    
    struct {
      __IO uint32_t  PW_MODE    :  2;               /*!< [0..1] Bit-Protection Scheme Control Bit                              */
      __I  uint32_t  PROTECT_S  :  1;               /*!< [2..2] Bit-Protection Signal Status Bit                               */
      __IO uint32_t  PASS       :  5;               /*!< [3..7] Password Bits                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PASSWD;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050B0) OSC Control Register                                   */
    
    struct {
      __IO uint32_t  OSCSS      :  2;               /*!< [0..1] Oscillator Source Select                                       */
      __IO uint32_t  OSCWDTRST  :  1;               /*!< [2..2] Oscillator Watchdog Reset                                      */
      __I  uint32_t  OSC2L      :  1;               /*!< [3..3] OSC-Too-Low Condition Flag                                     */
      __IO uint32_t  XPD        :  1;               /*!< [4..4] XTAL (OSC_HP) Power Down Control                               */
    } bit;                                          /*!< [5] BitSize                                                           */
  } OSC_CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050B4) Clock Output Control Register                          */
    
