zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  COREL      :  4;               /*!< [0..3] Clock Output Divider                                           */
      __IO uint32_t  COUTS0     :  1;               /*!< [4..4] Clock Out Source Select Bit 0                                  */
      __IO uint32_t  TLEN       :  1;               /*!< [5..5] Toggle Latch Enable                                            */
      __IO uint32_t  COUTS1     :  1;               /*!< [6..6] Clock Out Source Select Bit 1                                  */
      __IO uint32_t  EN         :  1;               /*!< [7..7] CLKOUT Enable                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } COCON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050B8) Peripheral Input Select Register                       */
    
    struct {
      __IO uint32_t  EXINT0IS   :  2;               /*!< [0..1] External Interrupt 0 Input Select                              */
      __IO uint32_t  EXINT1IS   :  2;               /*!< [2..3] External Interrupt 1 Input Select                              */
      __IO uint32_t  EXINT2IS   :  2;               /*!< [4..5] External Interrupt 2 Input Select                              */
      __IO uint32_t  URIOS1     :  1;               /*!< [6..6] UART1 Input/Output Select                                      */
      __IO uint32_t  U_TX_CONDIS:  1;               /*!< [7..7] UART1 TxD Connection Disable                                   */
           uint32_t             :  8;
      __IO uint32_t  SSC12_M_SCK_OUTSEL:  1;        /*!< [16..16] Output selection for SSC12_M_SCK                             */
      __IO uint32_t  SSC12_M_MTSR_OUTSEL:  1;       /*!< [17..17] Output selection for SSC12_M_MTSR                            */
      __IO uint32_t  SSC12_S_MRST_OUTSEL:  1;       /*!< [18..18] Output selection for SSC12_S_MRST                            */
    } bit;                                          /*!< [19] BitSize                                                          */
  } MODPISEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050BC) Peripheral Input Select Register 1                     */
    
    struct {
      __IO uint32_t  XTAL12EN   :  1;               /*!< [0..0] Pins XTAL1/2 Enable Bit                                        */
           uint32_t             :  5;
      __IO uint32_t  T2EXCON    :  1;               /*!< [6..6] Timer 2 External Input Control                                 */
      __IO uint32_t  T21EXCON   :  1;               /*!< [7..7] Timer 21 External Input Control                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODPISEL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050C0) Peripheral Input Select Register 2                     */
    
    struct {
      __IO uint32_t  T2IS       :  2;               /*!< [0..1] Timer 2 Input Select                                           */
      __IO uint32_t  T21IS      :  2;               /*!< [2..3] Timer 21 Input Select                                          */
      __IO uint32_t  T2EXIS     :  2;               /*!< [4..5] Timer 2 External Input Select                                  */
      __IO uint32_t  T21EXIS    :  2;               /*!< [6..7] Timer 21 External Input Select                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODPISEL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050C4) Peripheral Input Select Register 3                     */
    
    struct {
           uint32_t             :  6;
      __IO uint32_t  URIOS2     :  1;               /*!< [6..6] UART2 Input/Output Select                                      */
    } bit;                                          /*!< [7] BitSize                                                           */
  } MODPISEL3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050C8) Module Suspend Control Register                        */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  T12SUSP    :  1;               /*!< [1..1] Timer 12 Debug Suspend Bit                                     */
      __IO uint32_t  T13SUSP    :  1;               /*!< [2..2] Timer 13 Debug Suspend Bit                                     */
      __IO uint32_t  T2_SUSP    :  1;               /*!< [3..3] Timer2 Debug Suspend Bit                                       */
      __IO uint32_t  GPT12_SUSP :  1;               /*!< [4..4] GPT12 Debug Suspend Bit                                        */
           uint32_t             :  1;
      __IO uint32_t  T21_SUSP   :  1;               /*!< [6..6] Timer21 Debug Suspend Bit                                      */
      __IO uint32_t  WDT1SUSP   :  1;               /*!< [7..7] Watchdog Timer 1 Debug Suspend Bit                             */
           uint32_t             :  1;
      __IO uint32_t  MU_SUSP    :  1;               /*!< [9..9] Measurement Unit Debug Suspend Bit                             */
      __IO uint32_t  ADC1_SUSP  :  1;               /*!< [10..10] ADC1 Unit Debug Suspend Bit                                  */
    } bit;                                          /*!< [11] BitSize                                                          */
  } MODSUSP;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050CC) Emergency and Program Operation Status Register        */
    
    struct {
      __IO uint32_t  NVMPROP    :  1;               /*!< [0..0] NVM Program Operation Status Bit                               */
      __IO uint32_t  EMPROP     :  1;               /*!< [1..1] Emergency Program Operation Status Bit                         */
    } bit;                                          /*!< [2] BitSize                                                           */
  } EMOP;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050D0) GPT12 Peripheral Input Select Register                 */
    
