zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  GPT12      :  4;               /*!< [0..3] GPT12 TIN3B / TIN4D Input Select                               */
      __IO uint32_t  TRIG_CONF  :  1;               /*!< [4..4] CCU6 Trigger Configuration.                                    */
      __IO uint32_t  GPT12_SEL  :  1;               /*!< [5..5] CCU6 Trigger Configuration.                                    */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12PISEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050D4) Error Detection and Correction Control Register        */
    
    struct {
      __IO uint32_t  RIE        :  1;               /*!< [0..0] RAM Double Bit ECC Error Interrupt Enable                      */
           uint32_t             :  1;
      __IO uint32_t  NVMIE      :  1;               /*!< [2..2] NVM Double Bit ECC Error Interrupt Enable                      */
    } bit;                                          /*!< [3] BitSize                                                           */
  } EDCCON;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x500050D8) Error Detection and Correction Status Register         */
    
    struct {
      __I  uint32_t  RDBE       :  1;               /*!< [0..0] RAM Double Bit Error                                           */
           uint32_t             :  1;
      __I  uint32_t  NVMDBE     :  1;               /*!< [2..2] NVM Double Bit Error                                           */
           uint32_t             :  1;
      __I  uint32_t  RSBE       :  1;               /*!< [4..4] RAM Single Bit Error                                           */
    } bit;                                          /*!< [5] BitSize                                                           */
  } EDCSTAT;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050DC) Memory Status Register                                 */
    
    struct {
      __IO uint32_t  SECTORINFO :  6;               /*!< [0..5] Sector Information                                             */
      __IO uint32_t  SASTATUS   :  2;               /*!< [6..7] Service Algorithm Status                                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MEMSTAT;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x500050E0) NVM Protection Status Register                         */
    
    struct {
      __I  uint32_t  EN_PRG_NL  :  1;               /*!< [0..0] NVM Protection of Data in Non-Linear Sectors                   */
      __I  uint32_t  EN_PRG_LIN :  1;               /*!< [1..1] NVM Protection of Data in Linear Sectors                       */
      __I  uint32_t  EN_PRG_CBSL:  1;               /*!< [2..2] NVM Protection of Data in CBSL Region                          */
      __I  uint32_t  EN_RD_NL   :  1;               /*!< [3..3] NVM Read Protection of Data in Non-Linear Sectors              */
      __I  uint32_t  EN_RD_LIN  :  1;               /*!< [4..4] NVM Read Protection of Data in Linear Sectors                  */
      __I  uint32_t  EN_RD_CBSL :  1;               /*!< [5..5] NVM Read Protection of Data in CBSL Region                     */
           uint32_t             :  2;
      __I  uint32_t  EN_RD_S0   :  1;               /*!< [8..8] NVM Read Protection for Sector 0                               */
      __I  uint32_t  DIS_RDUS   :  1;               /*!< [9..9] Configuration of NVM Read Protection for Sector 1...n
                                                         with EN_RD_* = 0                                                      */
      __I  uint32_t  DIS_RDUS_S0:  1;               /*!< [10..10] Configuration of NVM Read Protection for Sector 0 with
                                                         EN_RD_S0 = 0                                                          */
      __I  uint32_t  NL_PW      :  1;               /*!< [11..11] Status of Non-Linear Region Password / Protection            */
      __I  uint32_t  LIN_PW     :  1;               /*!< [12..12] Status of Linear Region Password / Protection                */
      __I  uint32_t  CBSL_PW    :  1;               /*!< [13..13] Status of CBSL Region Password / Protection                  */
      __I  uint32_t  NVMBSL     :  2;               /*!< [14..15] CBSL Region Size Definition                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVM_PROT_STS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x500050E4) Memory Access Status Register                          */
    
    struct {
      __I  uint32_t  NVM_PROT_ERR:  1;              /*!< [0..0] NVM Access Protection                                          */
      __I  uint32_t  NVM_ADDR_ERR:  1;              /*!< [1..1] NVM Address Protection                                         */
      __I  uint32_t  NVM_SFR_PROT_ERR:  1;          /*!< [2..2] NVM SFR Access Protection                                      */
      __I  uint32_t  NVM_SFR_ADDR_ERR:  1;          /*!< [3..3] NVM SFR Address Protection                                     */
      __I  uint32_t  ROM_PROT_ERR:  1;              /*!< [4..4] ROM Access Protection                                          */
    } bit;                                          /*!< [5] BitSize                                                           */
  } MEM_ACC_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050E8) Port Output Control Register                           */
    
    struct {
      __IO uint32_t  P0_PDM0    :  3;               /*!< [0..2] P0.0 Port Driver Mode                                          */
           uint32_t             :  1;
      __IO uint32_t  P0_PDM1    :  3;               /*!< [4..6] P0.1 Port Driver Mode                                          */
           uint32_t             :  1;
      __IO uint32_t  P0_PDM2    :  3;               /*!< [8..10] P0.2 Port Driver Mode                                         */
           uint32_t             :  1;
      __IO uint32_t  P0_PDM3    :  3;               /*!< [12..14] P0.3 Port Driver Mode                                        */
           uint32_t             :  1;
      __IO uint32_t  P0_PDM4    :  3;               /*!< [16..18] P0.4 Port Driver Mode                                        */
           uint32_t             :  1;
      __IO uint32_t  P0_PDM5    :  3;               /*!< [20..22] P0.5 Port Driver Mode                                        */
    } bit;                                          /*!< [23] BitSize                                                          */
  } P0_POCON0;
  __I  uint32_t  RESERVED2[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050F4) Temperature Compensation Control Register              */
    
