zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  TCC        :  2;               /*!< [0..1] Temperature Compensation Control                               */
    } bit;                                          /*!< [2] BitSize                                                           */
  } TCCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050F8) Port Output Control Register                           */
    
    struct {
      __IO uint32_t  P1_PDM0    :  3;               /*!< [0..2] P1.0 Port Driver Mode                                          */
           uint32_t             :  1;
      __IO uint32_t  P1_PDM1    :  3;               /*!< [4..6] P1.1 Port Driver Mode                                          */
           uint32_t             :  1;
      __IO uint32_t  P1_PDM2    :  3;               /*!< [8..10] P1.2 Port Driver Mode                                         */
           uint32_t             :  5;
      __IO uint32_t  P1_PDM4    :  3;               /*!< [16..18] P1.4 Port Driver Mode                                        */
    } bit;                                          /*!< [19] BitSize                                                          */
  } P1_POCON0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x500050FC) Peripheral Input Select Register 4                     */
    
    struct {
      __IO uint32_t  DU1TRIGGEN :  3;               /*!< [0..2] Differential Unit Trigger Enable                               */
           uint32_t             :  5;
      __IO uint32_t  DU2TRIGGEN :  3;               /*!< [8..10] Differential Unit Trigger Enable                              */
           uint32_t             :  5;
      __IO uint32_t  DU3TRIGGEN :  3;               /*!< [16..18] Differential Unit Trigger Enable                             */
           uint32_t             :  5;
      __IO uint32_t  DU4TRIGGEN :  3;               /*!< [24..26] Differential Unit Trigger Enable                             */
    } bit;                                          /*!< [27] BitSize                                                          */
  } MODPISEL4;
  __I  uint32_t  RESERVED3[3];
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5000510C) Error Detection and Correction Status Clear Register   */
    
    struct {
      __O  uint32_t  RDBEC      :  1;               /*!< [0..0] RAM Double Bit Error Clear                                     */
           uint32_t             :  1;
      __O  uint32_t  NVMDBEC    :  1;               /*!< [2..2] NVM Double Bit Error Clear                                     */
           uint32_t             :  1;
      __O  uint32_t  RSBEC      :  1;               /*!< [4..4] RAM Single Bit Error Clear                                     */
    } bit;                                          /*!< [5] BitSize                                                           */
  } EDCSCLR;
  __I  uint32_t  RESERVED4[19];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000515C) General Purpose Timer 12 Interrupt Enable Register     */
    
    struct {
      __IO uint32_t  T2IE       :  1;               /*!< [0..0] GPT12 T2 Interrupt Enable                                      */
      __IO uint32_t  T3IE       :  1;               /*!< [1..1] GPT12 T3 Interrupt Enable                                      */
      __IO uint32_t  T4IE       :  1;               /*!< [2..2] GPT12 T4 Interrupt Enable                                      */
      __IO uint32_t  T5IE       :  1;               /*!< [3..3] GPT12 T5 Interrupt Enable                                      */
      __IO uint32_t  T6IE       :  1;               /*!< [4..4] GPT12 T6 Interrupt Enable                                      */
      __IO uint32_t  CRIE       :  1;               /*!< [5..5] GPT12 Capture and Reload Interrupt Enable                      */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12IEN;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50005160) Timer and Counter Control/Status Register              */
    
    struct {
      __I  uint32_t  GPT1T2     :  1;               /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status                          */
      __I  uint32_t  GPT1T3     :  1;               /*!< [1..1] GPT Module 1 Timer3 Interrupt Status                           */
      __I  uint32_t  GPT1T4     :  1;               /*!< [2..2] GPT Module 1 Timer4 Interrupt Status                           */
      __I  uint32_t  GPT2T5     :  1;               /*!< [3..3] GPT Module 2 Timer5 Interrupt Status                           */
      __I  uint32_t  GPT2T6     :  1;               /*!< [4..4] GPT Module 2Timer6 Interrupt Status                            */
      __I  uint32_t  GPT12CR    :  1;               /*!< [5..5] GPT 12 Capture Reload Interrupt Status                         */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12IRC;
  __I  uint32_t  RESERVED5[5];
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005178) Interrupt Request 0 Clear Register                     */
    
    struct {
      __O  uint32_t  EXINT0RC   :  1;               /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge        */
      __O  uint32_t  EXINT0FC   :  1;               /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge       */
      __O  uint32_t  EXINT1RC   :  1;               /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge        */
      __O  uint32_t  EXINT1FC   :  1;               /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge       */
      __O  uint32_t  EXINT2RC   :  1;               /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge        */
      __O  uint32_t  EXINT2FC   :  1;               /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } IRCON0CLR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5000517C) Interrupt Request 1 Clear Register                     */
    
