zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __O  uint32_t  MON1RC     :  1;               /*!< [0..0] Interrupt Flag for MON1x on rising edge                        */
      __O  uint32_t  MON1FC     :  1;               /*!< [1..1] Interrupt Flag for MON1x on falling edge                       */
      __O  uint32_t  MON2RC     :  1;               /*!< [2..2] Interrupt Flag for MON2x on rising edge                        */
      __O  uint32_t  MON2FC     :  1;               /*!< [3..3] Interrupt Flag for MON2x on falling edge                       */
      __O  uint32_t  MON3RC     :  1;               /*!< [4..4] Interrupt Flag for MON3x on rising edge                        */
      __O  uint32_t  MON3FC     :  1;               /*!< [5..5] Interrupt Flag for MON3x on falling edge                       */
      __O  uint32_t  MON4RC     :  1;               /*!< [6..6] Interrupt Flag for MON4x on rising edge                        */
      __O  uint32_t  MON4FC     :  1;               /*!< [7..7] Interrupt Flag for MON4x on falling edge                       */
      __O  uint32_t  MON5RC     :  1;               /*!< [8..8] Interrupt Flag for MON5x on rising edge                        */
      __O  uint32_t  MON5FC     :  1;               /*!< [9..9] Interrupt Flag for MON5x on falling edge                       */
    } bit;                                          /*!< [10] BitSize                                                          */
  } IRCON1CLR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005180) Timer and Counter Control/Status Clear Register        */
    
    struct {
      __O  uint32_t  GPT1T2C    :  1;               /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status                          */
      __O  uint32_t  GPT1T3C    :  1;               /*!< [1..1] GPT Module 1 Timer3 Interrupt Status                           */
      __O  uint32_t  GPT1T4C    :  1;               /*!< [2..2] GPT Module 1 Timer4 Interrupt Status                           */
      __O  uint32_t  GPT2T5C    :  1;               /*!< [3..3] GPT Module 2 Timer5 Interrupt Status                           */
      __O  uint32_t  GPT2T6C    :  1;               /*!< [4..4] GPT Module 2 Timer6 Interrupt Status                           */
      __O  uint32_t  GPT12CRC   :  1;               /*!< [5..5] GPT Module 1 Capture Reload Interrupt Status                   */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12ICLR;
  __I  uint32_t  RESERVED6[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000518C) Monitoring Input Interrupt Enable Register             */
    
    struct {
      __IO uint32_t  MON1IE     :  1;               /*!< [0..0] MON1 Interrupt Enable                                          */
      __IO uint32_t  MON2IE     :  1;               /*!< [1..1] MON2 Interrupt Enable                                          */
      __IO uint32_t  MON3IE     :  1;               /*!< [2..2] MON3 Interrupt Enable                                          */
      __IO uint32_t  MON4IE     :  1;               /*!< [3..3] MON4 Interrupt Enable                                          */
      __IO uint32_t  MON5IE     :  1;               /*!< [4..4] MON5 Interrupt Enable                                          */
    } bit;                                          /*!< [5] BitSize                                                           */
  } MONIEN;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005190) Interrupt Request 2 Clear Register                     */
    
    struct {
      __O  uint32_t  EIR1C      :  1;               /*!< [0..0] Error Interrupt Flag for SSC1                                  */
      __O  uint32_t  TIR1C      :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC1                               */
      __O  uint32_t  RIR1C      :  1;               /*!< [2..2] Receive Interrupt Flag for SSC1                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON2CLR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005194) Interrupt Request 3 Clear Register                     */
    
    struct {
      __O  uint32_t  EIR2C      :  1;               /*!< [0..0] Error Interrupt Flag for SSC2                                  */
      __O  uint32_t  TIR2C      :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC2                               */
      __O  uint32_t  RIR2C      :  1;               /*!< [2..2] Receive Interrupt Flag for SSC2                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON3CLR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50005198) Interrupt Request 4 Clear Register                     */
    
    struct {
      __O  uint32_t  CCU6SR0C   :  1;               /*!< [0..0] Interrupt Flag 1 for CCU6                                      */
           uint32_t             :  3;
      __O  uint32_t  CCU6SR1C   :  1;               /*!< [4..4] Interrupt Flag 1 for CCU6                                      */
           uint32_t             : 11;
      __O  uint32_t  CCU6SR2C   :  1;               /*!< [16..16] Interrupt Flag 1 for CCU6                                    */
           uint32_t             :  3;
      __O  uint32_t  CCU6SR3C   :  1;               /*!< [20..20] Interrupt Flag 1 for CCU6                                    */
    } bit;                                          /*!< [21] BitSize                                                          */
  } IRCON4CLR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5000519C) Interrupt Request 5 Clear Register                     */
    
