zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __O  uint32_t  WAKEUPC    :  1;               /*!< [0..0] Clear Flag for Wakeup Interrupt                                */
    } bit;                                          /*!< [1] BitSize                                                           */
  } IRCON5CLR;
} SCU_Type;


/* ================================================================================ */
/* ================                      SCUPM                     ================ */
/* ================================================================================ */


/**
  * @brief SCUPM (SCUPM)
  */

typedef struct {                                    /*!< (@ 0x50006000) SCUPM Structure                                        */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006000) Analog Module Clock Frequency Status Register          */
    
    struct {
      __I  uint32_t  AMCLK1_FREQ:  6;               /*!< [0..5] Current frequency of Analog Module Clock System Clock
                                                         (MI_CLK)                                                              */
           uint32_t             :  2;
      __I  uint32_t  AMCLK2_FREQ:  6;               /*!< [8..13] Current frequency of Analog Module Clock 2 (TFILT_CLK)        */
    } bit;                                          /*!< [14] BitSize                                                          */
  } AMCLK_FREQ_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006004) Analog Module Clock Control Register                   */
    
    struct {
      __IO uint32_t  CLKWDT_PD_N:  1;               /*!< [0..0] Clock Watchdog Powerdown                                       */
    } bit;                                          /*!< [1] BitSize                                                           */
  } AMCLK_CTRL;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000600C) Analog Module Clock Limit Register                     */
    
    struct {
      __IO uint32_t  AMCLK1_UP_TH:  6;              /*!< [0..5] Analog Module Clock 1 (MI_CLK) Upper Limit Threshold           */
      __IO uint32_t  AMCLK1_UP_HYS:  2;             /*!< [6..7] Analog Module Clock 1 (MI_CLK) Upper Hysteresis                */
      __IO uint32_t  AMCLK1_LOW_TH:  6;             /*!< [8..13] Analog Module Clock 1 (MI_CLK) Lower Limit Threshold          */
      __IO uint32_t  AMCLK1_LOW_HYS:  2;            /*!< [14..15] Analog Module Clock 1 (MI_CLK) Lower Hysteresis              */
      __IO uint32_t  AMCLK2_UP_TH:  6;              /*!< [16..21] Analog Module Clock 2 (TFILT_CLK) Upper Limit Threshold      */
      __IO uint32_t  AMCLK2_UP_HYS:  2;             /*!< [22..23] Analog Module Clock 2 (TFILT_CLK) Upper Hysteresis           */
      __IO uint32_t  AMCLK2_LOW_TH:  6;             /*!< [24..29] Analog Module Clock 2 (TFILT_CLK) Lower Limit Threshold      */
      __IO uint32_t  AMCLK2_LOW_HYS:  2;            /*!< [30..31] Analog Module Clock 2 (TFILT_CLK) Lower Hysteresis           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } AMCLK_TH_HYS;
  __I  uint32_t  RESERVED1;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006014) System Interrupt Status Clear Register                 */
    
    struct {
           uint32_t             :  8;
      __O  uint32_t  SYS_OTWARN_ISC:  1;            /*!< [8..8] System Overtemperature Prewarning status clear                 */
      __O  uint32_t  SYS_OT_ISC :  1;               /*!< [9..9] System Overtemperature Shutdown status clear                   */
      __O  uint32_t  REFBG_LOTHWARN_ISC:  1;        /*!< [10..10] 8-Bit ADC2 Reference Undervoltage interrupt status
                                                         clear                                                                 */
      __O  uint32_t  REFBG_UPTHWARN_ISC:  1;        /*!< [11..11] 8-Bit ADC2 Reference Overvoltage interrupt status clear      */
           uint32_t             : 12;
      __O  uint32_t  SYS_OTWARN_SC:  1;             /*!< [24..24] System Overtemperature Prewarning status clear               */
      __O  uint32_t  SYS_OT_SC  :  1;               /*!< [25..25] System Overtemperature Shutdown status clear                 */
    } bit;                                          /*!< [26] BitSize                                                          */
  } SYS_ISCLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006018) System Interrupt Status Register                       */
    
    struct {
      __I  uint32_t  LS1_FAIL_IS:  1;               /*!< [0..0] Low Side Driver 1 Fail Interrupt Status                        */
      __I  uint32_t  LS2_FAIL_IS:  1;               /*!< [1..1] Low Side Driver 2 Fail Interrupt Status                        */
      __I  uint32_t  HS1_FAIL_IS:  1;               /*!< [2..2] High Side Driver 1 Fail Interrupt Status                       */
      __I  uint32_t  HS2_FAIL_IS:  1;               /*!< [3..3] High Side Driver 2 Fail Interrupt Status                       */
           uint32_t             :  2;
      __I  uint32_t  LIN_FAIL_IS:  1;               /*!< [6..6] LIN Fail Interrupt Status                                      */
           uint32_t             :  1;
      __IO uint32_t  SYS_OTWARN_IS:  1;             /*!< [8..8] System Overtemperature Prewarning (ADC2, Channel 6) interrupt
                                                         status                                                                */
      __IO uint32_t  SYS_OT_IS  :  1;               /*!< [9..9] System Overtemperature Shutdown (ADC2, Channel 6) interrupt
                                                         status                                                                */
      __IO uint32_t  REFBG_LOTHWARN_IS:  1;         /*!< [10..10] 8-Bit ADC2 Reference Undervoltage (ADC2, Channel 4)
                                                         interrupt status                                                      */
      __IO uint32_t  REFBG_UPTHWARN_IS:  1;         /*!< [11..11] 8-Bit ADC2 Reference Overvoltage (ADC2, Channel 4)
                                                         interrupt status                                                      */
      __I  uint32_t  SYS_SUPPLY_IS:  1;             /*!< [12..12] System Supply Interrupt Status                               */
           uint32_t             :  3;
      __I  uint32_t  LS1_FAIL_STS:  1;              /*!< [16..16] Low Side Driver 1 Fail Status                                */
      __I  uint32_t  LS2_FAIL_STS:  1;              /*!< [17..17] Low Side Driver 2 Fail Status                                */
      __I  uint32_t  HS1_FAIL_STS:  1;              /*!< [18..18] High Side Driver 1 Fail Status                               */
      __I  uint32_t  HS2_FAIL_STS:  1;              /*!< [19..19] High Side Driver 2 Fail Status                               */
           uint32_t             :  2;
      __I  uint32_t  LIN_FAIL_STS:  1;              /*!< [22..22] LIN Fail Status                                              */
           uint32_t             :  1;
      __IO uint32_t  SYS_OTWARN_STS:  1;            /*!< [24..24] System Overtemperature Prewarning (ADC2, Channel 6)
                                                         status                                                                */
      __IO uint32_t  SYS_OT_STS :  1;               /*!< [25..25] System Overtemperature Shutdown (ADC2, Channel 6) status     */
           uint32_t             :  2;
      __I  uint32_t  SYS_SUPPLY_STS:  1;            /*!< [28..28] System Supply Status                                         */
    } bit;                                          /*!< [29] BitSize                                                          */
  } SYS_IS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000601C) System Supply Interrupt Status Register                */
    
