zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  VBAT_UV_IS :  1;               /*!< [0..0] VBAT Undervoltage Interrupt Status (ADC2 channel 0)            */
      __IO uint32_t  VS_UV_IS   :  1;               /*!< [1..1] VS Undervoltage Interrupt Status (ADC2 channel 1)              */
      __IO uint32_t  VDD5V_UV_IS:  1;               /*!< [2..2] VDDP Undervoltage Interrupt Status (ADC2 channel 2)            */
      __IO uint32_t  VDD1V5_UV_IS:  1;              /*!< [3..3] VDDC Undervoltage Interrupt Status (ADC2 channel 3)            */
      __IO uint32_t  VDDEXT_UV_IS:  1;              /*!< [4..4] VDDEXT Undervoltage Interrupt Status (ADC2 channel 2)          */
      __IO uint32_t  VBAT_OV_IS :  1;               /*!< [5..5] VBAT Overvoltage Interrupt Status (ADC2 channel 0)             */
      __IO uint32_t  VS_OV_IS   :  1;               /*!< [6..6] VS Overvoltage Interrupt Status (ADC2 channel 1)               */
      __IO uint32_t  VDD5V_OV_IS:  1;               /*!< [7..7] VDDP Overvoltage Interrupt Status (ADC2 channel 2)             */
      __IO uint32_t  VDD1V5_OV_IS:  1;              /*!< [8..8] VDDC Overvoltage Interrupt Status (ADC2 channel 3)             */
      __IO uint32_t  VDDEXT_OV_IS:  1;              /*!< [9..9] VDDEXT Overvoltage Interrupt Status (ADC2 channel 2)           */
           uint32_t             :  6;
      __IO uint32_t  VBAT_UV_STS:  1;               /*!< [16..16] VBAT Undervoltage Status                                     */
      __IO uint32_t  VS_UV_STS  :  1;               /*!< [17..17] VS Undervoltage Status                                       */
      __IO uint32_t  VDD5V_UV_STS:  1;              /*!< [18..18] VDDP Undervoltage Status                                     */
      __IO uint32_t  VDD1V5_UV_STS:  1;             /*!< [19..19] VDDC Undervoltage Status                                     */
      __IO uint32_t  VDDEXT_UV_STS:  1;             /*!< [20..20] VDDEXT Undervoltage Status                                   */
      __IO uint32_t  VBAT_OV_STS:  1;               /*!< [21..21] VBAT Overvoltage Status                                      */
      __IO uint32_t  VS_OV_STS  :  1;               /*!< [22..22] VS Overvoltage Interrupt Status                              */
      __IO uint32_t  VDD5V_OV_STS:  1;              /*!< [23..23] VDDP Overvoltage Status                                      */
      __IO uint32_t  VDD1V5_OV_STS:  1;             /*!< [24..24] VDDC Overvoltage Status                                      */
      __IO uint32_t  VDDEXT_OV_STS:  1;             /*!< [25..25] VDDEXT Overvoltage Status                                    */
    } bit;                                          /*!< [26] BitSize                                                          */
  } SYS_SUPPLY_IRQ_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006020) System Supply Interrupt Control Register               */
    
    struct {
      __IO uint32_t  VBAT_UV_IE :  1;               /*!< [0..0] VBAT Undervoltage Interrupt Enable                             */
      __IO uint32_t  VS_UV_IE   :  1;               /*!< [1..1] VS Undervoltage Interrupt Enable                               */
      __IO uint32_t  VDD5V_UV_IE:  1;               /*!< [2..2] VDDP Undervoltage Interrupt Enable                             */
      __IO uint32_t  VDD1V5_UV_IE:  1;              /*!< [3..3] VDDC Undervoltage Interrupt Enable                             */
      __IO uint32_t  VDDEXT_UV_IE:  1;              /*!< [4..4] VDDEXT Undervoltage Interrupt Enable                           */
      __IO uint32_t  VBAT_OV_IE :  1;               /*!< [5..5] VBAT Overvoltage Interrupt Enable                              */
      __IO uint32_t  VS_OV_IE   :  1;               /*!< [6..6] VS Overvoltage Interrupt Enable                                */
      __IO uint32_t  VDD5V_OV_IE:  1;               /*!< [7..7] VDDP Overvoltage Interrupt Enable                              */
      __IO uint32_t  VDD1V5_OV_IE:  1;              /*!< [8..8] VDDC Overvoltage Interrupt Enable                              */
      __IO uint32_t  VDDEXT_OV_IE:  1;              /*!< [9..9] VDDEXT Overvoltage Interrupt Enable                            */
    } bit;                                          /*!< [10] BitSize                                                          */
  } SYS_SUPPLY_IRQ_CTRL;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006024) System Supply Interrupt Status Clear Register          */
    
    struct {
      __O  uint32_t  VBAT_UV_ISC:  1;               /*!< [0..0] VBAT Undervoltage Interrupt Status clear                       */
      __O  uint32_t  VS_UV_ISC  :  1;               /*!< [1..1] VS Undervoltage Interrupt Status clear                         */
      __O  uint32_t  VDD5V_UV_ISC:  1;              /*!< [2..2] VDDP Undervoltage Interrupt Status clear                       */
      __O  uint32_t  VDD1V5_UV_ISC:  1;             /*!< [3..3] VDDC Undervoltage Interrupt Status clear                       */
      __O  uint32_t  VDDEXT_UV_ISC:  1;             /*!< [4..4] VDDEXT Undervoltage Interrupt Status clear                     */
      __O  uint32_t  VBAT_OV_ISC:  1;               /*!< [5..5] VBAT Overvoltage Interrupt Status clear                        */
      __O  uint32_t  VS_OV_ISC  :  1;               /*!< [6..6] VS Overvoltage Interrupt Status clear                          */
      __O  uint32_t  VDD5V_OV_ISC:  1;              /*!< [7..7] VDDP Overvoltage Interrupt Status clear                        */
      __O  uint32_t  VDD1V5_OV_ISC:  1;             /*!< [8..8] VDDC Overvoltage Interrupt Status clear                        */
      __O  uint32_t  VDDEXT_OV_ISC:  1;             /*!< [9..9] VDDEXT Overvoltage Interrupt Status clear                      */
           uint32_t             :  6;
      __O  uint32_t  VBAT_UV_SC :  1;               /*!< [16..16] VBAT Undervoltage Status clear                               */
      __O  uint32_t  VS_UV_SC   :  1;               /*!< [17..17] VS Undervoltage Status clear                                 */
      __O  uint32_t  VDD5V_UV_SC:  1;               /*!< [18..18] VDDP Undervoltage Status clear                               */
      __O  uint32_t  VDD1V5_UV_SC:  1;              /*!< [19..19] VDDC Undervoltage Status clear                               */
      __O  uint32_t  VDDEXT_UV_SC:  1;              /*!< [20..20] VDDEXT Undervoltage Status clear                             */
      __O  uint32_t  VBAT_OV_SC :  1;               /*!< [21..21] VBAT Overvoltage Status clear                                */
      __O  uint32_t  VS_OV_SC   :  1;               /*!< [22..22] VS Overvoltage Interrupt Status clear                        */
      __O  uint32_t  VDD5V_OV_SC:  1;               /*!< [23..23] VDDP Overvoltage Status clear                                */
      __O  uint32_t  VDD1V5_OV_SC:  1;              /*!< [24..24] VDDC Overvoltage Status clear                                */
      __O  uint32_t  VDDEXT_OV_SC:  1;              /*!< [25..25] VDDEXT Overvoltage Status clear                              */
    } bit;                                          /*!< [26] BitSize                                                          */
  } SYS_SUPPLY_IRQ_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006028) System Interrupt Control Register                      */
    
