zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
           uint32_t             :  8;
      __IO uint32_t  SYS_OTWARN_IE:  1;             /*!< [8..8] System Overtemperature Warning Interrupt Enable                */
      __IO uint32_t  SYS_OT_IE  :  1;               /*!< [9..9] System Overtemperature Shutdown Interrupt Enable (leads
                                                         to shutdown of System)                                                */
      __IO uint32_t  REFBG_LOTHWARN_IE:  1;         /*!< [10..10] Reference Voltage Undervoltage Interrupt Enable              */
      __IO uint32_t  REFBG_UPTHWARN_IE:  1;         /*!< [11..11] Reference Voltage Overvoltage Interrupt Enable               */
    } bit;                                          /*!< [12] BitSize                                                          */
  } SYS_IRQ_CTRL;
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006030) Power Control Unit Control Status Register             */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  CLKWDT_SD_DIS:  1;             /*!< [1..1] Power Modules Clock Watchdog Shutdown Disable                  */
           uint32_t             :  6;
      __IO uint32_t  LIN_VS_UV_SD_DIS:  1;          /*!< [8..8] LIN Module VS Undervoltage Transmitter Shutdown                */
    } bit;                                          /*!< [9] BitSize                                                           */
  } PCU_CTRL_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006034) WDT1 Watchdog Control                                  */
    
    struct {
      __IO uint32_t  WDP_SEL    :  6;               /*!< [0..5] Watchdog Period Selection and trigger                          */
      __IO uint32_t  SOWCONF    :  2;               /*!< [6..7] Short Open Window Configuration                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDT1_TRIG;
  __I  uint32_t  RESERVED3[13];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000606C) System Tick Calibration Register                       */
    
    struct {
      __IO uint32_t  STCALIB    : 26;               /*!< [0..25] System Tick Calibration                                       */
    } bit;                                          /*!< [26] BitSize                                                          */
  } STCALIB;
  __I  uint32_t  RESERVED4[8];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006090) Package Configuration Register 1                       */
    
    struct {
           uint32_t             :  8;
      __I  uint32_t  HS2EN      :  1;               /*!< [8..8] High Side 2 Enable                                             */
    } bit;                                          /*!< [9] BitSize                                                           */
  } PKGCFG1;
} SCUPM_Type;


/* ================================================================================ */
/* ================                      SSCx                      ================ */
/* ================================================================================ */


/**
  * @brief SSCx (SSCx)
  */

typedef struct {                                    /*!< (@ 0x48024000) SSC1 Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48024000) Port Input Select Register                             */
    
    struct {
      __IO uint32_t  MIS_0      :  1;               /*!< [0..0] Master Mode Input Select Bit 0 (Master Mode only)              */
      __IO uint32_t  SIS        :  1;               /*!< [1..1] Slave Mode Input Select (Slave Mode only)                      */
      __IO uint32_t  CIS        :  1;               /*!< [2..2] Clock Input Select (Slave Mode only)                           */
      __IO uint32_t  MIS_1      :  1;               /*!< [3..3] Master Mode Input Select Bit 1 (Master Mode only)              */
    } bit;                                          /*!< [4] BitSize                                                           */
  } PISEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48024004) Control Register                                       */
    
    struct {
      __IO uint32_t  BM         :  4;               /*!< [0..3] Data Width Selection                                           */
      __IO uint32_t  HB         :  1;               /*!< [4..4] Heading Control                                                */
      __IO uint32_t  PH         :  1;               /*!< [5..5] Clock Phase Control                                            */
      __IO uint32_t  PO         :  1;               /*!< [6..6] Clock Polarity Control                                         */
      __IO uint32_t  LB         :  1;               /*!< [7..7] Loop Back Control                                              */
      __IO uint32_t  TEN        :  1;               /*!< [8..8] Transmit Error Enable                                          */
      __IO uint32_t  REN        :  1;               /*!< [9..9] Receive Error Enable                                           */
      __IO uint32_t  PEN        :  1;               /*!< [10..10] Phase Error Enable                                           */
      __IO uint32_t  BEN        :  1;               /*!< [11..11] Baud Rate Error Enable                                       */
      __IO uint32_t  AREN       :  1;               /*!< [12..12] Automatic Reset Enable                                       */
           uint32_t             :  1;
      __IO uint32_t  MS         :  1;               /*!< [14..14] Master Select                                                */
      __IO uint32_t  EN         :  1;               /*!< [15..15] Enable Bit                                                   */
      __I  uint32_t  BC         :  4;               /*!< [16..19] Bit Count Field                                              */
           uint32_t             :  4;
      __I  uint32_t  TE         :  1;               /*!< [24..24] Transmit Error Flag                                          */
      __I  uint32_t  RE         :  1;               /*!< [25..25] Receive Error Flag                                           */
      __I  uint32_t  PE         :  1;               /*!< [26..26] Phase Error Flag                                             */
      __I  uint32_t  BE         :  1;               /*!< [27..27] Baud Rate Error Flag                                         */
      __I  uint32_t  BSY        :  1;               /*!< [28..28] Busy Flag                                                    */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48024008) Transmitter Buffer Register                            */
    
