zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  TB_VALUE   : 16;               /*!< [0..15] Transmit Data Register Value                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TB;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4802400C) Receiver Buffer Register                               */
    
    struct {
      __I  uint32_t  RB_VALUE   : 16;               /*!< [0..15] Receive Data Register Value                                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } RB;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48024010) Baud Rate Timer Reload Register                        */
    
    struct {
      __IO uint32_t  BR_VALUE   : 16;               /*!< [0..15] Baud Rate Timer/Reload Register Value                         */
    } bit;                                          /*!< [16] BitSize                                                          */
  } BR;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x48024014) Interrupt Status Register Clear                        */
    
    struct {
           uint32_t             :  8;
      __O  uint32_t  TECLR      :  1;               /*!< [8..8] Transmit Error Flag Clear                                      */
      __O  uint32_t  RECLR      :  1;               /*!< [9..9] Receive Error Flag Clear                                       */
      __O  uint32_t  PECLR      :  1;               /*!< [10..10] Phase Error Flag Clear                                       */
      __O  uint32_t  BECLR      :  1;               /*!< [11..11] Baud Rate Error Flag Clear                                   */
    } bit;                                          /*!< [12] BitSize                                                          */
  } ISRCLR;
} SSCx_Type;




/* ================================================================================ */
/* ================                     TIMER2x                     ================ */
/* ================================================================================ */


/**
  * @brief TIMER2x (TIMER2x)
  */

typedef struct {                                    /*!< (@ 0x48004000) TIMER2 Structure                                       */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48004000) Timer 2 Control Register                               */
    
    struct {
      __IO uint32_t  CP_RL2     :  1;               /*!< [0..0] Capture/Reload Select                                          */
      __IO uint32_t  C_T2       :  1;               /*!< [1..1] Timer or Counter Select                                        */
      __IO uint32_t  TR2        :  1;               /*!< [2..2] Timer 2 Start/Stop Control                                     */
      __IO uint32_t  EXEN2      :  1;               /*!< [3..3] Timer 2 External Enable Control                                */
           uint32_t             :  2;
      __I  uint32_t  EXF2       :  1;               /*!< [6..6] Timer 2 External Flag                                          */
      __I  uint32_t  TF2        :  1;               /*!< [7..7] Timer 2 Overflow/Underflow Flag                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48004004) Timer 2 Mode Register                                  */
    
    struct {
      __IO uint32_t  DCEN       :  1;               /*!< [0..0] Up/Down Counter Enable                                         */
      __IO uint32_t  T2PRE      :  3;               /*!< [1..3] Timer 2 Prescaler Bit                                          */
      __IO uint32_t  PREN       :  1;               /*!< [4..4] Prescaler Enable                                               */
      __IO uint32_t  EDGESEL    :  1;               /*!< [5..5] Edge Select in Capture Mode/Reload Mode                        */
      __IO uint32_t  T2RHEN     :  1;               /*!< [6..6] Timer 2 External Start Enable                                  */
      __IO uint32_t  T2REGS     :  1;               /*!< [7..7] Edge Select for Timer 2 External Start                         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MOD;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48004008) Timer 2 Reload/Capture Register                        */
    
    struct {
      __IO uint32_t  RCL2       :  8;               /*!< [0..7] Reload/Capture Value                                           */
      __IO uint32_t  RCH2       :  8;               /*!< [8..15] Reload/Capture Value                                          */
    } bit;                                          /*!< [16] BitSize                                                          */
  } RC;
  __I  uint32_t  RESERVED;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48004010) Timer 2 Count Register                                 */
    
    struct {
      __IO uint32_t  T2L        :  8;               /*!< [0..7] Timer 2 Value                                                  */
      __IO uint32_t  T2H        :  8;               /*!< [8..15] Timer 2 Value                                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CNT;
  __I  uint32_t  RESERVED1;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x48004018) Timer 2 Interrupt Clear Register                       */
    
    struct {
           uint32_t             :  6;
      __O  uint32_t  EXF2CLR    :  1;               /*!< [6..6] External Interrupt Clear Flag                                  */
      __O  uint32_t  TF2CLR     :  1;               /*!< [7..7] Overflow/Underflow Interrupt Clear Flag                        */
    } bit;                                          /*!< [8] BitSize                                                           */
  } ICLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4800401C) Timer 2 Control Register 1                             */
    
