zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
    struct {
      __IO uint32_t  EXF2EN     :  1;               /*!< [0..0] External Interrupt Enable                                      */
      __IO uint32_t  TF2EN      :  1;               /*!< [1..1] Overflow/Underflow Interrupt Enable                            */
    } bit;                                          /*!< [2] BitSize                                                           */
  } CON1;
} TIMER2x_Type;


/* ================================================================================ */
/* ================                      UARTx                     ================ */
/* ================================================================================ */


/**
  * @brief UARTx (UARTx)
  */

typedef struct {                                    /*!< (@ 0x48020000) UART1 Structure                                        */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48020000) Serial Channel Control Register                        */
    
    struct {
      __IO uint32_t  RI         :  1;               /*!< [0..0] Receive Interrupt Flag                                         */
      __IO uint32_t  TI         :  1;               /*!< [1..1] Transmit Interrupt Flag                                        */
      __IO uint32_t  RB8        :  1;               /*!< [2..2] Serial Port Receiver Bit 9                                     */
      __IO uint32_t  TB8        :  1;               /*!< [3..3] Serial Port Transmitter Bit 9                                  */
      __IO uint32_t  REN        :  1;               /*!< [4..4] Enable Receiver of Serial Port                                 */
      __IO uint32_t  SM2        :  1;               /*!< [5..5] Enable Serial Port Multiprocessor Communication in Modes
                                                         2 and 3                                                               */
      __IO uint32_t  SM1        :  1;               /*!< [6..6] Serial Port Operating Mode Selection                           */
      __IO uint32_t  SM0        :  1;               /*!< [7..7] Serial Port Operating Mode Selection                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SCON;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48020004) Serial Data Buffer                                     */
    
    struct {
      __IO uint32_t  VAL        :  8;               /*!< [0..7] Serial Interface Buffer Register                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SBUF;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x48020008) Serial Channel Control Clear Register                  */
    
    struct {
      __O  uint32_t  RICLR      :  1;               /*!< [0..0] SCON.RI Clear Flag                                             */
      __O  uint32_t  TICLR      :  1;               /*!< [1..1] SCON.TI Clear Flag                                             */
      __O  uint32_t  RB8CLR     :  1;               /*!< [2..2] SCON.RB8 Clear Flag                                            */
    } bit;                                          /*!< [3] BitSize                                                           */
  } SCONCLR;
} UARTx_Type;




/* --------------------  End of section using anonymous unions  ------------------- */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ADC1_BASE                       0x40004000UL
#define ADC2_BASE                       0x4801C000UL
#define CCU6_BASE                       0x4000C000UL
#define CPU_BASE                        0xE000E000UL
#define GPT12E_BASE                     0x40010000UL
#define HS_BASE                         0x40024000UL
#define LIN_BASE                        0x4801E000UL
#define LS_BASE                         0x4001C000UL
#define MF_BASE                         0x48018000UL
#define PMU_BASE                        0x50004000UL
#define PORT_BASE                       0x48028000UL
#define SCU_BASE                        0x50005000UL
#define SCUPM_BASE                      0x50006000UL
#define SSC1_BASE                       0x48024000UL
#define SSC2_BASE                       0x48026000UL
#define TIMER2_BASE                     0x48004000UL
#define TIMER21_BASE                    0x48005000UL
#define UART1_BASE                      0x48020000UL
#define UART2_BASE                      0x48022000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define ADC1                            ((ADC1_Type               *) ADC1_BASE)
#define ADC2                            ((ADC2_Type               *) ADC2_BASE)
#define CCU6                            ((CCU6_Type               *) CCU6_BASE)
#define CPU                             ((CPU_Type                *) CPU_BASE)
#define GPT12E                          ((GPT12E_Type             *) GPT12E_BASE)
#define HS                              ((HS_Type                 *) HS_BASE)
#define LIN                             ((LIN_Type                *) LIN_BASE)
#define LS                              ((LS_Type                 *) LS_BASE)
#define MF                              ((MF_Type                 *) MF_BASE)
#define PMU                             ((PMU_Type                *) PMU_BASE)
#define PORT                            ((PORT_Type               *) PORT_BASE)
#define SCU                             ((SCU_Type                *) SCU_BASE)
#define SCUPM                           ((SCUPM_Type              *) SCUPM_BASE)
#define SSC1                            ((SSCx_Type               *) SSC1_BASE)
#define SSC2                            ((SSCx_Type               *) SSC2_BASE)
#define TIMER2                          ((TIMER2x_Type             *) TIMER2_BASE)
#define TIMER21                         ((TIMER2x_Type            *) TIMER21_BASE)
#define UART1                           ((UARTx_Type              *) UART1_BASE)
#define UART2                           ((UARTx_Type              *) UART2_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */

