zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* =======================================================  CTRL_STS  ======================================================== */
#define ADC1_CTRL_STS_STRTUP_DIS_Pos      (18UL)                    /*!< ADC1 CTRL_STS: STRTUP_DIS (Bit 18)                    */
#define ADC1_CTRL_STS_STRTUP_DIS_Msk      (0x40000UL)               /*!< ADC1 CTRL_STS: STRTUP_DIS (Bitfield-Mask: 0x01)       */
#define ADC1_CTRL_STS_SW_CH_SEL_Pos       (8UL)                     /*!< ADC1 CTRL_STS: SW_CH_SEL (Bit 8)                      */
#define ADC1_CTRL_STS_SW_CH_SEL_Msk       (0xf00UL)                 /*!< ADC1 CTRL_STS: SW_CH_SEL (Bitfield-Mask: 0x0f)        */
#define ADC1_CTRL_STS_EOC_Pos             (7UL)                     /*!< ADC1 CTRL_STS: EOC (Bit 7)                            */
#define ADC1_CTRL_STS_EOC_Msk             (0x80UL)                  /*!< ADC1 CTRL_STS: EOC (Bitfield-Mask: 0x01)              */
#define ADC1_CTRL_STS_CAL_SIGN_Pos        (5UL)                     /*!< ADC1 CTRL_STS: CAL_SIGN (Bit 5)                       */
#define ADC1_CTRL_STS_CAL_SIGN_Msk        (0x20UL)                  /*!< ADC1 CTRL_STS: CAL_SIGN (Bitfield-Mask: 0x01)         */
#define ADC1_CTRL_STS_READY_Pos           (4UL)                     /*!< ADC1 CTRL_STS: READY (Bit 4)                          */
#define ADC1_CTRL_STS_READY_Msk           (0x10UL)                  /*!< ADC1 CTRL_STS: READY (Bitfield-Mask: 0x01)            */
#define ADC1_CTRL_STS_SOS_Pos             (2UL)                     /*!< ADC1 CTRL_STS: SOS (Bit 2)                            */
#define ADC1_CTRL_STS_SOS_Msk             (0x4UL)                   /*!< ADC1 CTRL_STS: SOS (Bitfield-Mask: 0x01)              */
#define ADC1_CTRL_STS_SOOC_Pos            (1UL)                     /*!< ADC1 CTRL_STS: SOOC (Bit 1)                           */
#define ADC1_CTRL_STS_SOOC_Msk            (0x2UL)                   /*!< ADC1 CTRL_STS: SOOC (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL_STS_PD_N_Pos            (0UL)                     /*!< ADC1 CTRL_STS: PD_N (Bit 0)                           */
#define ADC1_CTRL_STS_PD_N_Msk            (0x1UL)                   /*!< ADC1 CTRL_STS: PD_N (Bitfield-Mask: 0x01)             */
/* ========================================================  STATUS  ========================================================= */
#define ADC1_STATUS_SD_FEEDB_ON_Pos       (31UL)                    /*!< ADC1 STATUS: SD_FEEDB_ON (Bit 31)                     */
#define ADC1_STATUS_SD_FEEDB_ON_Msk       (0x80000000UL)            /*!< ADC1 STATUS: SD_FEEDB_ON (Bitfield-Mask: 0x01)        */
#define ADC1_STATUS_SOC_JITTER_Pos        (16UL)                    /*!< ADC1 STATUS: SOC_JITTER (Bit 16)                      */
#define ADC1_STATUS_SOC_JITTER_Msk        (0x30000UL)               /*!< ADC1 STATUS: SOC_JITTER (Bitfield-Mask: 0x03)         */
#define ADC1_STATUS_DAC_IN_Pos            (0UL)                     /*!< ADC1 STATUS: DAC_IN (Bit 0)                           */
#define ADC1_STATUS_DAC_IN_Msk            (0x7UL)                   /*!< ADC1 STATUS: DAC_IN (Bitfield-Mask: 0x07)             */
/* =========================================================  CTRL2  ========================================================= */
#define ADC1_CTRL2_CAL_EN_Pos             (0UL)                     /*!< ADC1 CTRL2: CAL_EN (Bit 0)                            */
#define ADC1_CTRL2_CAL_EN_Msk             (0xfffUL)                 /*!< ADC1 CTRL2: CAL_EN (Bitfield-Mask: 0xfff)             */
/* =========================================================  CTRL3  ========================================================= */
#define ADC1_CTRL3_SAMPLE_TIME_LVCH_Pos   (16UL)                    /*!< ADC1 CTRL3: SAMPLE_TIME_LVCH (Bit 16)                 */
#define ADC1_CTRL3_SAMPLE_TIME_LVCH_Msk   (0xf0000UL)               /*!< ADC1 CTRL3: SAMPLE_TIME_LVCH (Bitfield-Mask: 0x0f)    */
#define ADC1_CTRL3_SAMPLE_TIME_HVCH_Pos   (8UL)                     /*!< ADC1 CTRL3: SAMPLE_TIME_HVCH (Bit 8)                  */
#define ADC1_CTRL3_SAMPLE_TIME_HVCH_Msk   (0xf00UL)                 /*!< ADC1 CTRL3: SAMPLE_TIME_HVCH (Bitfield-Mask: 0x0f)    */
#define ADC1_CTRL3_MCM_RDY_Pos            (7UL)                     /*!< ADC1 CTRL3: MCM_RDY (Bit 7)                           */
#define ADC1_CTRL3_MCM_RDY_Msk            (0x80UL)                  /*!< ADC1 CTRL3: MCM_RDY (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL3_EoC_FAIL_Pos           (6UL)                     /*!< ADC1 CTRL3: EoC_FAIL (Bit 6)                          */
#define ADC1_CTRL3_EoC_FAIL_Msk           (0x40UL)                  /*!< ADC1 CTRL3: EoC_FAIL (Bitfield-Mask: 0x01)            */
#define ADC1_CTRL3_EoC_FAIL_CLR_Pos       (4UL)                     /*!< ADC1 CTRL3: EoC_FAIL_CLR (Bit 4)                      */
#define ADC1_CTRL3_EoC_FAIL_CLR_Msk       (0x10UL)                  /*!< ADC1 CTRL3: EoC_FAIL_CLR (Bitfield-Mask: 0x01)        */
#define ADC1_CTRL3_SW_MODE_Pos            (1UL)                     /*!< ADC1 CTRL3: SW_MODE (Bit 1)                           */
#define ADC1_CTRL3_SW_MODE_Msk            (0x2UL)                   /*!< ADC1 CTRL3: SW_MODE (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL3_MCM_PD_N_Pos           (0UL)                     /*!< ADC1 CTRL3: MCM_PD_N (Bit 0)                          */
#define ADC1_CTRL3_MCM_PD_N_Msk           (0x1UL)                   /*!< ADC1 CTRL3: MCM_PD_N (Bitfield-Mask: 0x01)            */
/* =========================================================  CTRL4  ========================================================= */
#define ADC1_CTRL4_MAX_CALTIME_Pos        (0UL)                     /*!< ADC1 CTRL4: MAX_CALTIME (Bit 0)                       */
#define ADC1_CTRL4_MAX_CALTIME_Msk        (0xfUL)                   /*!< ADC1 CTRL4: MAX_CALTIME (Bitfield-Mask: 0x0f)         */
/* =========================================================  CTRL5  ========================================================= */
#define ADC1_CTRL5_FILT_OUT_SEL_11_0_Pos  (0UL)                     /*!< ADC1 CTRL5: FILT_OUT_SEL_11_0 (Bit 0)                 */
#define ADC1_CTRL5_FILT_OUT_SEL_11_0_Msk  (0xfffUL)                 /*!< ADC1 CTRL5: FILT_OUT_SEL_11_0 (Bitfield-Mask: 0xfff)  */
/* =========================================================  SQ0_1  ========================================================= */
#define ADC1_SQ0_1_SQ1_Pos                (16UL)                    /*!< ADC1 SQ0_1: SQ1 (Bit 16)                              */
#define ADC1_SQ0_1_SQ1_Msk                (0xfff0000UL)             /*!< ADC1 SQ0_1: SQ1 (Bitfield-Mask: 0xfff)                */
#define ADC1_SQ0_1_SQ0_Pos                (0UL)                     /*!< ADC1 SQ0_1: SQ0 (Bit 0)                               */
#define ADC1_SQ0_1_SQ0_Msk                (0xfffUL)                 /*!< ADC1 SQ0_1: SQ0 (Bitfield-Mask: 0xfff)                */
/* =========================================================  SQ2_3  ========================================================= */
#define ADC1_SQ2_3_SQ3_Pos                (16UL)                    /*!< ADC1 SQ2_3: SQ3 (Bit 16)                              */
#define ADC1_SQ2_3_SQ3_Msk                (0xfff0000UL)             /*!< ADC1 SQ2_3: SQ3 (Bitfield-Mask: 0xfff)                */
#define ADC1_SQ2_3_SQ2_Pos                (0UL)                     /*!< ADC1 SQ2_3: SQ2 (Bit 0)                               */
#define ADC1_SQ2_3_SQ2_Msk                (0xfffUL)                 /*!< ADC1 SQ2_3: SQ2 (Bitfield-Mask: 0xfff)                */
/* =========================================================  SQ4_5  ========================================================= */
#define ADC1_SQ4_5_SQ5_Pos                (16UL)                    /*!< ADC1 SQ4_5: SQ5 (Bit 16)                              */
#define ADC1_SQ4_5_SQ5_Msk                (0xfff0000UL)             /*!< ADC1 SQ4_5: SQ5 (Bitfield-Mask: 0xfff)                */
#define ADC1_SQ4_5_SQ4_Pos                (0UL)                     /*!< ADC1 SQ4_5: SQ4 (Bit 0)                               */
#define ADC1_SQ4_5_SQ4_Msk                (0xfffUL)                 /*!< ADC1 SQ4_5: SQ4 (Bitfield-Mask: 0xfff)                */
/* =========================================================  SQ6_7  ========================================================= */
#define ADC1_SQ6_7_SQ7_Pos                (16UL)                    /*!< ADC1 SQ6_7: SQ7 (Bit 16)                              */
#define ADC1_SQ6_7_SQ7_Msk                (0xfff0000UL)             /*!< ADC1 SQ6_7: SQ7 (Bitfield-Mask: 0xfff)                */
#define ADC1_SQ6_7_SQ6_Pos                (0UL)                     /*!< ADC1 SQ6_7: SQ6 (Bit 0)                               */
#define ADC1_SQ6_7_SQ6_Msk                (0xfffUL)                 /*!< ADC1 SQ6_7: SQ6 (Bitfield-Mask: 0xfff)                */
/* =========================================================  SQ8_9  ========================================================= */
#define ADC1_SQ8_9_SQ9_Pos                (16UL)                    /*!< ADC1 SQ8_9: SQ9 (Bit 16)                              */
#define ADC1_SQ8_9_SQ9_Msk                (0xfff0000UL)             /*!< ADC1 SQ8_9: SQ9 (Bitfield-Mask: 0xfff)                */
#define ADC1_SQ8_9_SQ8_Pos                (0UL)                     /*!< ADC1 SQ8_9: SQ8 (Bit 0)                               */
#define ADC1_SQ8_9_SQ8_Msk                (0xfffUL)                 /*!< ADC1 SQ8_9: SQ8 (Bitfield-Mask: 0xfff)                */
/* ========================================================  SQ10_11  ======================================================== */
#define ADC1_SQ10_11_SQ11_Pos             (16UL)                    /*!< ADC1 SQ10_11: SQ11 (Bit 16)                           */
#define ADC1_SQ10_11_SQ11_Msk             (0xfff0000UL)             /*!< ADC1 SQ10_11: SQ11 (Bitfield-Mask: 0xfff)             */
#define ADC1_SQ10_11_SQ10_Pos             (0UL)                     /*!< ADC1 SQ10_11: SQ10 (Bit 0)                            */
#define ADC1_SQ10_11_SQ10_Msk             (0xfffUL)                 /*!< ADC1 SQ10_11: SQ10 (Bitfield-Mask: 0xfff)             */
/* =========================================================  SQ_FB  ========================================================= */
#define ADC1_SQ_FB_CHx_Pos                (16UL)                    /*!< ADC1 SQ_FB: CHx (Bit 16)                              */
#define ADC1_SQ_FB_CHx_Msk                (0xf0000UL)               /*!< ADC1 SQ_FB: CHx (Bitfield-Mask: 0x0f)                 */
#define ADC1_SQ_FB_SQx_Pos                (11UL)                    /*!< ADC1 SQ_FB: SQx (Bit 11)                              */
#define ADC1_SQ_FB_SQx_Msk                (0x7800UL)                /*!< ADC1 SQ_FB: SQx (Bitfield-Mask: 0x0f)                 */
#define ADC1_SQ_FB_ESM_ACTIVE_Pos         (10UL)                    /*!< ADC1 SQ_FB: ESM_ACTIVE (Bit 10)                       */
#define ADC1_SQ_FB_ESM_ACTIVE_Msk         (0x400UL)                 /*!< ADC1 SQ_FB: ESM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC1_SQ_FB_EIM_ACTIVE_Pos         (9UL)                     /*!< ADC1 SQ_FB: EIM_ACTIVE (Bit 9)                        */
#define ADC1_SQ_FB_EIM_ACTIVE_Msk         (0x200UL)                 /*!< ADC1 SQ_FB: EIM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC1_SQ_FB_SQ_STOP_Pos            (8UL)                     /*!< ADC1 SQ_FB: SQ_STOP (Bit 8)                           */
#define ADC1_SQ_FB_SQ_STOP_Msk            (0x100UL)                 /*!< ADC1 SQ_FB: SQ_STOP (Bitfield-Mask: 0x01)             */
#define ADC1_SQ_FB_SQ_FB_Pos              (0UL)                     /*!< ADC1 SQ_FB: SQ_FB (Bit 0)                             */
#define ADC1_SQ_FB_SQ_FB_Msk              (0x1fUL)                  /*!< ADC1 SQ_FB: SQ_FB (Bitfield-Mask: 0x1f)               */
/* ========================================================  CHx_EIM  ======================================================== */
#define ADC1_CHx_EIM_ADC1_EIM_TRIG_SEL_Pos (16UL)                   /*!< ADC1 CHx_EIM: ADC1_EIM_TRIG_SEL (Bit 16)              */
#define ADC1_CHx_EIM_ADC1_EIM_TRIG_SEL_Msk (0x70000UL)              /*!< ADC1 CHx_EIM: ADC1_EIM_TRIG_SEL (Bitfield-Mask: 0x07) */
#define ADC1_CHx_EIM_EIM_EN_Pos           (11UL)                    /*!< ADC1 CHx_EIM: EIM_EN (Bit 11)                         */
#define ADC1_CHx_EIM_EIM_EN_Msk           (0x800UL)                 /*!< ADC1 CHx_EIM: EIM_EN (Bitfield-Mask: 0x01)            */
#define ADC1_CHx_EIM_EIM_REP_Pos          (8UL)                     /*!< ADC1 CHx_EIM: EIM_REP (Bit 8)                         */
#define ADC1_CHx_EIM_EIM_REP_Msk          (0x700UL)                 /*!< ADC1 CHx_EIM: EIM_REP (Bitfield-Mask: 0x07)           */
#define ADC1_CHx_EIM_EIM_CHx_Pos          (0UL)                     /*!< ADC1 CHx_EIM: EIM_CHx (Bit 0)                         */
#define ADC1_CHx_EIM_EIM_CHx_Msk          (0xfUL)                   /*!< ADC1 CHx_EIM: EIM_CHx (Bitfield-Mask: 0x0f)           */
/* ========================================================  CHx_ESM  ======================================================== */
#define ADC1_CHx_ESM_ESM_STS_Pos          (31UL)                    /*!< ADC1 CHx_ESM: ESM_STS (Bit 31)                        */
#define ADC1_CHx_ESM_ESM_STS_Msk          (0x80000000UL)            /*!< ADC1 CHx_ESM: ESM_STS (Bitfield-Mask: 0x01)           */
#define ADC1_CHx_ESM_ESM_EN_Pos           (30UL)                    /*!< ADC1 CHx_ESM: ESM_EN (Bit 30)                         */
#define ADC1_CHx_ESM_ESM_EN_Msk           (0x40000000UL)            /*!< ADC1 CHx_ESM: ESM_EN (Bitfield-Mask: 0x01)            */
#define ADC1_CHx_ESM_ADC1_ESM_TRIG_SEL_Pos (16UL)                   /*!< ADC1 CHx_ESM: ADC1_ESM_TRIG_SEL (Bit 16)              */
#define ADC1_CHx_ESM_ADC1_ESM_TRIG_SEL_Msk (0x70000UL)              /*!< ADC1 CHx_ESM: ADC1_ESM_TRIG_SEL (Bitfield-Mask: 0x07) */
#define ADC1_CHx_ESM_ESM_0_Pos            (0UL)                     /*!< ADC1 CHx_ESM: ESM_0 (Bit 0)                           */
#define ADC1_CHx_ESM_ESM_0_Msk            (0xfffUL)                 /*!< ADC1 CHx_ESM: ESM_0 (Bitfield-Mask: 0xfff)            */
/* =======================================================  MAX_TIME  ======================================================== */
#define ADC1_MAX_TIME_MAX_TIME_Pos        (0UL)                     /*!< ADC1 MAX_TIME: MAX_TIME (Bit 0)                       */
#define ADC1_MAX_TIME_MAX_TIME_Msk        (0xffUL)                  /*!< ADC1 MAX_TIME: MAX_TIME (Bitfield-Mask: 0xff)         */
/* =======================================================  CAL_CH0_1  ======================================================= */
#define ADC1_CAL_CH0_1_CALGAIN_CH1_Pos    (24UL)                    /*!< ADC1 CAL_CH0_1: CALGAIN_CH1 (Bit 24)                  */
#define ADC1_CAL_CH0_1_CALGAIN_CH1_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH0_1: CALGAIN_CH1 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH0_1_CALOFFS_CH1_Pos    (16UL)                    /*!< ADC1 CAL_CH0_1: CALOFFS_CH1 (Bit 16)                  */
#define ADC1_CAL_CH0_1_CALOFFS_CH1_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH0_1: CALOFFS_CH1 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH0_1_CALGAIN_CH0_Pos    (8UL)                     /*!< ADC1 CAL_CH0_1: CALGAIN_CH0 (Bit 8)                   */
#define ADC1_CAL_CH0_1_CALGAIN_CH0_Msk    (0xff00UL)                /*!< ADC1 CAL_CH0_1: CALGAIN_CH0 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH0_1_CALOFFS_CH0_Pos    (0UL)                     /*!< ADC1 CAL_CH0_1: CALOFFS_CH0 (Bit 0)                   */
#define ADC1_CAL_CH0_1_CALOFFS_CH0_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH0_1: CALOFFS_CH0 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH2_3  ======================================================= */
#define ADC1_CAL_CH2_3_CALGAIN_CH3_Pos    (24UL)                    /*!< ADC1 CAL_CH2_3: CALGAIN_CH3 (Bit 24)                  */
#define ADC1_CAL_CH2_3_CALGAIN_CH3_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH2_3: CALGAIN_CH3 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH2_3_CALOFFS_CH3_Pos    (16UL)                    /*!< ADC1 CAL_CH2_3: CALOFFS_CH3 (Bit 16)                  */
#define ADC1_CAL_CH2_3_CALOFFS_CH3_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH2_3: CALOFFS_CH3 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH2_3_CALGAIN_CH2_Pos    (8UL)                     /*!< ADC1 CAL_CH2_3: CALGAIN_CH2 (Bit 8)                   */
#define ADC1_CAL_CH2_3_CALGAIN_CH2_Msk    (0xff00UL)                /*!< ADC1 CAL_CH2_3: CALGAIN_CH2 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH2_3_CALOFFS_CH2_Pos    (0UL)                     /*!< ADC1 CAL_CH2_3: CALOFFS_CH2 (Bit 0)                   */
#define ADC1_CAL_CH2_3_CALOFFS_CH2_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH2_3: CALOFFS_CH2 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH4_5  ======================================================= */
#define ADC1_CAL_CH4_5_CALGAIN_CH5_Pos    (24UL)                    /*!< ADC1 CAL_CH4_5: CALGAIN_CH5 (Bit 24)                  */
#define ADC1_CAL_CH4_5_CALGAIN_CH5_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH4_5: CALGAIN_CH5 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH4_5_CALOFFS_CH5_Pos    (16UL)                    /*!< ADC1 CAL_CH4_5: CALOFFS_CH5 (Bit 16)                  */
#define ADC1_CAL_CH4_5_CALOFFS_CH5_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH4_5: CALOFFS_CH5 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH4_5_CALGAIN_CH4_Pos    (8UL)                     /*!< ADC1 CAL_CH4_5: CALGAIN_CH4 (Bit 8)                   */
#define ADC1_CAL_CH4_5_CALGAIN_CH4_Msk    (0xff00UL)                /*!< ADC1 CAL_CH4_5: CALGAIN_CH4 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH4_5_CALOFFS_CH4_Pos    (0UL)                     /*!< ADC1 CAL_CH4_5: CALOFFS_CH4 (Bit 0)                   */
#define ADC1_CAL_CH4_5_CALOFFS_CH4_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH4_5: CALOFFS_CH4 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH6_7  ======================================================= */
#define ADC1_CAL_CH6_7_CALGAIN_CH7_Pos    (24UL)                    /*!< ADC1 CAL_CH6_7: CALGAIN_CH7 (Bit 24)                  */
#define ADC1_CAL_CH6_7_CALGAIN_CH7_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH6_7: CALGAIN_CH7 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH6_7_CALOFFS_CH7_Pos    (16UL)                    /*!< ADC1 CAL_CH6_7: CALOFFS_CH7 (Bit 16)                  */
#define ADC1_CAL_CH6_7_CALOFFS_CH7_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH6_7: CALOFFS_CH7 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH6_7_CALGAIN_CH6_Pos    (8UL)                     /*!< ADC1 CAL_CH6_7: CALGAIN_CH6 (Bit 8)                   */
#define ADC1_CAL_CH6_7_CALGAIN_CH6_Msk    (0xff00UL)                /*!< ADC1 CAL_CH6_7: CALGAIN_CH6 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH6_7_CALOFFS_CH6_Pos    (0UL)                     /*!< ADC1 CAL_CH6_7: CALOFFS_CH6 (Bit 0)                   */
#define ADC1_CAL_CH6_7_CALOFFS_CH6_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH6_7: CALOFFS_CH6 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH8_9  ======================================================= */
#define ADC1_CAL_CH8_9_CALGAIN_CH9_Pos    (24UL)                    /*!< ADC1 CAL_CH8_9: CALGAIN_CH9 (Bit 24)                  */
#define ADC1_CAL_CH8_9_CALGAIN_CH9_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH8_9: CALGAIN_CH9 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH8_9_CALOFFS_CH9_Pos    (16UL)                    /*!< ADC1 CAL_CH8_9: CALOFFS_CH9 (Bit 16)                  */
#define ADC1_CAL_CH8_9_CALOFFS_CH9_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH8_9: CALOFFS_CH9 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH8_9_CALGAIN_CH8_Pos    (8UL)                     /*!< ADC1 CAL_CH8_9: CALGAIN_CH8 (Bit 8)                   */
#define ADC1_CAL_CH8_9_CALGAIN_CH8_Msk    (0xff00UL)                /*!< ADC1 CAL_CH8_9: CALGAIN_CH8 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH8_9_CALOFFS_CH8_Pos    (0UL)                     /*!< ADC1 CAL_CH8_9: CALOFFS_CH8 (Bit 0)                   */
#define ADC1_CAL_CH8_9_CALOFFS_CH8_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH8_9: CALOFFS_CH8 (Bitfield-Mask: 0x1f)     */
/* ======================================================  CAL_CH10_11  ====================================================== */
#define ADC1_CAL_CH10_11_CALGAIN_CH11_Pos (24UL)                    /*!< ADC1 CAL_CH10_11: CALGAIN_CH11 (Bit 24)               */
#define ADC1_CAL_CH10_11_CALGAIN_CH11_Msk (0xff000000UL)            /*!< ADC1 CAL_CH10_11: CALGAIN_CH11 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH10_11_CALOFFS_CH11_Pos (16UL)                    /*!< ADC1 CAL_CH10_11: CALOFFS_CH11 (Bit 16)               */
#define ADC1_CAL_CH10_11_CALOFFS_CH11_Msk (0x1f0000UL)              /*!< ADC1 CAL_CH10_11: CALOFFS_CH11 (Bitfield-Mask: 0x1f)  */
#define ADC1_CAL_CH10_11_CALGAIN_CH10_Pos (8UL)                     /*!< ADC1 CAL_CH10_11: CALGAIN_CH10 (Bit 8)                */
#define ADC1_CAL_CH10_11_CALGAIN_CH10_Msk (0xff00UL)                /*!< ADC1 CAL_CH10_11: CALGAIN_CH10 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH10_11_CALOFFS_CH10_Pos (0UL)                     /*!< ADC1 CAL_CH10_11: CALOFFS_CH10 (Bit 0)                */
#define ADC1_CAL_CH10_11_CALOFFS_CH10_Msk (0x1fUL)                  /*!< ADC1 CAL_CH10_11: CALOFFS_CH10 (Bitfield-Mask: 0x1f)  */
/* =====================================================  FILTCOEFF0_11  ===================================================== */
#define ADC1_FILTCOEFF0_11_CH11_Pos       (22UL)                    /*!< ADC1 FILTCOEFF0_11: CH11 (Bit 22)                     */
#define ADC1_FILTCOEFF0_11_CH11_Msk       (0xc00000UL)              /*!< ADC1 FILTCOEFF0_11: CH11 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_11_CH10_Pos       (20UL)                    /*!< ADC1 FILTCOEFF0_11: CH10 (Bit 20)                     */
#define ADC1_FILTCOEFF0_11_CH10_Msk       (0x300000UL)              /*!< ADC1 FILTCOEFF0_11: CH10 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_11_CH9_Pos        (18UL)                    /*!< ADC1 FILTCOEFF0_11: CH9 (Bit 18)                      */
#define ADC1_FILTCOEFF0_11_CH9_Msk        (0xc0000UL)               /*!< ADC1 FILTCOEFF0_11: CH9 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH8_Pos        (16UL)                    /*!< ADC1 FILTCOEFF0_11: CH8 (Bit 16)                      */
#define ADC1_FILTCOEFF0_11_CH8_Msk        (0x30000UL)               /*!< ADC1 FILTCOEFF0_11: CH8 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH7_Pos        (14UL)                    /*!< ADC1 FILTCOEFF0_11: CH7 (Bit 14)                      */
#define ADC1_FILTCOEFF0_11_CH7_Msk        (0xc000UL)                /*!< ADC1 FILTCOEFF0_11: CH7 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH6_Pos        (12UL)                    /*!< ADC1 FILTCOEFF0_11: CH6 (Bit 12)                      */
#define ADC1_FILTCOEFF0_11_CH6_Msk        (0x3000UL)                /*!< ADC1 FILTCOEFF0_11: CH6 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH5_Pos        (10UL)                    /*!< ADC1 FILTCOEFF0_11: CH5 (Bit 10)                      */
#define ADC1_FILTCOEFF0_11_CH5_Msk        (0xc00UL)                 /*!< ADC1 FILTCOEFF0_11: CH5 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH4_Pos        (8UL)                     /*!< ADC1 FILTCOEFF0_11: CH4 (Bit 8)                       */
#define ADC1_FILTCOEFF0_11_CH4_Msk        (0x300UL)                 /*!< ADC1 FILTCOEFF0_11: CH4 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH3_Pos        (6UL)                     /*!< ADC1 FILTCOEFF0_11: CH3 (Bit 6)                       */
