zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define ADC1_FILTCOEFF0_11_CH3_Msk        (0xc0UL)                  /*!< ADC1 FILTCOEFF0_11: CH3 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH2_Pos        (4UL)                     /*!< ADC1 FILTCOEFF0_11: CH2 (Bit 4)                       */
#define ADC1_FILTCOEFF0_11_CH2_Msk        (0x30UL)                  /*!< ADC1 FILTCOEFF0_11: CH2 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH1_Pos        (2UL)                     /*!< ADC1 FILTCOEFF0_11: CH1 (Bit 2)                       */
#define ADC1_FILTCOEFF0_11_CH1_Msk        (0xcUL)                   /*!< ADC1 FILTCOEFF0_11: CH1 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_11_CH0_Pos        (0UL)                     /*!< ADC1 FILTCOEFF0_11: CH0 (Bit 0)                       */
#define ADC1_FILTCOEFF0_11_CH0_Msk        (0x3UL)                   /*!< ADC1 FILTCOEFF0_11: CH0 (Bitfield-Mask: 0x03)         */
/* =======================================================  FILT_OUT0  ======================================================= */
#define ADC1_FILT_OUT0_OF0_Pos            (18UL)                    /*!< ADC1 FILT_OUT0: OF0 (Bit 18)                          */
#define ADC1_FILT_OUT0_OF0_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT0: OF0 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT0_VF0_Pos            (17UL)                    /*!< ADC1 FILT_OUT0: VF0 (Bit 17)                          */
#define ADC1_FILT_OUT0_VF0_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT0: VF0 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT0_WFR0_Pos           (16UL)                    /*!< ADC1 FILT_OUT0: WFR0 (Bit 16)                         */
#define ADC1_FILT_OUT0_WFR0_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT0: WFR0 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT0_FILT_OUT_CH0_Pos   (0UL)                     /*!< ADC1 FILT_OUT0: FILT_OUT_CH0 (Bit 0)                  */
#define ADC1_FILT_OUT0_FILT_OUT_CH0_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT0: FILT_OUT_CH0 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT1  ======================================================= */
#define ADC1_FILT_OUT1_OF1_Pos            (18UL)                    /*!< ADC1 FILT_OUT1: OF1 (Bit 18)                          */
#define ADC1_FILT_OUT1_OF1_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT1: OF1 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT1_VF1_Pos            (17UL)                    /*!< ADC1 FILT_OUT1: VF1 (Bit 17)                          */
#define ADC1_FILT_OUT1_VF1_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT1: VF1 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT1_WFR1_Pos           (16UL)                    /*!< ADC1 FILT_OUT1: WFR1 (Bit 16)                         */
#define ADC1_FILT_OUT1_WFR1_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT1: WFR1 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT1_FILT_OUT_CH1_Pos   (0UL)                     /*!< ADC1 FILT_OUT1: FILT_OUT_CH1 (Bit 0)                  */
#define ADC1_FILT_OUT1_FILT_OUT_CH1_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT1: FILT_OUT_CH1 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT2  ======================================================= */
#define ADC1_FILT_OUT2_OF2_Pos            (18UL)                    /*!< ADC1 FILT_OUT2: OF2 (Bit 18)                          */
#define ADC1_FILT_OUT2_OF2_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT2: OF2 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT2_VF2_Pos            (17UL)                    /*!< ADC1 FILT_OUT2: VF2 (Bit 17)                          */
#define ADC1_FILT_OUT2_VF2_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT2: VF2 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT2_WFR2_Pos           (16UL)                    /*!< ADC1 FILT_OUT2: WFR2 (Bit 16)                         */
#define ADC1_FILT_OUT2_WFR2_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT2: WFR2 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT2_FILT_OUT_CH2_Pos   (0UL)                     /*!< ADC1 FILT_OUT2: FILT_OUT_CH2 (Bit 0)                  */
#define ADC1_FILT_OUT2_FILT_OUT_CH2_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT2: FILT_OUT_CH2 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT3  ======================================================= */
#define ADC1_FILT_OUT3_OF3_Pos            (18UL)                    /*!< ADC1 FILT_OUT3: OF3 (Bit 18)                          */
#define ADC1_FILT_OUT3_OF3_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT3: OF3 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT3_VF3_Pos            (17UL)                    /*!< ADC1 FILT_OUT3: VF3 (Bit 17)                          */
#define ADC1_FILT_OUT3_VF3_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT3: VF3 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT3_WFR3_Pos           (16UL)                    /*!< ADC1 FILT_OUT3: WFR3 (Bit 16)                         */
#define ADC1_FILT_OUT3_WFR3_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT3: WFR3 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT3_FILT_OUT_CH3_Pos   (0UL)                     /*!< ADC1 FILT_OUT3: FILT_OUT_CH3 (Bit 0)                  */
#define ADC1_FILT_OUT3_FILT_OUT_CH3_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT3: FILT_OUT_CH3 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT4  ======================================================= */
#define ADC1_FILT_OUT4_OF4_Pos            (18UL)                    /*!< ADC1 FILT_OUT4: OF4 (Bit 18)                          */
#define ADC1_FILT_OUT4_OF4_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT4: OF4 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT4_VF4_Pos            (17UL)                    /*!< ADC1 FILT_OUT4: VF4 (Bit 17)                          */
#define ADC1_FILT_OUT4_VF4_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT4: VF4 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT4_WFR4_Pos           (16UL)                    /*!< ADC1 FILT_OUT4: WFR4 (Bit 16)                         */
#define ADC1_FILT_OUT4_WFR4_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT4: WFR4 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT4_FILT_OUT_CH4_Pos   (0UL)                     /*!< ADC1 FILT_OUT4: FILT_OUT_CH4 (Bit 0)                  */
#define ADC1_FILT_OUT4_FILT_OUT_CH4_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT4: FILT_OUT_CH4 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT5  ======================================================= */
#define ADC1_FILT_OUT5_OF5_Pos            (18UL)                    /*!< ADC1 FILT_OUT5: OF5 (Bit 18)                          */
#define ADC1_FILT_OUT5_OF5_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT5: OF5 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT5_VF5_Pos            (17UL)                    /*!< ADC1 FILT_OUT5: VF5 (Bit 17)                          */
#define ADC1_FILT_OUT5_VF5_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT5: VF5 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT5_WFR5_Pos           (16UL)                    /*!< ADC1 FILT_OUT5: WFR5 (Bit 16)                         */
#define ADC1_FILT_OUT5_WFR5_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT5: WFR5 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT5_FILT_OUT_CH5_Pos   (0UL)                     /*!< ADC1 FILT_OUT5: FILT_OUT_CH5 (Bit 0)                  */
#define ADC1_FILT_OUT5_FILT_OUT_CH5_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT5: FILT_OUT_CH5 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT6  ======================================================= */
#define ADC1_FILT_OUT6_OF6_Pos            (18UL)                    /*!< ADC1 FILT_OUT6: OF6 (Bit 18)                          */
#define ADC1_FILT_OUT6_OF6_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT6: OF6 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT6_VF6_Pos            (17UL)                    /*!< ADC1 FILT_OUT6: VF6 (Bit 17)                          */
#define ADC1_FILT_OUT6_VF6_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT6: VF6 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT6_WFR6_Pos           (16UL)                    /*!< ADC1 FILT_OUT6: WFR6 (Bit 16)                         */
#define ADC1_FILT_OUT6_WFR6_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT6: WFR6 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT6_FILT_OUT_CH6_Pos   (0UL)                     /*!< ADC1 FILT_OUT6: FILT_OUT_CH6 (Bit 0)                  */
#define ADC1_FILT_OUT6_FILT_OUT_CH6_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT6: FILT_OUT_CH6 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT7  ======================================================= */
#define ADC1_FILT_OUT7_OF7_Pos            (18UL)                    /*!< ADC1 FILT_OUT7: OF7 (Bit 18)                          */
#define ADC1_FILT_OUT7_OF7_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT7: OF7 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT7_VF7_Pos            (17UL)                    /*!< ADC1 FILT_OUT7: VF7 (Bit 17)                          */
#define ADC1_FILT_OUT7_VF7_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT7: VF7 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT7_WFR7_Pos           (16UL)                    /*!< ADC1 FILT_OUT7: WFR7 (Bit 16)                         */
#define ADC1_FILT_OUT7_WFR7_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT7: WFR7 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT7_FILT_OUT_CH7_Pos   (0UL)                     /*!< ADC1 FILT_OUT7: FILT_OUT_CH7 (Bit 0)                  */
#define ADC1_FILT_OUT7_FILT_OUT_CH7_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT7: FILT_OUT_CH7 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT8  ======================================================= */
#define ADC1_FILT_OUT8_OF8_Pos            (18UL)                    /*!< ADC1 FILT_OUT8: OF8 (Bit 18)                          */
#define ADC1_FILT_OUT8_OF8_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT8: OF8 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT8_VF8_Pos            (17UL)                    /*!< ADC1 FILT_OUT8: VF8 (Bit 17)                          */
#define ADC1_FILT_OUT8_VF8_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT8: VF8 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT8_WFR8_Pos           (16UL)                    /*!< ADC1 FILT_OUT8: WFR8 (Bit 16)                         */
#define ADC1_FILT_OUT8_WFR8_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT8: WFR8 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT8_FILT_OUT_CH8_Pos   (0UL)                     /*!< ADC1 FILT_OUT8: FILT_OUT_CH8 (Bit 0)                  */
#define ADC1_FILT_OUT8_FILT_OUT_CH8_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT8: FILT_OUT_CH8 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT9  ======================================================= */
#define ADC1_FILT_OUT9_OF9_Pos            (18UL)                    /*!< ADC1 FILT_OUT9: OF9 (Bit 18)                          */
#define ADC1_FILT_OUT9_OF9_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT9: OF9 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT9_VF9_Pos            (17UL)                    /*!< ADC1 FILT_OUT9: VF9 (Bit 17)                          */
#define ADC1_FILT_OUT9_VF9_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT9: VF9 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT9_WFR9_Pos           (16UL)                    /*!< ADC1 FILT_OUT9: WFR9 (Bit 16)                         */
#define ADC1_FILT_OUT9_WFR9_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT9: WFR9 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT9_FILT_OUT_CH9_Pos   (0UL)                     /*!< ADC1 FILT_OUT9: FILT_OUT_CH9 (Bit 0)                  */
#define ADC1_FILT_OUT9_FILT_OUT_CH9_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT9: FILT_OUT_CH9 (Bitfield-Mask: 0xfff)   */
/* ======================================================  FILT_OUT10  ======================================================= */
#define ADC1_FILT_OUT10_OF10_Pos          (18UL)                    /*!< ADC1 FILT_OUT10: OF10 (Bit 18)                        */
#define ADC1_FILT_OUT10_OF10_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT10: OF10 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT10_VF10_Pos          (17UL)                    /*!< ADC1 FILT_OUT10: VF10 (Bit 17)                        */
#define ADC1_FILT_OUT10_VF10_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT10: VF10 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT10_WFR10_Pos         (16UL)                    /*!< ADC1 FILT_OUT10: WFR10 (Bit 16)                       */
#define ADC1_FILT_OUT10_WFR10_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT10: WFR10 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT10_FILT_OUT_CH10_Pos (0UL)                     /*!< ADC1 FILT_OUT10: FILT_OUT_CH10 (Bit 0)                */
#define ADC1_FILT_OUT10_FILT_OUT_CH10_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT10: FILT_OUT_CH10 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUT11  ======================================================= */
#define ADC1_FILT_OUT11_OF11_Pos          (18UL)                    /*!< ADC1 FILT_OUT11: OF11 (Bit 18)                        */
#define ADC1_FILT_OUT11_OF11_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT11: OF11 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT11_VF11_Pos          (17UL)                    /*!< ADC1 FILT_OUT11: VF11 (Bit 17)                        */
#define ADC1_FILT_OUT11_VF11_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT11: VF11 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT11_WFR11_Pos         (16UL)                    /*!< ADC1 FILT_OUT11: WFR11 (Bit 16)                       */
#define ADC1_FILT_OUT11_WFR11_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT11: WFR11 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT11_FILT_OUT_CH11_Pos (0UL)                     /*!< ADC1 FILT_OUT11: FILT_OUT_CH11 (Bit 0)                */
#define ADC1_FILT_OUT11_FILT_OUT_CH11_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT11: FILT_OUT_CH11 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUT12  ======================================================= */
#define ADC1_FILT_OUT12_OF12_Pos          (18UL)                    /*!< ADC1 FILT_OUT12: OF12 (Bit 18)                        */
#define ADC1_FILT_OUT12_OF12_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT12: OF12 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT12_VF12_Pos          (17UL)                    /*!< ADC1 FILT_OUT12: VF12 (Bit 17)                        */
#define ADC1_FILT_OUT12_VF12_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT12: VF12 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT12_WFR12_Pos         (16UL)                    /*!< ADC1 FILT_OUT12: WFR12 (Bit 16)                       */
#define ADC1_FILT_OUT12_WFR12_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT12: WFR12 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT12_FILT_OUT_CH12_Pos (0UL)                     /*!< ADC1 FILT_OUT12: FILT_OUT_CH12 (Bit 0)                */
#define ADC1_FILT_OUT12_FILT_OUT_CH12_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT12: FILT_OUT_CH12 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUTEIM  ====================================================== */
#define ADC1_FILT_OUTEIM_OF_EIM_Pos       (18UL)                    /*!< ADC1 FILT_OUTEIM: OF_EIM (Bit 18)                     */
#define ADC1_FILT_OUTEIM_OF_EIM_Msk       (0x40000UL)               /*!< ADC1 FILT_OUTEIM: OF_EIM (Bitfield-Mask: 0x01)        */
#define ADC1_FILT_OUTEIM_VF_EIM_Pos       (17UL)                    /*!< ADC1 FILT_OUTEIM: VF_EIM (Bit 17)                     */
#define ADC1_FILT_OUTEIM_VF_EIM_Msk       (0x20000UL)               /*!< ADC1 FILT_OUTEIM: VF_EIM (Bitfield-Mask: 0x01)        */
#define ADC1_FILT_OUTEIM_WFR_EIM_Pos      (16UL)                    /*!< ADC1 FILT_OUTEIM: WFR_EIM (Bit 16)                    */
#define ADC1_FILT_OUTEIM_WFR_EIM_Msk      (0x10000UL)               /*!< ADC1 FILT_OUTEIM: WFR_EIM (Bitfield-Mask: 0x01)       */
#define ADC1_FILT_OUTEIM_FILT_OUT_EIM_Pos (0UL)                     /*!< ADC1 FILT_OUTEIM: FILT_OUT_EIM (Bit 0)                */
#define ADC1_FILT_OUTEIM_FILT_OUT_EIM_Msk (0xfffUL)                 /*!< ADC1 FILT_OUTEIM: FILT_OUT_EIM (Bitfield-Mask: 0xfff) */
/* ======================================================  DIFFCH_OUT1  ====================================================== */
#define ADC1_DIFFCH_OUT1_DOF1_Pos         (18UL)                    /*!< ADC1 DIFFCH_OUT1: DOF1 (Bit 18)                       */
#define ADC1_DIFFCH_OUT1_DOF1_Msk         (0x40000UL)               /*!< ADC1 DIFFCH_OUT1: DOF1 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT1_DVF1_Pos         (17UL)                    /*!< ADC1 DIFFCH_OUT1: DVF1 (Bit 17)                       */
#define ADC1_DIFFCH_OUT1_DVF1_Msk         (0x20000UL)               /*!< ADC1 DIFFCH_OUT1: DVF1 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT1_DWFR1_Pos        (16UL)                    /*!< ADC1 DIFFCH_OUT1: DWFR1 (Bit 16)                      */
#define ADC1_DIFFCH_OUT1_DWFR1_Msk        (0x10000UL)               /*!< ADC1 DIFFCH_OUT1: DWFR1 (Bitfield-Mask: 0x01)         */
#define ADC1_DIFFCH_OUT1_DCH1_Pos         (0UL)                     /*!< ADC1 DIFFCH_OUT1: DCH1 (Bit 0)                        */
#define ADC1_DIFFCH_OUT1_DCH1_Msk         (0xfffUL)                 /*!< ADC1 DIFFCH_OUT1: DCH1 (Bitfield-Mask: 0xfff)         */
/* ======================================================  DIFFCH_OUT2  ====================================================== */
#define ADC1_DIFFCH_OUT2_DOF2_Pos         (18UL)                    /*!< ADC1 DIFFCH_OUT2: DOF2 (Bit 18)                       */
#define ADC1_DIFFCH_OUT2_DOF2_Msk         (0x40000UL)               /*!< ADC1 DIFFCH_OUT2: DOF2 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT2_DVF2_Pos         (17UL)                    /*!< ADC1 DIFFCH_OUT2: DVF2 (Bit 17)                       */
#define ADC1_DIFFCH_OUT2_DVF2_Msk         (0x20000UL)               /*!< ADC1 DIFFCH_OUT2: DVF2 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT2_DWFR2_Pos        (16UL)                    /*!< ADC1 DIFFCH_OUT2: DWFR2 (Bit 16)                      */
#define ADC1_DIFFCH_OUT2_DWFR2_Msk        (0x10000UL)               /*!< ADC1 DIFFCH_OUT2: DWFR2 (Bitfield-Mask: 0x01)         */
#define ADC1_DIFFCH_OUT2_DCH2_Pos         (0UL)                     /*!< ADC1 DIFFCH_OUT2: DCH2 (Bit 0)                        */
#define ADC1_DIFFCH_OUT2_DCH2_Msk         (0xfffUL)                 /*!< ADC1 DIFFCH_OUT2: DCH2 (Bitfield-Mask: 0xfff)         */
/* ======================================================  DIFFCH_OUT3  ====================================================== */
#define ADC1_DIFFCH_OUT3_DOF3_Pos         (18UL)                    /*!< ADC1 DIFFCH_OUT3: DOF3 (Bit 18)                       */
#define ADC1_DIFFCH_OUT3_DOF3_Msk         (0x40000UL)               /*!< ADC1 DIFFCH_OUT3: DOF3 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT3_DVF3_Pos         (17UL)                    /*!< ADC1 DIFFCH_OUT3: DVF3 (Bit 17)                       */
#define ADC1_DIFFCH_OUT3_DVF3_Msk         (0x20000UL)               /*!< ADC1 DIFFCH_OUT3: DVF3 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT3_DWFR3_Pos        (16UL)                    /*!< ADC1 DIFFCH_OUT3: DWFR3 (Bit 16)                      */
#define ADC1_DIFFCH_OUT3_DWFR3_Msk        (0x10000UL)               /*!< ADC1 DIFFCH_OUT3: DWFR3 (Bitfield-Mask: 0x01)         */
#define ADC1_DIFFCH_OUT3_DCH3_Pos         (0UL)                     /*!< ADC1 DIFFCH_OUT3: DCH3 (Bit 0)                        */
#define ADC1_DIFFCH_OUT3_DCH3_Msk         (0xfffUL)                 /*!< ADC1 DIFFCH_OUT3: DCH3 (Bitfield-Mask: 0xfff)         */
/* ======================================================  DIFFCH_OUT4  ====================================================== */
#define ADC1_DIFFCH_OUT4_DOF4_Pos         (18UL)                    /*!< ADC1 DIFFCH_OUT4: DOF4 (Bit 18)                       */
#define ADC1_DIFFCH_OUT4_DOF4_Msk         (0x40000UL)               /*!< ADC1 DIFFCH_OUT4: DOF4 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT4_DVF4_Pos         (17UL)                    /*!< ADC1 DIFFCH_OUT4: DVF4 (Bit 17)                       */
#define ADC1_DIFFCH_OUT4_DVF4_Msk         (0x20000UL)               /*!< ADC1 DIFFCH_OUT4: DVF4 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT4_DWFR4_Pos        (16UL)                    /*!< ADC1 DIFFCH_OUT4: DWFR4 (Bit 16)                      */
#define ADC1_DIFFCH_OUT4_DWFR4_Msk        (0x10000UL)               /*!< ADC1 DIFFCH_OUT4: DWFR4 (Bitfield-Mask: 0x01)         */
#define ADC1_DIFFCH_OUT4_DCH4_Pos         (0UL)                     /*!< ADC1 DIFFCH_OUT4: DCH4 (Bit 0)                        */
#define ADC1_DIFFCH_OUT4_DCH4_Msk         (0xfffUL)                 /*!< ADC1 DIFFCH_OUT4: DCH4 (Bitfield-Mask: 0xfff)         */
/* =====================================================  FILT_UP_CTRL  ====================================================== */
#define ADC1_FILT_UP_CTRL_FU_CH11_EN_Pos  (11UL)                    /*!< ADC1 FILT_UP_CTRL: FU_CH11_EN (Bit 11)                */
#define ADC1_FILT_UP_CTRL_FU_CH11_EN_Msk  (0x800UL)                 /*!< ADC1 FILT_UP_CTRL: FU_CH11_EN (Bitfield-Mask: 0x01)   */
#define ADC1_FILT_UP_CTRL_FU_CH10_EN_Pos  (10UL)                    /*!< ADC1 FILT_UP_CTRL: FU_CH10_EN (Bit 10)                */
#define ADC1_FILT_UP_CTRL_FU_CH10_EN_Msk  (0x400UL)                 /*!< ADC1 FILT_UP_CTRL: FU_CH10_EN (Bitfield-Mask: 0x01)   */
#define ADC1_FILT_UP_CTRL_FU_CH9_EN_Pos   (9UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH9_EN (Bit 9)                  */
#define ADC1_FILT_UP_CTRL_FU_CH9_EN_Msk   (0x200UL)                 /*!< ADC1 FILT_UP_CTRL: FU_CH9_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH8_EN_Pos   (8UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH8_EN (Bit 8)                  */
#define ADC1_FILT_UP_CTRL_FU_CH8_EN_Msk   (0x100UL)                 /*!< ADC1 FILT_UP_CTRL: FU_CH8_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH7_EN_Pos   (7UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH7_EN (Bit 7)                  */
#define ADC1_FILT_UP_CTRL_FU_CH7_EN_Msk   (0x80UL)                  /*!< ADC1 FILT_UP_CTRL: FU_CH7_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH6_EN_Pos   (6UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH6_EN (Bit 6)                  */
#define ADC1_FILT_UP_CTRL_FU_CH6_EN_Msk   (0x40UL)                  /*!< ADC1 FILT_UP_CTRL: FU_CH6_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH5_EN_Pos   (5UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH5_EN (Bit 5)                  */
#define ADC1_FILT_UP_CTRL_FU_CH5_EN_Msk   (0x20UL)                  /*!< ADC1 FILT_UP_CTRL: FU_CH5_EN (Bitfield-Mask: 0x01)    */
