zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define ADC1_FILT_UP_CTRL_FU_CH4_EN_Pos   (4UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH4_EN (Bit 4)                  */
#define ADC1_FILT_UP_CTRL_FU_CH4_EN_Msk   (0x10UL)                  /*!< ADC1 FILT_UP_CTRL: FU_CH4_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH3_EN_Pos   (3UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH3_EN (Bit 3)                  */
#define ADC1_FILT_UP_CTRL_FU_CH3_EN_Msk   (0x8UL)                   /*!< ADC1 FILT_UP_CTRL: FU_CH3_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH2_EN_Pos   (2UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH2_EN (Bit 2)                  */
#define ADC1_FILT_UP_CTRL_FU_CH2_EN_Msk   (0x4UL)                   /*!< ADC1 FILT_UP_CTRL: FU_CH2_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH1_EN_Pos   (1UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH1_EN (Bit 1)                  */
#define ADC1_FILT_UP_CTRL_FU_CH1_EN_Msk   (0x2UL)                   /*!< ADC1 FILT_UP_CTRL: FU_CH1_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_UP_CTRL_FU_CH0_EN_Pos   (0UL)                     /*!< ADC1 FILT_UP_CTRL: FU_CH0_EN (Bit 0)                  */
#define ADC1_FILT_UP_CTRL_FU_CH0_EN_Msk   (0x1UL)                   /*!< ADC1 FILT_UP_CTRL: FU_CH0_EN (Bitfield-Mask: 0x01)    */
/* =====================================================  FILT_LO_CTRL  ====================================================== */
#define ADC1_FILT_LO_CTRL_FL_CH11_EN_Pos  (11UL)                    /*!< ADC1 FILT_LO_CTRL: FL_CH11_EN (Bit 11)                */
#define ADC1_FILT_LO_CTRL_FL_CH11_EN_Msk  (0x800UL)                 /*!< ADC1 FILT_LO_CTRL: FL_CH11_EN (Bitfield-Mask: 0x01)   */
#define ADC1_FILT_LO_CTRL_FL_CH10_EN_Pos  (10UL)                    /*!< ADC1 FILT_LO_CTRL: FL_CH10_EN (Bit 10)                */
#define ADC1_FILT_LO_CTRL_FL_CH10_EN_Msk  (0x400UL)                 /*!< ADC1 FILT_LO_CTRL: FL_CH10_EN (Bitfield-Mask: 0x01)   */
#define ADC1_FILT_LO_CTRL_FL_CH9_EN_Pos   (9UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH9_EN (Bit 9)                  */
#define ADC1_FILT_LO_CTRL_FL_CH9_EN_Msk   (0x200UL)                 /*!< ADC1 FILT_LO_CTRL: FL_CH9_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH8_EN_Pos   (8UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH8_EN (Bit 8)                  */
#define ADC1_FILT_LO_CTRL_FL_CH8_EN_Msk   (0x100UL)                 /*!< ADC1 FILT_LO_CTRL: FL_CH8_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH7_EN_Pos   (7UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH7_EN (Bit 7)                  */
#define ADC1_FILT_LO_CTRL_FL_CH7_EN_Msk   (0x80UL)                  /*!< ADC1 FILT_LO_CTRL: FL_CH7_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH6_EN_Pos   (6UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH6_EN (Bit 6)                  */
#define ADC1_FILT_LO_CTRL_FL_CH6_EN_Msk   (0x40UL)                  /*!< ADC1 FILT_LO_CTRL: FL_CH6_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH5_EN_Pos   (5UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH5_EN (Bit 5)                  */
#define ADC1_FILT_LO_CTRL_FL_CH5_EN_Msk   (0x20UL)                  /*!< ADC1 FILT_LO_CTRL: FL_CH5_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH4_EN_Pos   (4UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH4_EN (Bit 4)                  */
#define ADC1_FILT_LO_CTRL_FL_CH4_EN_Msk   (0x10UL)                  /*!< ADC1 FILT_LO_CTRL: FL_CH4_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH3_EN_Pos   (3UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH3_EN (Bit 3)                  */
#define ADC1_FILT_LO_CTRL_FL_CH3_EN_Msk   (0x8UL)                   /*!< ADC1 FILT_LO_CTRL: FL_CH3_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH2_EN_Pos   (2UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH2_EN (Bit 2)                  */
#define ADC1_FILT_LO_CTRL_FL_CH2_EN_Msk   (0x4UL)                   /*!< ADC1 FILT_LO_CTRL: FL_CH2_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH1_EN_Pos   (1UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH1_EN (Bit 1)                  */
#define ADC1_FILT_LO_CTRL_FL_CH1_EN_Msk   (0x2UL)                   /*!< ADC1 FILT_LO_CTRL: FL_CH1_EN (Bitfield-Mask: 0x01)    */
#define ADC1_FILT_LO_CTRL_FL_CH0_EN_Pos   (0UL)                     /*!< ADC1 FILT_LO_CTRL: FL_CH0_EN (Bit 0)                  */
#define ADC1_FILT_LO_CTRL_FL_CH0_EN_Msk   (0x1UL)                   /*!< ADC1 FILT_LO_CTRL: FL_CH0_EN (Bitfield-Mask: 0x01)    */
/* =======================================================  MMODE0_11  ======================================================= */
#define ADC1_MMODE0_11_MMODE_D4_Pos       (30UL)                    /*!< ADC1 MMODE0_11: MMODE_D4 (Bit 30)                     */
#define ADC1_MMODE0_11_MMODE_D4_Msk       (0xc0000000UL)            /*!< ADC1 MMODE0_11: MMODE_D4 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_D3_Pos       (28UL)                    /*!< ADC1 MMODE0_11: MMODE_D3 (Bit 28)                     */
#define ADC1_MMODE0_11_MMODE_D3_Msk       (0x30000000UL)            /*!< ADC1 MMODE0_11: MMODE_D3 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_D2_Pos       (26UL)                    /*!< ADC1 MMODE0_11: MMODE_D2 (Bit 26)                     */
#define ADC1_MMODE0_11_MMODE_D2_Msk       (0xc000000UL)             /*!< ADC1 MMODE0_11: MMODE_D2 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_D1_Pos       (24UL)                    /*!< ADC1 MMODE0_11: MMODE_D1 (Bit 24)                     */
#define ADC1_MMODE0_11_MMODE_D1_Msk       (0x3000000UL)             /*!< ADC1 MMODE0_11: MMODE_D1 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_11_Pos       (22UL)                    /*!< ADC1 MMODE0_11: MMODE_11 (Bit 22)                     */
#define ADC1_MMODE0_11_MMODE_11_Msk       (0xc00000UL)              /*!< ADC1 MMODE0_11: MMODE_11 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_10_Pos       (20UL)                    /*!< ADC1 MMODE0_11: MMODE_10 (Bit 20)                     */
#define ADC1_MMODE0_11_MMODE_10_Msk       (0x300000UL)              /*!< ADC1 MMODE0_11: MMODE_10 (Bitfield-Mask: 0x03)        */
#define ADC1_MMODE0_11_MMODE_9_Pos        (18UL)                    /*!< ADC1 MMODE0_11: MMODE_9 (Bit 18)                      */
#define ADC1_MMODE0_11_MMODE_9_Msk        (0xc0000UL)               /*!< ADC1 MMODE0_11: MMODE_9 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_8_Pos        (16UL)                    /*!< ADC1 MMODE0_11: MMODE_8 (Bit 16)                      */
#define ADC1_MMODE0_11_MMODE_8_Msk        (0x30000UL)               /*!< ADC1 MMODE0_11: MMODE_8 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_7_Pos        (14UL)                    /*!< ADC1 MMODE0_11: MMODE_7 (Bit 14)                      */
#define ADC1_MMODE0_11_MMODE_7_Msk        (0xc000UL)                /*!< ADC1 MMODE0_11: MMODE_7 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_6_Pos        (12UL)                    /*!< ADC1 MMODE0_11: MMODE_6 (Bit 12)                      */
#define ADC1_MMODE0_11_MMODE_6_Msk        (0x3000UL)                /*!< ADC1 MMODE0_11: MMODE_6 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_5_Pos        (10UL)                    /*!< ADC1 MMODE0_11: MMODE_5 (Bit 10)                      */
#define ADC1_MMODE0_11_MMODE_5_Msk        (0xc00UL)                 /*!< ADC1 MMODE0_11: MMODE_5 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_4_Pos        (8UL)                     /*!< ADC1 MMODE0_11: MMODE_4 (Bit 8)                       */
#define ADC1_MMODE0_11_MMODE_4_Msk        (0x300UL)                 /*!< ADC1 MMODE0_11: MMODE_4 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_3_Pos        (6UL)                     /*!< ADC1 MMODE0_11: MMODE_3 (Bit 6)                       */
#define ADC1_MMODE0_11_MMODE_3_Msk        (0xc0UL)                  /*!< ADC1 MMODE0_11: MMODE_3 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_2_Pos        (4UL)                     /*!< ADC1 MMODE0_11: MMODE_2 (Bit 4)                       */
#define ADC1_MMODE0_11_MMODE_2_Msk        (0x30UL)                  /*!< ADC1 MMODE0_11: MMODE_2 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_1_Pos        (2UL)                     /*!< ADC1 MMODE0_11: MMODE_1 (Bit 2)                       */
#define ADC1_MMODE0_11_MMODE_1_Msk        (0xcUL)                   /*!< ADC1 MMODE0_11: MMODE_1 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_11_MMODE_0_Pos        (0UL)                     /*!< ADC1 MMODE0_11: MMODE_0 (Bit 0)                       */
#define ADC1_MMODE0_11_MMODE_0_Msk        (0x3UL)                   /*!< ADC1 MMODE0_11: MMODE_0 (Bitfield-Mask: 0x03)         */
/* ======================================================  TH0_3_UPPER  ====================================================== */
#define ADC1_TH0_3_UPPER_CH3_UP_Pos       (24UL)                    /*!< ADC1 TH0_3_UPPER: CH3_UP (Bit 24)                     */
#define ADC1_TH0_3_UPPER_CH3_UP_Msk       (0xff000000UL)            /*!< ADC1 TH0_3_UPPER: CH3_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH0_3_UPPER_CH2_UP_Pos       (16UL)                    /*!< ADC1 TH0_3_UPPER: CH2_UP (Bit 16)                     */
#define ADC1_TH0_3_UPPER_CH2_UP_Msk       (0xff0000UL)              /*!< ADC1 TH0_3_UPPER: CH2_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH0_3_UPPER_CH1_UP_Pos       (8UL)                     /*!< ADC1 TH0_3_UPPER: CH1_UP (Bit 8)                      */
#define ADC1_TH0_3_UPPER_CH1_UP_Msk       (0xff00UL)                /*!< ADC1 TH0_3_UPPER: CH1_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH0_3_UPPER_CH0_UP_Pos       (0UL)                     /*!< ADC1 TH0_3_UPPER: CH0_UP (Bit 0)                      */
#define ADC1_TH0_3_UPPER_CH0_UP_Msk       (0xffUL)                  /*!< ADC1 TH0_3_UPPER: CH0_UP (Bitfield-Mask: 0xff)        */
/* ======================================================  TH4_7_UPPER  ====================================================== */
#define ADC1_TH4_7_UPPER_CH7_UP_Pos       (24UL)                    /*!< ADC1 TH4_7_UPPER: CH7_UP (Bit 24)                     */
#define ADC1_TH4_7_UPPER_CH7_UP_Msk       (0xff000000UL)            /*!< ADC1 TH4_7_UPPER: CH7_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH4_7_UPPER_CH6_UP_Pos       (16UL)                    /*!< ADC1 TH4_7_UPPER: CH6_UP (Bit 16)                     */
#define ADC1_TH4_7_UPPER_CH6_UP_Msk       (0xff0000UL)              /*!< ADC1 TH4_7_UPPER: CH6_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH4_7_UPPER_CH5_UP_Pos       (8UL)                     /*!< ADC1 TH4_7_UPPER: CH5_UP (Bit 8)                      */
#define ADC1_TH4_7_UPPER_CH5_UP_Msk       (0xff00UL)                /*!< ADC1 TH4_7_UPPER: CH5_UP (Bitfield-Mask: 0xff)        */
#define ADC1_TH4_7_UPPER_CH4_UP_Pos       (0UL)                     /*!< ADC1 TH4_7_UPPER: CH4_UP (Bit 0)                      */
#define ADC1_TH4_7_UPPER_CH4_UP_Msk       (0xffUL)                  /*!< ADC1 TH4_7_UPPER: CH4_UP (Bitfield-Mask: 0xff)        */
/* =====================================================  TH8_11_UPPER  ====================================================== */
#define ADC1_TH8_11_UPPER_CH11_UP_Pos     (24UL)                    /*!< ADC1 TH8_11_UPPER: CH11_UP (Bit 24)                   */
#define ADC1_TH8_11_UPPER_CH11_UP_Msk     (0xff000000UL)            /*!< ADC1 TH8_11_UPPER: CH11_UP (Bitfield-Mask: 0xff)      */
#define ADC1_TH8_11_UPPER_CH10_UP_Pos     (16UL)                    /*!< ADC1 TH8_11_UPPER: CH10_UP (Bit 16)                   */
#define ADC1_TH8_11_UPPER_CH10_UP_Msk     (0xff0000UL)              /*!< ADC1 TH8_11_UPPER: CH10_UP (Bitfield-Mask: 0xff)      */
#define ADC1_TH8_11_UPPER_CH9_UP_Pos      (8UL)                     /*!< ADC1 TH8_11_UPPER: CH9_UP (Bit 8)                     */
#define ADC1_TH8_11_UPPER_CH9_UP_Msk      (0xff00UL)                /*!< ADC1 TH8_11_UPPER: CH9_UP (Bitfield-Mask: 0xff)       */
#define ADC1_TH8_11_UPPER_CH8_UP_Pos      (0UL)                     /*!< ADC1 TH8_11_UPPER: CH8_UP (Bit 0)                     */
#define ADC1_TH8_11_UPPER_CH8_UP_Msk      (0xffUL)                  /*!< ADC1 TH8_11_UPPER: CH8_UP (Bitfield-Mask: 0xff)       */
/* ====================================================  DCHTH1_4_UPPER  ===================================================== */
#define ADC1_DCHTH1_4_UPPER_DCH4_UP_Pos   (24UL)                    /*!< ADC1 DCHTH1_4_UPPER: DCH4_UP (Bit 24)                 */
#define ADC1_DCHTH1_4_UPPER_DCH4_UP_Msk   (0xff000000UL)            /*!< ADC1 DCHTH1_4_UPPER: DCH4_UP (Bitfield-Mask: 0xff)    */
#define ADC1_DCHTH1_4_UPPER_DCH3_UP_Pos   (16UL)                    /*!< ADC1 DCHTH1_4_UPPER: DCH3_UP (Bit 16)                 */
#define ADC1_DCHTH1_4_UPPER_DCH3_UP_Msk   (0xff0000UL)              /*!< ADC1 DCHTH1_4_UPPER: DCH3_UP (Bitfield-Mask: 0xff)    */
#define ADC1_DCHTH1_4_UPPER_DCH2_UP_Pos   (8UL)                     /*!< ADC1 DCHTH1_4_UPPER: DCH2_UP (Bit 8)                  */
#define ADC1_DCHTH1_4_UPPER_DCH2_UP_Msk   (0xff00UL)                /*!< ADC1 DCHTH1_4_UPPER: DCH2_UP (Bitfield-Mask: 0xff)    */
#define ADC1_DCHTH1_4_UPPER_DCH1_UP_Pos   (0UL)                     /*!< ADC1 DCHTH1_4_UPPER: DCH1_UP (Bit 0)                  */
#define ADC1_DCHTH1_4_UPPER_DCH1_UP_Msk   (0xffUL)                  /*!< ADC1 DCHTH1_4_UPPER: DCH1_UP (Bitfield-Mask: 0xff)    */
/* =====================================================  CNT0_3_UPPER  ====================================================== */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH3_Pos (27UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH3 (Bit 27)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH3_Msk (0x18000000UL)            /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH3 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH3_Pos  (24UL)                    /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH3 (Bit 24)                */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH3_Msk  (0x7000000UL)             /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH3 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH2_Pos (19UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH2 (Bit 19)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH2_Msk (0x180000UL)              /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH2 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH2_Pos  (16UL)                    /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH2 (Bit 16)                */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH2_Msk  (0x70000UL)               /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH2 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH1_Pos (11UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH1 (Bit 11)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH1_Msk (0x1800UL)                /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH1 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH1_Pos  (8UL)                     /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH1 (Bit 8)                 */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH1_Msk  (0x700UL)                 /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH1 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH0_Pos (3UL)                     /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH0 (Bit 3)                */
#define ADC1_CNT0_3_UPPER_HYST_UP_CH0_Msk (0x18UL)                  /*!< ADC1 CNT0_3_UPPER: HYST_UP_CH0 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH0_Pos  (0UL)                     /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH0 (Bit 0)                 */
#define ADC1_CNT0_3_UPPER_CNT_UP_CH0_Msk  (0x7UL)                   /*!< ADC1 CNT0_3_UPPER: CNT_UP_CH0 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT4_7_UPPER  ====================================================== */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH7_Pos (27UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH7 (Bit 27)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH7_Msk (0x18000000UL)            /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH7 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH7_Pos  (24UL)                    /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH7 (Bit 24)                */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH7_Msk  (0x7000000UL)             /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH7 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH6_Pos (19UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH6 (Bit 19)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH6_Msk (0x180000UL)              /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH6 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH6_Pos  (16UL)                    /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH6 (Bit 16)                */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH6_Msk  (0x70000UL)               /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH6 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH5_Pos (11UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH5 (Bit 11)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH5_Msk (0x1800UL)                /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH5 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH5_Pos  (8UL)                     /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH5 (Bit 8)                 */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH5_Msk  (0x700UL)                 /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH5 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH4_Pos (3UL)                     /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH4 (Bit 3)                */
#define ADC1_CNT4_7_UPPER_HYST_UP_CH4_Msk (0x18UL)                  /*!< ADC1 CNT4_7_UPPER: HYST_UP_CH4 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH4_Pos  (0UL)                     /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH4 (Bit 0)                 */
#define ADC1_CNT4_7_UPPER_CNT_UP_CH4_Msk  (0x7UL)                   /*!< ADC1 CNT4_7_UPPER: CNT_UP_CH4 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT8_11_UPPER  ===================================================== */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH11_Pos (27UL)                  /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH11 (Bit 27)             */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH11_Msk (0x18000000UL)          /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH11 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH11_Pos (24UL)                   /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH11 (Bit 24)              */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH11_Msk (0x7000000UL)            /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH11 (Bitfield-Mask: 0x07) */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH10_Pos (19UL)                  /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH10 (Bit 19)             */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH10_Msk (0x180000UL)            /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH10 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH10_Pos (16UL)                   /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH10 (Bit 16)              */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH10_Msk (0x70000UL)              /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH10 (Bitfield-Mask: 0x07) */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH9_Pos (11UL)                   /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH9 (Bit 11)              */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH9_Msk (0x1800UL)               /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH9 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH9_Pos (8UL)                     /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH9 (Bit 8)                */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH9_Msk (0x700UL)                 /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH9 (Bitfield-Mask: 0x07)  */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH8_Pos (3UL)                    /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH8 (Bit 3)               */
#define ADC1_CNT8_11_UPPER_HYST_UP_CH8_Msk (0x18UL)                 /*!< ADC1 CNT8_11_UPPER: HYST_UP_CH8 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH8_Pos (0UL)                     /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH8 (Bit 0)                */
#define ADC1_CNT8_11_UPPER_CNT_UP_CH8_Msk (0x7UL)                   /*!< ADC1 CNT8_11_UPPER: CNT_UP_CH8 (Bitfield-Mask: 0x07)  */
/* ====================================================  DCHCNT1_4_UPPER  ==================================================== */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH4_Pos (27UL)                /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH4 (Bit 27)           */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH4_Msk (0x18000000UL)        /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH4 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH4_Pos (24UL)                 /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH4 (Bit 24)            */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH4_Msk (0x7000000UL)          /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH4 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH3_Pos (19UL)                /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH3 (Bit 19)           */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH3_Msk (0x180000UL)          /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH3 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH3_Pos (16UL)                 /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH3 (Bit 16)            */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH3_Msk (0x70000UL)            /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH3 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH2_Pos (11UL)                /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH2 (Bit 11)           */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH2_Msk (0x1800UL)            /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH2 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH2_Pos (8UL)                  /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH2 (Bit 8)             */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH2_Msk (0x700UL)              /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH2 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH1_Pos (3UL)                 /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH1 (Bit 3)            */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH1_Msk (0x18UL)              /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH1 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH1_Pos (0UL)                  /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH1 (Bit 0)             */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH1_Msk (0x7UL)                /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH1 (Bitfield-Mask: 0x07) */
/* ======================================================  TH0_3_LOWER  ====================================================== */
#define ADC1_TH0_3_LOWER_CH3_LOW_Pos      (24UL)                    /*!< ADC1 TH0_3_LOWER: CH3_LOW (Bit 24)                    */
#define ADC1_TH0_3_LOWER_CH3_LOW_Msk      (0xff000000UL)            /*!< ADC1 TH0_3_LOWER: CH3_LOW (Bitfield-Mask: 0xff)       */
#define ADC1_TH0_3_LOWER_CH2_LOW_Pos      (16UL)                    /*!< ADC1 TH0_3_LOWER: CH2_LOW (Bit 16)                    */
#define ADC1_TH0_3_LOWER_CH2_LOW_Msk      (0xff0000UL)              /*!< ADC1 TH0_3_LOWER: CH2_LOW (Bitfield-Mask: 0xff)       */
#define ADC1_TH0_3_LOWER_CH1_LOW_Pos      (8UL)                     /*!< ADC1 TH0_3_LOWER: CH1_LOW (Bit 8)                     */
#define ADC1_TH0_3_LOWER_CH1_LOW_Msk      (0xff00UL)                /*!< ADC1 TH0_3_LOWER: CH1_LOW (Bitfield-Mask: 0xff)       */
#define ADC1_TH0_3_LOWER_CH0_LOW_Pos      (0UL)                     /*!< ADC1 TH0_3_LOWER: CH0_LOW (Bit 0)                     */
#define ADC1_TH0_3_LOWER_CH0_LOW_Msk      (0xffUL)                  /*!< ADC1 TH0_3_LOWER: CH0_LOW (Bitfield-Mask: 0xff)       */
/* ======================================================  TH4_7_LOWER  ====================================================== */
#define ADC1_TH4_7_LOWER_CH7_LOW_Pos      (24UL)                    /*!< ADC1 TH4_7_LOWER: CH7_LOW (Bit 24)                    */
#define ADC1_TH4_7_LOWER_CH7_LOW_Msk      (0xff000000UL)            /*!< ADC1 TH4_7_LOWER: CH7_LOW (Bitfield-Mask: 0xff)       */
