zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define ADC1_TH4_7_LOWER_CH6_LOW_Pos      (16UL)                    /*!< ADC1 TH4_7_LOWER: CH6_LOW (Bit 16)                    */
#define ADC1_TH4_7_LOWER_CH6_LOW_Msk      (0xff0000UL)              /*!< ADC1 TH4_7_LOWER: CH6_LOW (Bitfield-Mask: 0xff)       */
#define ADC1_TH4_7_LOWER_CH5_LOW_Pos      (8UL)                     /*!< ADC1 TH4_7_LOWER: CH5_LOW (Bit 8)                     */
#define ADC1_TH4_7_LOWER_CH5_LOW_Msk      (0xff00UL)                /*!< ADC1 TH4_7_LOWER: CH5_LOW (Bitfield-Mask: 0xff)       */
#define ADC1_TH4_7_LOWER_CH4_LOW_Pos      (0UL)                     /*!< ADC1 TH4_7_LOWER: CH4_LOW (Bit 0)                     */
#define ADC1_TH4_7_LOWER_CH4_LOW_Msk      (0xffUL)                  /*!< ADC1 TH4_7_LOWER: CH4_LOW (Bitfield-Mask: 0xff)       */
/* =====================================================  TH8_11_LOWER  ====================================================== */
#define ADC1_TH8_11_LOWER_CH11_LOW_Pos    (24UL)                    /*!< ADC1 TH8_11_LOWER: CH11_LOW (Bit 24)                  */
#define ADC1_TH8_11_LOWER_CH11_LOW_Msk    (0xff000000UL)            /*!< ADC1 TH8_11_LOWER: CH11_LOW (Bitfield-Mask: 0xff)     */
#define ADC1_TH8_11_LOWER_CH10_LOW_Pos    (16UL)                    /*!< ADC1 TH8_11_LOWER: CH10_LOW (Bit 16)                  */
#define ADC1_TH8_11_LOWER_CH10_LOW_Msk    (0xff0000UL)              /*!< ADC1 TH8_11_LOWER: CH10_LOW (Bitfield-Mask: 0xff)     */
#define ADC1_TH8_11_LOWER_CH9_LOW_Pos     (8UL)                     /*!< ADC1 TH8_11_LOWER: CH9_LOW (Bit 8)                    */
#define ADC1_TH8_11_LOWER_CH9_LOW_Msk     (0xff00UL)                /*!< ADC1 TH8_11_LOWER: CH9_LOW (Bitfield-Mask: 0xff)      */
#define ADC1_TH8_11_LOWER_CH8_LOW_Pos     (0UL)                     /*!< ADC1 TH8_11_LOWER: CH8_LOW (Bit 0)                    */
#define ADC1_TH8_11_LOWER_CH8_LOW_Msk     (0xffUL)                  /*!< ADC1 TH8_11_LOWER: CH8_LOW (Bitfield-Mask: 0xff)      */
/* ====================================================  DCHTH1_4_LOWER  ===================================================== */
#define ADC1_DCHTH1_4_LOWER_DCH4_LOW_Pos  (24UL)                    /*!< ADC1 DCHTH1_4_LOWER: DCH4_LOW (Bit 24)                */
#define ADC1_DCHTH1_4_LOWER_DCH4_LOW_Msk  (0xff000000UL)            /*!< ADC1 DCHTH1_4_LOWER: DCH4_LOW (Bitfield-Mask: 0xff)   */
#define ADC1_DCHTH1_4_LOWER_DCH3_LOW_Pos  (16UL)                    /*!< ADC1 DCHTH1_4_LOWER: DCH3_LOW (Bit 16)                */
#define ADC1_DCHTH1_4_LOWER_DCH3_LOW_Msk  (0xff0000UL)              /*!< ADC1 DCHTH1_4_LOWER: DCH3_LOW (Bitfield-Mask: 0xff)   */
#define ADC1_DCHTH1_4_LOWER_DCH2_LOW_Pos  (8UL)                     /*!< ADC1 DCHTH1_4_LOWER: DCH2_LOW (Bit 8)                 */
#define ADC1_DCHTH1_4_LOWER_DCH2_LOW_Msk  (0xff00UL)                /*!< ADC1 DCHTH1_4_LOWER: DCH2_LOW (Bitfield-Mask: 0xff)   */
#define ADC1_DCHTH1_4_LOWER_DCH1_LOW_Pos  (0UL)                     /*!< ADC1 DCHTH1_4_LOWER: DCH1_LOW (Bit 0)                 */
#define ADC1_DCHTH1_4_LOWER_DCH1_LOW_Msk  (0xffUL)                  /*!< ADC1 DCHTH1_4_LOWER: DCH1_LOW (Bitfield-Mask: 0xff)   */
/* =====================================================  CNT0_3_LOWER  ====================================================== */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH3_Pos (27UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH3 (Bit 27)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH3_Msk (0x18000000UL)            /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH3 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH3_Pos  (24UL)                    /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH3 (Bit 24)                */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH3_Msk  (0x7000000UL)             /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH3 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH2_Pos (19UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH2 (Bit 19)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH2_Msk (0x180000UL)              /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH2 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH2_Pos  (16UL)                    /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH2 (Bit 16)                */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH2_Msk  (0x70000UL)               /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH2 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH1_Pos (11UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH1 (Bit 11)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH1_Msk (0x1800UL)                /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH1 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH1_Pos  (8UL)                     /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH1 (Bit 8)                 */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH1_Msk  (0x700UL)                 /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH1 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH0_Pos (3UL)                     /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH0 (Bit 3)                */
#define ADC1_CNT0_3_LOWER_HYST_LO_CH0_Msk (0x18UL)                  /*!< ADC1 CNT0_3_LOWER: HYST_LO_CH0 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH0_Pos  (0UL)                     /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH0 (Bit 0)                 */
#define ADC1_CNT0_3_LOWER_CNT_LO_CH0_Msk  (0x7UL)                   /*!< ADC1 CNT0_3_LOWER: CNT_LO_CH0 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT4_7_LOWER  ====================================================== */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH7_Pos (27UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH7 (Bit 27)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH7_Msk (0x18000000UL)            /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH7 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH7_Pos  (24UL)                    /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH7 (Bit 24)                */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH7_Msk  (0x7000000UL)             /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH7 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH6_Pos (19UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH6 (Bit 19)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH6_Msk (0x180000UL)              /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH6 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH6_Pos  (16UL)                    /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH6 (Bit 16)                */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH6_Msk  (0x70000UL)               /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH6 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH5_Pos (11UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH5 (Bit 11)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH5_Msk (0x1800UL)                /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH5 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH5_Pos  (8UL)                     /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH5 (Bit 8)                 */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH5_Msk  (0x700UL)                 /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH5 (Bitfield-Mask: 0x07)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH4_Pos (3UL)                     /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH4 (Bit 3)                */
#define ADC1_CNT4_7_LOWER_HYST_LO_CH4_Msk (0x18UL)                  /*!< ADC1 CNT4_7_LOWER: HYST_LO_CH4 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH4_Pos  (0UL)                     /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH4 (Bit 0)                 */
#define ADC1_CNT4_7_LOWER_CNT_LO_CH4_Msk  (0x7UL)                   /*!< ADC1 CNT4_7_LOWER: CNT_LO_CH4 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT8_11_LOWER  ===================================================== */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH11_Pos (27UL)                  /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH11 (Bit 27)             */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH11_Msk (0x18000000UL)          /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH11 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH11_Pos (24UL)                   /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH11 (Bit 24)              */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH11_Msk (0x7000000UL)            /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH11 (Bitfield-Mask: 0x07) */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH10_Pos (19UL)                  /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH10 (Bit 19)             */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH10_Msk (0x180000UL)            /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH10 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH10_Pos (16UL)                   /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH10 (Bit 16)              */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH10_Msk (0x70000UL)              /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH10 (Bitfield-Mask: 0x07) */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH9_Pos (11UL)                   /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH9 (Bit 11)              */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH9_Msk (0x1800UL)               /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH9 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH9_Pos (8UL)                     /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH9 (Bit 8)                */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH9_Msk (0x700UL)                 /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH9 (Bitfield-Mask: 0x07)  */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH8_Pos (3UL)                    /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH8 (Bit 3)               */
#define ADC1_CNT8_11_LOWER_HYST_LO_CH8_Msk (0x18UL)                 /*!< ADC1 CNT8_11_LOWER: HYST_LO_CH8 (Bitfield-Mask: 0x03) */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH8_Pos (0UL)                     /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH8 (Bit 0)                */
#define ADC1_CNT8_11_LOWER_CNT_LO_CH8_Msk (0x7UL)                   /*!< ADC1 CNT8_11_LOWER: CNT_LO_CH8 (Bitfield-Mask: 0x07)  */
/* ====================================================  DCHCNT1_4_LOWER  ==================================================== */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH4_Pos (27UL)                /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH4 (Bit 27)           */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH4_Msk (0x18000000UL)        /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH4 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH4_Pos (24UL)                 /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH4 (Bit 24)            */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH4_Msk (0x7000000UL)          /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH4 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH3_Pos (19UL)                /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH3 (Bit 19)           */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH3_Msk (0x180000UL)          /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH3 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH3_Pos (16UL)                 /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH3 (Bit 16)            */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH3_Msk (0x70000UL)            /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH3 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH2_Pos (11UL)                /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH2 (Bit 11)           */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH2_Msk (0x1800UL)            /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH2 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH2_Pos (8UL)                  /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH2 (Bit 8)             */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH2_Msk (0x700UL)              /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH2 (Bitfield-Mask: 0x07) */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH1_Pos (3UL)                 /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH1 (Bit 3)            */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH1_Msk (0x18UL)              /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH1 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH1_Pos (0UL)                  /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH1 (Bit 0)             */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH1_Msk (0x7UL)                /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH1 (Bitfield-Mask: 0x07) */
/* ========================================================  IRQS_1  ========================================================= */
#define ADC1_IRQS_1_DU4UP_IS_Pos          (31UL)                    /*!< ADC1 IRQS_1: DU4UP_IS (Bit 31)                        */
#define ADC1_IRQS_1_DU4UP_IS_Msk          (0x80000000UL)            /*!< ADC1 IRQS_1: DU4UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU4LO_IS_Pos          (30UL)                    /*!< ADC1 IRQS_1: DU4LO_IS (Bit 30)                        */
#define ADC1_IRQS_1_DU4LO_IS_Msk          (0x40000000UL)            /*!< ADC1 IRQS_1: DU4LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU3UP_IS_Pos          (29UL)                    /*!< ADC1 IRQS_1: DU3UP_IS (Bit 29)                        */
#define ADC1_IRQS_1_DU3UP_IS_Msk          (0x20000000UL)            /*!< ADC1 IRQS_1: DU3UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU3LO_IS_Pos          (28UL)                    /*!< ADC1 IRQS_1: DU3LO_IS (Bit 28)                        */
#define ADC1_IRQS_1_DU3LO_IS_Msk          (0x10000000UL)            /*!< ADC1 IRQS_1: DU3LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU2UP_IS_Pos          (27UL)                    /*!< ADC1 IRQS_1: DU2UP_IS (Bit 27)                        */
#define ADC1_IRQS_1_DU2UP_IS_Msk          (0x8000000UL)             /*!< ADC1 IRQS_1: DU2UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU2LO_IS_Pos          (26UL)                    /*!< ADC1 IRQS_1: DU2LO_IS (Bit 26)                        */
#define ADC1_IRQS_1_DU2LO_IS_Msk          (0x4000000UL)             /*!< ADC1 IRQS_1: DU2LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU1UP_IS_Pos          (25UL)                    /*!< ADC1 IRQS_1: DU1UP_IS (Bit 25)                        */
#define ADC1_IRQS_1_DU1UP_IS_Msk          (0x2000000UL)             /*!< ADC1 IRQS_1: DU1UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU1LO_IS_Pos          (24UL)                    /*!< ADC1 IRQS_1: DU1LO_IS (Bit 24)                        */
#define ADC1_IRQS_1_DU1LO_IS_Msk          (0x1000000UL)             /*!< ADC1 IRQS_1: DU1LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_ESM_IS_Pos            (17UL)                    /*!< ADC1 IRQS_1: ESM_IS (Bit 17)                          */
#define ADC1_IRQS_1_ESM_IS_Msk            (0x20000UL)               /*!< ADC1 IRQS_1: ESM_IS (Bitfield-Mask: 0x01)             */
#define ADC1_IRQS_1_EIM_IS_Pos            (16UL)                    /*!< ADC1 IRQS_1: EIM_IS (Bit 16)                          */
#define ADC1_IRQS_1_EIM_IS_Msk            (0x10000UL)               /*!< ADC1 IRQS_1: EIM_IS (Bitfield-Mask: 0x01)             */
#define ADC1_IRQS_1_P2_0_IS_Pos           (12UL)                    /*!< ADC1 IRQS_1: P2_0_IS (Bit 12)                         */
#define ADC1_IRQS_1_P2_0_IS_Msk           (0x1000UL)                /*!< ADC1 IRQS_1: P2_0_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_P2_7_IS_Pos           (11UL)                    /*!< ADC1 IRQS_1: P2_7_IS (Bit 11)                         */
#define ADC1_IRQS_1_P2_7_IS_Msk           (0x800UL)                 /*!< ADC1 IRQS_1: P2_7_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_P2_6_IS_Pos           (10UL)                    /*!< ADC1 IRQS_1: P2_6_IS (Bit 10)                         */
#define ADC1_IRQS_1_P2_6_IS_Msk           (0x400UL)                 /*!< ADC1 IRQS_1: P2_6_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_P2_3_IS_Pos           (9UL)                     /*!< ADC1 IRQS_1: P2_3_IS (Bit 9)                          */
#define ADC1_IRQS_1_P2_3_IS_Msk           (0x200UL)                 /*!< ADC1 IRQS_1: P2_3_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_P2_2_IS_Pos           (8UL)                     /*!< ADC1 IRQS_1: P2_2_IS (Bit 8)                          */
#define ADC1_IRQS_1_P2_2_IS_Msk           (0x100UL)                 /*!< ADC1 IRQS_1: P2_2_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_P2_1_IS_Pos           (7UL)                     /*!< ADC1 IRQS_1: P2_1_IS (Bit 7)                          */
#define ADC1_IRQS_1_P2_1_IS_Msk           (0x80UL)                  /*!< ADC1 IRQS_1: P2_1_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_MON5_IS_Pos           (6UL)                     /*!< ADC1 IRQS_1: MON5_IS (Bit 6)                          */
#define ADC1_IRQS_1_MON5_IS_Msk           (0x40UL)                  /*!< ADC1 IRQS_1: MON5_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_MON4_IS_Pos           (5UL)                     /*!< ADC1 IRQS_1: MON4_IS (Bit 5)                          */
#define ADC1_IRQS_1_MON4_IS_Msk           (0x20UL)                  /*!< ADC1 IRQS_1: MON4_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_MON3_IS_Pos           (4UL)                     /*!< ADC1 IRQS_1: MON3_IS (Bit 4)                          */
#define ADC1_IRQS_1_MON3_IS_Msk           (0x10UL)                  /*!< ADC1 IRQS_1: MON3_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_MON2_IS_Pos           (3UL)                     /*!< ADC1 IRQS_1: MON2_IS (Bit 3)                          */
#define ADC1_IRQS_1_MON2_IS_Msk           (0x8UL)                   /*!< ADC1 IRQS_1: MON2_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_MON1_IS_Pos           (2UL)                     /*!< ADC1 IRQS_1: MON1_IS (Bit 2)                          */
#define ADC1_IRQS_1_MON1_IS_Msk           (0x4UL)                   /*!< ADC1 IRQS_1: MON1_IS (Bitfield-Mask: 0x01)            */
#define ADC1_IRQS_1_VS_IS_Pos             (1UL)                     /*!< ADC1 IRQS_1: VS_IS (Bit 1)                            */
#define ADC1_IRQS_1_VS_IS_Msk             (0x2UL)                   /*!< ADC1 IRQS_1: VS_IS (Bitfield-Mask: 0x01)              */
#define ADC1_IRQS_1_VBATSEN_IS_Pos        (0UL)                     /*!< ADC1 IRQS_1: VBATSEN_IS (Bit 0)                       */
#define ADC1_IRQS_1_VBATSEN_IS_Msk        (0x1UL)                   /*!< ADC1 IRQS_1: VBATSEN_IS (Bitfield-Mask: 0x01)         */
/* ========================================================  IRQS_2  ========================================================= */
#define ADC1_IRQS_2_P2_7_UP_IS_Pos        (27UL)                    /*!< ADC1 IRQS_2: P2_7_UP_IS (Bit 27)                      */
#define ADC1_IRQS_2_P2_7_UP_IS_Msk        (0x8000000UL)             /*!< ADC1 IRQS_2: P2_7_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_6_UP_IS_Pos        (26UL)                    /*!< ADC1 IRQS_2: P2_6_UP_IS (Bit 26)                      */
#define ADC1_IRQS_2_P2_6_UP_IS_Msk        (0x4000000UL)             /*!< ADC1 IRQS_2: P2_6_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_3_UP_IS_Pos        (25UL)                    /*!< ADC1 IRQS_2: P2_3_UP_IS (Bit 25)                      */
#define ADC1_IRQS_2_P2_3_UP_IS_Msk        (0x2000000UL)             /*!< ADC1 IRQS_2: P2_3_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_2_UP_IS_Pos        (24UL)                    /*!< ADC1 IRQS_2: P2_2_UP_IS (Bit 24)                      */
#define ADC1_IRQS_2_P2_2_UP_IS_Msk        (0x1000000UL)             /*!< ADC1 IRQS_2: P2_2_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_1_UP_IS_Pos        (23UL)                    /*!< ADC1 IRQS_2: P2_1_UP_IS (Bit 23)                      */
#define ADC1_IRQS_2_P2_1_UP_IS_Msk        (0x800000UL)              /*!< ADC1 IRQS_2: P2_1_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON5_UP_IS_Pos        (22UL)                    /*!< ADC1 IRQS_2: MON5_UP_IS (Bit 22)                      */
#define ADC1_IRQS_2_MON5_UP_IS_Msk        (0x400000UL)              /*!< ADC1 IRQS_2: MON5_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON4_UP_IS_Pos        (21UL)                    /*!< ADC1 IRQS_2: MON4_UP_IS (Bit 21)                      */
#define ADC1_IRQS_2_MON4_UP_IS_Msk        (0x200000UL)              /*!< ADC1 IRQS_2: MON4_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON3_UP_IS_Pos        (20UL)                    /*!< ADC1 IRQS_2: MON3_UP_IS (Bit 20)                      */
#define ADC1_IRQS_2_MON3_UP_IS_Msk        (0x100000UL)              /*!< ADC1 IRQS_2: MON3_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON2_UP_IS_Pos        (19UL)                    /*!< ADC1 IRQS_2: MON2_UP_IS (Bit 19)                      */
#define ADC1_IRQS_2_MON2_UP_IS_Msk        (0x80000UL)               /*!< ADC1 IRQS_2: MON2_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON1_UP_IS_Pos        (18UL)                    /*!< ADC1 IRQS_2: MON1_UP_IS (Bit 18)                      */
#define ADC1_IRQS_2_MON1_UP_IS_Msk        (0x40000UL)               /*!< ADC1 IRQS_2: MON1_UP_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_VS_UP_IS_Pos          (17UL)                    /*!< ADC1 IRQS_2: VS_UP_IS (Bit 17)                        */
#define ADC1_IRQS_2_VS_UP_IS_Msk          (0x20000UL)               /*!< ADC1 IRQS_2: VS_UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_2_P2_7_LO_IS_Pos        (11UL)                    /*!< ADC1 IRQS_2: P2_7_LO_IS (Bit 11)                      */
#define ADC1_IRQS_2_P2_7_LO_IS_Msk        (0x800UL)                 /*!< ADC1 IRQS_2: P2_7_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_6_LO_IS_Pos        (10UL)                    /*!< ADC1 IRQS_2: P2_6_LO_IS (Bit 10)                      */
#define ADC1_IRQS_2_P2_6_LO_IS_Msk        (0x400UL)                 /*!< ADC1 IRQS_2: P2_6_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_3_LO_IS_Pos        (9UL)                     /*!< ADC1 IRQS_2: P2_3_LO_IS (Bit 9)                       */
#define ADC1_IRQS_2_P2_3_LO_IS_Msk        (0x200UL)                 /*!< ADC1 IRQS_2: P2_3_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_2_LO_IS_Pos        (8UL)                     /*!< ADC1 IRQS_2: P2_2_LO_IS (Bit 8)                       */
#define ADC1_IRQS_2_P2_2_LO_IS_Msk        (0x100UL)                 /*!< ADC1 IRQS_2: P2_2_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_P2_1_LO_IS_Pos        (7UL)                     /*!< ADC1 IRQS_2: P2_1_LO_IS (Bit 7)                       */
#define ADC1_IRQS_2_P2_1_LO_IS_Msk        (0x80UL)                  /*!< ADC1 IRQS_2: P2_1_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON5_LO_IS_Pos        (6UL)                     /*!< ADC1 IRQS_2: MON5_LO_IS (Bit 6)                       */
#define ADC1_IRQS_2_MON5_LO_IS_Msk        (0x40UL)                  /*!< ADC1 IRQS_2: MON5_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON4_LO_IS_Pos        (5UL)                     /*!< ADC1 IRQS_2: MON4_LO_IS (Bit 5)                       */
#define ADC1_IRQS_2_MON4_LO_IS_Msk        (0x20UL)                  /*!< ADC1 IRQS_2: MON4_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON3_LO_IS_Pos        (4UL)                     /*!< ADC1 IRQS_2: MON3_LO_IS (Bit 4)                       */
#define ADC1_IRQS_2_MON3_LO_IS_Msk        (0x10UL)                  /*!< ADC1 IRQS_2: MON3_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON2_LO_IS_Pos        (3UL)                     /*!< ADC1 IRQS_2: MON2_LO_IS (Bit 3)                       */
#define ADC1_IRQS_2_MON2_LO_IS_Msk        (0x8UL)                   /*!< ADC1 IRQS_2: MON2_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_MON1_LO_IS_Pos        (2UL)                     /*!< ADC1 IRQS_2: MON1_LO_IS (Bit 2)                       */
#define ADC1_IRQS_2_MON1_LO_IS_Msk        (0x4UL)                   /*!< ADC1 IRQS_2: MON1_LO_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_2_VS_LO_IS_Pos          (1UL)                     /*!< ADC1 IRQS_2: VS_LO_IS (Bit 1)                         */
#define ADC1_IRQS_2_VS_LO_IS_Msk          (0x2UL)                   /*!< ADC1 IRQS_2: VS_LO_IS (Bitfield-Mask: 0x01)           */
