zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* =========================================================  STS_1  ========================================================= */
#define ADC1_STS_1_DU4UP_STS_Pos          (31UL)                    /*!< ADC1 STS_1: DU4UP_STS (Bit 31)                        */
#define ADC1_STS_1_DU4UP_STS_Msk          (0x80000000UL)            /*!< ADC1 STS_1: DU4UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU4LO_STS_Pos          (30UL)                    /*!< ADC1 STS_1: DU4LO_STS (Bit 30)                        */
#define ADC1_STS_1_DU4LO_STS_Msk          (0x40000000UL)            /*!< ADC1 STS_1: DU4LO_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU3UP_STS_Pos          (29UL)                    /*!< ADC1 STS_1: DU3UP_STS (Bit 29)                        */
#define ADC1_STS_1_DU3UP_STS_Msk          (0x20000000UL)            /*!< ADC1 STS_1: DU3UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU3LO_STS_Pos          (28UL)                    /*!< ADC1 STS_1: DU3LO_STS (Bit 28)                        */
#define ADC1_STS_1_DU3LO_STS_Msk          (0x10000000UL)            /*!< ADC1 STS_1: DU3LO_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU2UP_STS_Pos          (27UL)                    /*!< ADC1 STS_1: DU2UP_STS (Bit 27)                        */
#define ADC1_STS_1_DU2UP_STS_Msk          (0x8000000UL)             /*!< ADC1 STS_1: DU2UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU2LO_STS_Pos          (26UL)                    /*!< ADC1 STS_1: DU2LO_STS (Bit 26)                        */
#define ADC1_STS_1_DU2LO_STS_Msk          (0x4000000UL)             /*!< ADC1 STS_1: DU2LO_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU1UP_STS_Pos          (25UL)                    /*!< ADC1 STS_1: DU1UP_STS (Bit 25)                        */
#define ADC1_STS_1_DU1UP_STS_Msk          (0x2000000UL)             /*!< ADC1 STS_1: DU1UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU1LO_STS_Pos          (24UL)                    /*!< ADC1 STS_1: DU1LO_STS (Bit 24)                        */
#define ADC1_STS_1_DU1LO_STS_Msk          (0x1000000UL)             /*!< ADC1 STS_1: DU1LO_STS (Bitfield-Mask: 0x01)           */
/* =========================================================  STS_2  ========================================================= */
#define ADC1_STS_2_P2_7_UP_STS_Pos        (27UL)                    /*!< ADC1 STS_2: P2_7_UP_STS (Bit 27)                      */
#define ADC1_STS_2_P2_7_UP_STS_Msk        (0x8000000UL)             /*!< ADC1 STS_2: P2_7_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_6_UP_STS_Pos        (26UL)                    /*!< ADC1 STS_2: P2_6_UP_STS (Bit 26)                      */
#define ADC1_STS_2_P2_6_UP_STS_Msk        (0x4000000UL)             /*!< ADC1 STS_2: P2_6_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_3_UP_STS_Pos        (25UL)                    /*!< ADC1 STS_2: P2_3_UP_STS (Bit 25)                      */
#define ADC1_STS_2_P2_3_UP_STS_Msk        (0x2000000UL)             /*!< ADC1 STS_2: P2_3_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_2_UP_STS_Pos        (24UL)                    /*!< ADC1 STS_2: P2_2_UP_STS (Bit 24)                      */
#define ADC1_STS_2_P2_2_UP_STS_Msk        (0x1000000UL)             /*!< ADC1 STS_2: P2_2_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_1_UP_STS_Pos        (23UL)                    /*!< ADC1 STS_2: P2_1_UP_STS (Bit 23)                      */
#define ADC1_STS_2_P2_1_UP_STS_Msk        (0x800000UL)              /*!< ADC1 STS_2: P2_1_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON5_UP_STS_Pos        (22UL)                    /*!< ADC1 STS_2: MON5_UP_STS (Bit 22)                      */
#define ADC1_STS_2_MON5_UP_STS_Msk        (0x400000UL)              /*!< ADC1 STS_2: MON5_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON4_UP_STS_Pos        (21UL)                    /*!< ADC1 STS_2: MON4_UP_STS (Bit 21)                      */
#define ADC1_STS_2_MON4_UP_STS_Msk        (0x200000UL)              /*!< ADC1 STS_2: MON4_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON3_UP_STS_Pos        (20UL)                    /*!< ADC1 STS_2: MON3_UP_STS (Bit 20)                      */
#define ADC1_STS_2_MON3_UP_STS_Msk        (0x100000UL)              /*!< ADC1 STS_2: MON3_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON2_UP_STS_Pos        (19UL)                    /*!< ADC1 STS_2: MON2_UP_STS (Bit 19)                      */
#define ADC1_STS_2_MON2_UP_STS_Msk        (0x80000UL)               /*!< ADC1 STS_2: MON2_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON1_UP_STS_Pos        (18UL)                    /*!< ADC1 STS_2: MON1_UP_STS (Bit 18)                      */
#define ADC1_STS_2_MON1_UP_STS_Msk        (0x40000UL)               /*!< ADC1 STS_2: MON1_UP_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_VS_UP_STS_Pos          (17UL)                    /*!< ADC1 STS_2: VS_UP_STS (Bit 17)                        */
#define ADC1_STS_2_VS_UP_STS_Msk          (0x20000UL)               /*!< ADC1 STS_2: VS_UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_2_P2_7_LO_STS_Pos        (11UL)                    /*!< ADC1 STS_2: P2_7_LO_STS (Bit 11)                      */
#define ADC1_STS_2_P2_7_LO_STS_Msk        (0x800UL)                 /*!< ADC1 STS_2: P2_7_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_6_LO_STS_Pos        (10UL)                    /*!< ADC1 STS_2: P2_6_LO_STS (Bit 10)                      */
#define ADC1_STS_2_P2_6_LO_STS_Msk        (0x400UL)                 /*!< ADC1 STS_2: P2_6_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_3_LO_STS_Pos        (9UL)                     /*!< ADC1 STS_2: P2_3_LO_STS (Bit 9)                       */
#define ADC1_STS_2_P2_3_LO_STS_Msk        (0x200UL)                 /*!< ADC1 STS_2: P2_3_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_2_LO_STS_Pos        (8UL)                     /*!< ADC1 STS_2: P2_2_LO_STS (Bit 8)                       */
#define ADC1_STS_2_P2_2_LO_STS_Msk        (0x100UL)                 /*!< ADC1 STS_2: P2_2_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_P2_1_LO_STS_Pos        (7UL)                     /*!< ADC1 STS_2: P2_1_LO_STS (Bit 7)                       */
#define ADC1_STS_2_P2_1_LO_STS_Msk        (0x80UL)                  /*!< ADC1 STS_2: P2_1_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON5_LO_STS_Pos        (6UL)                     /*!< ADC1 STS_2: MON5_LO_STS (Bit 6)                       */
#define ADC1_STS_2_MON5_LO_STS_Msk        (0x40UL)                  /*!< ADC1 STS_2: MON5_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON4_LO_STS_Pos        (5UL)                     /*!< ADC1 STS_2: MON4_LO_STS (Bit 5)                       */
#define ADC1_STS_2_MON4_LO_STS_Msk        (0x20UL)                  /*!< ADC1 STS_2: MON4_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON3_LO_STS_Pos        (4UL)                     /*!< ADC1 STS_2: MON3_LO_STS (Bit 4)                       */
#define ADC1_STS_2_MON3_LO_STS_Msk        (0x10UL)                  /*!< ADC1 STS_2: MON3_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON2_LO_STS_Pos        (3UL)                     /*!< ADC1 STS_2: MON2_LO_STS (Bit 3)                       */
#define ADC1_STS_2_MON2_LO_STS_Msk        (0x8UL)                   /*!< ADC1 STS_2: MON2_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_MON1_LO_STS_Pos        (2UL)                     /*!< ADC1 STS_2: MON1_LO_STS (Bit 2)                       */
#define ADC1_STS_2_MON1_LO_STS_Msk        (0x4UL)                   /*!< ADC1 STS_2: MON1_LO_STS (Bitfield-Mask: 0x01)         */
#define ADC1_STS_2_VS_LO_STS_Pos          (1UL)                     /*!< ADC1 STS_2: VS_LO_STS (Bit 1)                         */
#define ADC1_STS_2_VS_LO_STS_Msk          (0x2UL)                   /*!< ADC1 STS_2: VS_LO_STS (Bitfield-Mask: 0x01)           */
/* =======================================================  STSCLR_1  ======================================================== */
#define ADC1_STSCLR_1_DU4UP_SC_Pos        (31UL)                    /*!< ADC1 STSCLR_1: DU4UP_SC (Bit 31)                      */
#define ADC1_STSCLR_1_DU4UP_SC_Msk        (0x80000000UL)            /*!< ADC1 STSCLR_1: DU4UP_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU4LO_SC_Pos        (30UL)                    /*!< ADC1 STSCLR_1: DU4LO_SC (Bit 30)                      */
#define ADC1_STSCLR_1_DU4LO_SC_Msk        (0x40000000UL)            /*!< ADC1 STSCLR_1: DU4LO_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU3UP_SC_Pos        (29UL)                    /*!< ADC1 STSCLR_1: DU3UP_SC (Bit 29)                      */
#define ADC1_STSCLR_1_DU3UP_SC_Msk        (0x20000000UL)            /*!< ADC1 STSCLR_1: DU3UP_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU3LO_SC_Pos        (28UL)                    /*!< ADC1 STSCLR_1: DU3LO_SC (Bit 28)                      */
#define ADC1_STSCLR_1_DU3LO_SC_Msk        (0x10000000UL)            /*!< ADC1 STSCLR_1: DU3LO_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU2UP_SC_Pos        (27UL)                    /*!< ADC1 STSCLR_1: DU2UP_SC (Bit 27)                      */
#define ADC1_STSCLR_1_DU2UP_SC_Msk        (0x8000000UL)             /*!< ADC1 STSCLR_1: DU2UP_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU2LO_SC_Pos        (26UL)                    /*!< ADC1 STSCLR_1: DU2LO_SC (Bit 26)                      */
#define ADC1_STSCLR_1_DU2LO_SC_Msk        (0x4000000UL)             /*!< ADC1 STSCLR_1: DU2LO_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU1UP_SC_Pos        (25UL)                    /*!< ADC1 STSCLR_1: DU1UP_SC (Bit 25)                      */
#define ADC1_STSCLR_1_DU1UP_SC_Msk        (0x2000000UL)             /*!< ADC1 STSCLR_1: DU1UP_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU1LO_SC_Pos        (24UL)                    /*!< ADC1 STSCLR_1: DU1LO_SC (Bit 24)                      */
#define ADC1_STSCLR_1_DU1LO_SC_Msk        (0x1000000UL)             /*!< ADC1 STSCLR_1: DU1LO_SC (Bitfield-Mask: 0x01)         */
/* =======================================================  IRQCLR_1  ======================================================== */
#define ADC1_IRQCLR_1_DU4UP_ISC_Pos       (31UL)                    /*!< ADC1 IRQCLR_1: DU4UP_ISC (Bit 31)                     */
#define ADC1_IRQCLR_1_DU4UP_ISC_Msk       (0x80000000UL)            /*!< ADC1 IRQCLR_1: DU4UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU4LO_ISC_Pos       (30UL)                    /*!< ADC1 IRQCLR_1: DU4LO_ISC (Bit 30)                     */
#define ADC1_IRQCLR_1_DU4LO_ISC_Msk       (0x40000000UL)            /*!< ADC1 IRQCLR_1: DU4LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU3UP_ISC_Pos       (29UL)                    /*!< ADC1 IRQCLR_1: DU3UP_ISC (Bit 29)                     */
#define ADC1_IRQCLR_1_DU3UP_ISC_Msk       (0x20000000UL)            /*!< ADC1 IRQCLR_1: DU3UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU3LO_ISC_Pos       (28UL)                    /*!< ADC1 IRQCLR_1: DU3LO_ISC (Bit 28)                     */
#define ADC1_IRQCLR_1_DU3LO_ISC_Msk       (0x10000000UL)            /*!< ADC1 IRQCLR_1: DU3LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU2UP_ISC_Pos       (27UL)                    /*!< ADC1 IRQCLR_1: DU2UP_ISC (Bit 27)                     */
#define ADC1_IRQCLR_1_DU2UP_ISC_Msk       (0x8000000UL)             /*!< ADC1 IRQCLR_1: DU2UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU2LO_ISC_Pos       (26UL)                    /*!< ADC1 IRQCLR_1: DU2LO_ISC (Bit 26)                     */
#define ADC1_IRQCLR_1_DU2LO_ISC_Msk       (0x4000000UL)             /*!< ADC1 IRQCLR_1: DU2LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU1UP_ISC_Pos       (25UL)                    /*!< ADC1 IRQCLR_1: DU1UP_ISC (Bit 25)                     */
#define ADC1_IRQCLR_1_DU1UP_ISC_Msk       (0x2000000UL)             /*!< ADC1 IRQCLR_1: DU1UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU1LO_ISC_Pos       (24UL)                    /*!< ADC1 IRQCLR_1: DU1LO_ISC (Bit 24)                     */
#define ADC1_IRQCLR_1_DU1LO_ISC_Msk       (0x1000000UL)             /*!< ADC1 IRQCLR_1: DU1LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_ESM_ISC_Pos         (17UL)                    /*!< ADC1 IRQCLR_1: ESM_ISC (Bit 17)                       */
#define ADC1_IRQCLR_1_ESM_ISC_Msk         (0x20000UL)               /*!< ADC1 IRQCLR_1: ESM_ISC (Bitfield-Mask: 0x01)          */
#define ADC1_IRQCLR_1_EIM_ISC_Pos         (16UL)                    /*!< ADC1 IRQCLR_1: EIM_ISC (Bit 16)                       */
#define ADC1_IRQCLR_1_EIM_ISC_Msk         (0x10000UL)               /*!< ADC1 IRQCLR_1: EIM_ISC (Bitfield-Mask: 0x01)          */
#define ADC1_IRQCLR_1_P2_0_ISC_Pos        (12UL)                    /*!< ADC1 IRQCLR_1: P2_0_ISC (Bit 12)                      */
#define ADC1_IRQCLR_1_P2_0_ISC_Msk        (0x1000UL)                /*!< ADC1 IRQCLR_1: P2_0_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_P2_7_ISC_Pos        (11UL)                    /*!< ADC1 IRQCLR_1: P2_7_ISC (Bit 11)                      */
#define ADC1_IRQCLR_1_P2_7_ISC_Msk        (0x800UL)                 /*!< ADC1 IRQCLR_1: P2_7_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_P2_6_ISC_Pos        (10UL)                    /*!< ADC1 IRQCLR_1: P2_6_ISC (Bit 10)                      */
#define ADC1_IRQCLR_1_P2_6_ISC_Msk        (0x400UL)                 /*!< ADC1 IRQCLR_1: P2_6_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_P2_3_ISC_Pos        (9UL)                     /*!< ADC1 IRQCLR_1: P2_3_ISC (Bit 9)                       */
#define ADC1_IRQCLR_1_P2_3_ISC_Msk        (0x200UL)                 /*!< ADC1 IRQCLR_1: P2_3_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_P2_2_ISC_Pos        (8UL)                     /*!< ADC1 IRQCLR_1: P2_2_ISC (Bit 8)                       */
#define ADC1_IRQCLR_1_P2_2_ISC_Msk        (0x100UL)                 /*!< ADC1 IRQCLR_1: P2_2_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_P2_1_ISC_Pos        (7UL)                     /*!< ADC1 IRQCLR_1: P2_1_ISC (Bit 7)                       */
#define ADC1_IRQCLR_1_P2_1_ISC_Msk        (0x80UL)                  /*!< ADC1 IRQCLR_1: P2_1_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_MON5_ISC_Pos        (6UL)                     /*!< ADC1 IRQCLR_1: MON5_ISC (Bit 6)                       */
#define ADC1_IRQCLR_1_MON5_ISC_Msk        (0x40UL)                  /*!< ADC1 IRQCLR_1: MON5_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_MON4_ISC_Pos        (5UL)                     /*!< ADC1 IRQCLR_1: MON4_ISC (Bit 5)                       */
#define ADC1_IRQCLR_1_MON4_ISC_Msk        (0x20UL)                  /*!< ADC1 IRQCLR_1: MON4_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_MON3_ISC_Pos        (4UL)                     /*!< ADC1 IRQCLR_1: MON3_ISC (Bit 4)                       */
#define ADC1_IRQCLR_1_MON3_ISC_Msk        (0x10UL)                  /*!< ADC1 IRQCLR_1: MON3_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_MON2_ISC_Pos        (3UL)                     /*!< ADC1 IRQCLR_1: MON2_ISC (Bit 3)                       */
#define ADC1_IRQCLR_1_MON2_ISC_Msk        (0x8UL)                   /*!< ADC1 IRQCLR_1: MON2_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_MON1_ISC_Pos        (2UL)                     /*!< ADC1 IRQCLR_1: MON1_ISC (Bit 2)                       */
#define ADC1_IRQCLR_1_MON1_ISC_Msk        (0x4UL)                   /*!< ADC1 IRQCLR_1: MON1_ISC (Bitfield-Mask: 0x01)         */
#define ADC1_IRQCLR_1_VS_ISC_Pos          (1UL)                     /*!< ADC1 IRQCLR_1: VS_ISC (Bit 1)                         */
#define ADC1_IRQCLR_1_VS_ISC_Msk          (0x2UL)                   /*!< ADC1 IRQCLR_1: VS_ISC (Bitfield-Mask: 0x01)           */
#define ADC1_IRQCLR_1_VBATSEN_ISC_Pos     (0UL)                     /*!< ADC1 IRQCLR_1: VBATSEN_ISC (Bit 0)                    */
#define ADC1_IRQCLR_1_VBATSEN_ISC_Msk     (0x1UL)                   /*!< ADC1 IRQCLR_1: VBATSEN_ISC (Bitfield-Mask: 0x01)      */
/* =======================================================  IRQCLR_2  ======================================================== */
#define ADC1_IRQCLR_2_P2_7_UP_ISC_Pos     (27UL)                    /*!< ADC1 IRQCLR_2: P2_7_UP_ISC (Bit 27)                   */
#define ADC1_IRQCLR_2_P2_7_UP_ISC_Msk     (0x8000000UL)             /*!< ADC1 IRQCLR_2: P2_7_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_6_UP_ISC_Pos     (26UL)                    /*!< ADC1 IRQCLR_2: P2_6_UP_ISC (Bit 26)                   */
#define ADC1_IRQCLR_2_P2_6_UP_ISC_Msk     (0x4000000UL)             /*!< ADC1 IRQCLR_2: P2_6_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_3_UP_ISC_Pos     (25UL)                    /*!< ADC1 IRQCLR_2: P2_3_UP_ISC (Bit 25)                   */
#define ADC1_IRQCLR_2_P2_3_UP_ISC_Msk     (0x2000000UL)             /*!< ADC1 IRQCLR_2: P2_3_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_2_UP_ISC_Pos     (24UL)                    /*!< ADC1 IRQCLR_2: P2_2_UP_ISC (Bit 24)                   */
#define ADC1_IRQCLR_2_P2_2_UP_ISC_Msk     (0x1000000UL)             /*!< ADC1 IRQCLR_2: P2_2_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_1_UP_ISC_Pos     (23UL)                    /*!< ADC1 IRQCLR_2: P2_1_UP_ISC (Bit 23)                   */
#define ADC1_IRQCLR_2_P2_1_UP_ISC_Msk     (0x800000UL)              /*!< ADC1 IRQCLR_2: P2_1_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON5_UP_ISC_Pos     (22UL)                    /*!< ADC1 IRQCLR_2: MON5_UP_ISC (Bit 22)                   */
#define ADC1_IRQCLR_2_MON5_UP_ISC_Msk     (0x400000UL)              /*!< ADC1 IRQCLR_2: MON5_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON4_UP_ISC_Pos     (21UL)                    /*!< ADC1 IRQCLR_2: MON4_UP_ISC (Bit 21)                   */
#define ADC1_IRQCLR_2_MON4_UP_ISC_Msk     (0x200000UL)              /*!< ADC1 IRQCLR_2: MON4_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON3_UP_ISC_Pos     (20UL)                    /*!< ADC1 IRQCLR_2: MON3_UP_ISC (Bit 20)                   */
#define ADC1_IRQCLR_2_MON3_UP_ISC_Msk     (0x100000UL)              /*!< ADC1 IRQCLR_2: MON3_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON2_UP_ISC_Pos     (19UL)                    /*!< ADC1 IRQCLR_2: MON2_UP_ISC (Bit 19)                   */
#define ADC1_IRQCLR_2_MON2_UP_ISC_Msk     (0x80000UL)               /*!< ADC1 IRQCLR_2: MON2_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON1_UP_ISC_Pos     (18UL)                    /*!< ADC1 IRQCLR_2: MON1_UP_ISC (Bit 18)                   */
#define ADC1_IRQCLR_2_MON1_UP_ISC_Msk     (0x40000UL)               /*!< ADC1 IRQCLR_2: MON1_UP_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_VS_UP_ISC_Pos       (17UL)                    /*!< ADC1 IRQCLR_2: VS_UP_ISC (Bit 17)                     */
#define ADC1_IRQCLR_2_VS_UP_ISC_Msk       (0x20000UL)               /*!< ADC1 IRQCLR_2: VS_UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_2_P2_7_LO_ISC_Pos     (11UL)                    /*!< ADC1 IRQCLR_2: P2_7_LO_ISC (Bit 11)                   */
#define ADC1_IRQCLR_2_P2_7_LO_ISC_Msk     (0x800UL)                 /*!< ADC1 IRQCLR_2: P2_7_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_6_LO_ISC_Pos     (10UL)                    /*!< ADC1 IRQCLR_2: P2_6_LO_ISC (Bit 10)                   */
#define ADC1_IRQCLR_2_P2_6_LO_ISC_Msk     (0x400UL)                 /*!< ADC1 IRQCLR_2: P2_6_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_3_LO_ISC_Pos     (9UL)                     /*!< ADC1 IRQCLR_2: P2_3_LO_ISC (Bit 9)                    */
#define ADC1_IRQCLR_2_P2_3_LO_ISC_Msk     (0x200UL)                 /*!< ADC1 IRQCLR_2: P2_3_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_2_LO_ISC_Pos     (8UL)                     /*!< ADC1 IRQCLR_2: P2_2_LO_ISC (Bit 8)                    */
#define ADC1_IRQCLR_2_P2_2_LO_ISC_Msk     (0x100UL)                 /*!< ADC1 IRQCLR_2: P2_2_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_P2_1_LO_ISC_Pos     (7UL)                     /*!< ADC1 IRQCLR_2: P2_1_LO_ISC (Bit 7)                    */
#define ADC1_IRQCLR_2_P2_1_LO_ISC_Msk     (0x80UL)                  /*!< ADC1 IRQCLR_2: P2_1_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON5_LO_ISC_Pos     (6UL)                     /*!< ADC1 IRQCLR_2: MON5_LO_ISC (Bit 6)                    */
#define ADC1_IRQCLR_2_MON5_LO_ISC_Msk     (0x40UL)                  /*!< ADC1 IRQCLR_2: MON5_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON4_LO_ISC_Pos     (5UL)                     /*!< ADC1 IRQCLR_2: MON4_LO_ISC (Bit 5)                    */
#define ADC1_IRQCLR_2_MON4_LO_ISC_Msk     (0x20UL)                  /*!< ADC1 IRQCLR_2: MON4_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON3_LO_ISC_Pos     (4UL)                     /*!< ADC1 IRQCLR_2: MON3_LO_ISC (Bit 4)                    */
#define ADC1_IRQCLR_2_MON3_LO_ISC_Msk     (0x10UL)                  /*!< ADC1 IRQCLR_2: MON3_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON2_LO_ISC_Pos     (3UL)                     /*!< ADC1 IRQCLR_2: MON2_LO_ISC (Bit 3)                    */
#define ADC1_IRQCLR_2_MON2_LO_ISC_Msk     (0x8UL)                   /*!< ADC1 IRQCLR_2: MON2_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_MON1_LO_ISC_Pos     (2UL)                     /*!< ADC1 IRQCLR_2: MON1_LO_ISC (Bit 2)                    */
#define ADC1_IRQCLR_2_MON1_LO_ISC_Msk     (0x4UL)                   /*!< ADC1 IRQCLR_2: MON1_LO_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_2_VS_LO_ISC_Pos       (1UL)                     /*!< ADC1 IRQCLR_2: VS_LO_ISC (Bit 1)                      */
#define ADC1_IRQCLR_2_VS_LO_ISC_Msk       (0x2UL)                   /*!< ADC1 IRQCLR_2: VS_LO_ISC (Bitfield-Mask: 0x01)        */
/* ========================================================  IRQEN_1  ======================================================== */
#define ADC1_IRQEN_1_DU4UP_IEN_Pos        (31UL)                    /*!< ADC1 IRQEN_1: DU4UP_IEN (Bit 31)                      */
#define ADC1_IRQEN_1_DU4UP_IEN_Msk        (0x80000000UL)            /*!< ADC1 IRQEN_1: DU4UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU4LO_IEN_Pos        (30UL)                    /*!< ADC1 IRQEN_1: DU4LO_IEN (Bit 30)                      */
#define ADC1_IRQEN_1_DU4LO_IEN_Msk        (0x40000000UL)            /*!< ADC1 IRQEN_1: DU4LO_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU3UP_IEN_Pos        (29UL)                    /*!< ADC1 IRQEN_1: DU3UP_IEN (Bit 29)                      */
#define ADC1_IRQEN_1_DU3UP_IEN_Msk        (0x20000000UL)            /*!< ADC1 IRQEN_1: DU3UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU3LO_IEN_Pos        (28UL)                    /*!< ADC1 IRQEN_1: DU3LO_IEN (Bit 28)                      */
#define ADC1_IRQEN_1_DU3LO_IEN_Msk        (0x10000000UL)            /*!< ADC1 IRQEN_1: DU3LO_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU2UP_IEN_Pos        (27UL)                    /*!< ADC1 IRQEN_1: DU2UP_IEN (Bit 27)                      */
#define ADC1_IRQEN_1_DU2UP_IEN_Msk        (0x8000000UL)             /*!< ADC1 IRQEN_1: DU2UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU2LO_IEN_Pos        (26UL)                    /*!< ADC1 IRQEN_1: DU2LO_IEN (Bit 26)                      */
#define ADC1_IRQEN_1_DU2LO_IEN_Msk        (0x4000000UL)             /*!< ADC1 IRQEN_1: DU2LO_IEN (Bitfield-Mask: 0x01)         */
