zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define ADC1_IRQEN_1_DU1UP_IEN_Pos        (25UL)                    /*!< ADC1 IRQEN_1: DU1UP_IEN (Bit 25)                      */
#define ADC1_IRQEN_1_DU1UP_IEN_Msk        (0x2000000UL)             /*!< ADC1 IRQEN_1: DU1UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU1LO_IEN_Pos        (24UL)                    /*!< ADC1 IRQEN_1: DU1LO_IEN (Bit 24)                      */
#define ADC1_IRQEN_1_DU1LO_IEN_Msk        (0x1000000UL)             /*!< ADC1 IRQEN_1: DU1LO_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_ESM_IEN_Pos          (17UL)                    /*!< ADC1 IRQEN_1: ESM_IEN (Bit 17)                        */
#define ADC1_IRQEN_1_ESM_IEN_Msk          (0x20000UL)               /*!< ADC1 IRQEN_1: ESM_IEN (Bitfield-Mask: 0x01)           */
#define ADC1_IRQEN_1_EIM_IEN_Pos          (16UL)                    /*!< ADC1 IRQEN_1: EIM_IEN (Bit 16)                        */
#define ADC1_IRQEN_1_EIM_IEN_Msk          (0x10000UL)               /*!< ADC1 IRQEN_1: EIM_IEN (Bitfield-Mask: 0x01)           */
#define ADC1_IRQEN_1_P2_0_IEN_Pos         (12UL)                    /*!< ADC1 IRQEN_1: P2_0_IEN (Bit 12)                       */
#define ADC1_IRQEN_1_P2_0_IEN_Msk         (0x1000UL)                /*!< ADC1 IRQEN_1: P2_0_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_P2_7_IEN_Pos         (11UL)                    /*!< ADC1 IRQEN_1: P2_7_IEN (Bit 11)                       */
#define ADC1_IRQEN_1_P2_7_IEN_Msk         (0x800UL)                 /*!< ADC1 IRQEN_1: P2_7_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_P2_6_IEN_Pos         (10UL)                    /*!< ADC1 IRQEN_1: P2_6_IEN (Bit 10)                       */
#define ADC1_IRQEN_1_P2_6_IEN_Msk         (0x400UL)                 /*!< ADC1 IRQEN_1: P2_6_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_P2_3_IEN_Pos         (9UL)                     /*!< ADC1 IRQEN_1: P2_3_IEN (Bit 9)                        */
#define ADC1_IRQEN_1_P2_3_IEN_Msk         (0x200UL)                 /*!< ADC1 IRQEN_1: P2_3_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_P2_2_IEN_Pos         (8UL)                     /*!< ADC1 IRQEN_1: P2_2_IEN (Bit 8)                        */
#define ADC1_IRQEN_1_P2_2_IEN_Msk         (0x100UL)                 /*!< ADC1 IRQEN_1: P2_2_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_P2_1_IEN_Pos         (7UL)                     /*!< ADC1 IRQEN_1: P2_1_IEN (Bit 7)                        */
#define ADC1_IRQEN_1_P2_1_IEN_Msk         (0x80UL)                  /*!< ADC1 IRQEN_1: P2_1_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_MON5_IEN_Pos         (6UL)                     /*!< ADC1 IRQEN_1: MON5_IEN (Bit 6)                        */
#define ADC1_IRQEN_1_MON5_IEN_Msk         (0x40UL)                  /*!< ADC1 IRQEN_1: MON5_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_MON4_IEN_Pos         (5UL)                     /*!< ADC1 IRQEN_1: MON4_IEN (Bit 5)                        */
#define ADC1_IRQEN_1_MON4_IEN_Msk         (0x20UL)                  /*!< ADC1 IRQEN_1: MON4_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_MON3_IEN_Pos         (4UL)                     /*!< ADC1 IRQEN_1: MON3_IEN (Bit 4)                        */
#define ADC1_IRQEN_1_MON3_IEN_Msk         (0x10UL)                  /*!< ADC1 IRQEN_1: MON3_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_MON2_IEN_Pos         (3UL)                     /*!< ADC1 IRQEN_1: MON2_IEN (Bit 3)                        */
#define ADC1_IRQEN_1_MON2_IEN_Msk         (0x8UL)                   /*!< ADC1 IRQEN_1: MON2_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_MON1_IEN_Pos         (2UL)                     /*!< ADC1 IRQEN_1: MON1_IEN (Bit 2)                        */
#define ADC1_IRQEN_1_MON1_IEN_Msk         (0x4UL)                   /*!< ADC1 IRQEN_1: MON1_IEN (Bitfield-Mask: 0x01)          */
#define ADC1_IRQEN_1_VS_IEN_Pos           (1UL)                     /*!< ADC1 IRQEN_1: VS_IEN (Bit 1)                          */
#define ADC1_IRQEN_1_VS_IEN_Msk           (0x2UL)                   /*!< ADC1 IRQEN_1: VS_IEN (Bitfield-Mask: 0x01)            */
#define ADC1_IRQEN_1_VBATSEN_IEN_Pos      (0UL)                     /*!< ADC1 IRQEN_1: VBATSEN_IEN (Bit 0)                     */
#define ADC1_IRQEN_1_VBATSEN_IEN_Msk      (0x1UL)                   /*!< ADC1 IRQEN_1: VBATSEN_IEN (Bitfield-Mask: 0x01)       */
/* ========================================================  IRQEN_2  ======================================================== */
#define ADC1_IRQEN_2_P2_7_UP_IEN_Pos      (27UL)                    /*!< ADC1 IRQEN_2: P2_7_UP_IEN (Bit 27)                    */
#define ADC1_IRQEN_2_P2_7_UP_IEN_Msk      (0x8000000UL)             /*!< ADC1 IRQEN_2: P2_7_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_6_UP_IEN_Pos      (26UL)                    /*!< ADC1 IRQEN_2: P2_6_UP_IEN (Bit 26)                    */
#define ADC1_IRQEN_2_P2_6_UP_IEN_Msk      (0x4000000UL)             /*!< ADC1 IRQEN_2: P2_6_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_3_UP_IEN_Pos      (25UL)                    /*!< ADC1 IRQEN_2: P2_3_UP_IEN (Bit 25)                    */
#define ADC1_IRQEN_2_P2_3_UP_IEN_Msk      (0x2000000UL)             /*!< ADC1 IRQEN_2: P2_3_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_2_UP_IEN_Pos      (24UL)                    /*!< ADC1 IRQEN_2: P2_2_UP_IEN (Bit 24)                    */
#define ADC1_IRQEN_2_P2_2_UP_IEN_Msk      (0x1000000UL)             /*!< ADC1 IRQEN_2: P2_2_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_1_UP_IEN_Pos      (23UL)                    /*!< ADC1 IRQEN_2: P2_1_UP_IEN (Bit 23)                    */
#define ADC1_IRQEN_2_P2_1_UP_IEN_Msk      (0x800000UL)              /*!< ADC1 IRQEN_2: P2_1_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON5_UP_IEN_Pos      (22UL)                    /*!< ADC1 IRQEN_2: MON5_UP_IEN (Bit 22)                    */
#define ADC1_IRQEN_2_MON5_UP_IEN_Msk      (0x400000UL)              /*!< ADC1 IRQEN_2: MON5_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON4_UP_IEN_Pos      (21UL)                    /*!< ADC1 IRQEN_2: MON4_UP_IEN (Bit 21)                    */
#define ADC1_IRQEN_2_MON4_UP_IEN_Msk      (0x200000UL)              /*!< ADC1 IRQEN_2: MON4_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON3_UP_IEN_Pos      (20UL)                    /*!< ADC1 IRQEN_2: MON3_UP_IEN (Bit 20)                    */
#define ADC1_IRQEN_2_MON3_UP_IEN_Msk      (0x100000UL)              /*!< ADC1 IRQEN_2: MON3_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON2_UP_IEN_Pos      (19UL)                    /*!< ADC1 IRQEN_2: MON2_UP_IEN (Bit 19)                    */
#define ADC1_IRQEN_2_MON2_UP_IEN_Msk      (0x80000UL)               /*!< ADC1 IRQEN_2: MON2_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON1_UP_IEN_Pos      (18UL)                    /*!< ADC1 IRQEN_2: MON1_UP_IEN (Bit 18)                    */
#define ADC1_IRQEN_2_MON1_UP_IEN_Msk      (0x40000UL)               /*!< ADC1 IRQEN_2: MON1_UP_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_VS_UP_IEN_Pos        (17UL)                    /*!< ADC1 IRQEN_2: VS_UP_IEN (Bit 17)                      */
#define ADC1_IRQEN_2_VS_UP_IEN_Msk        (0x20000UL)               /*!< ADC1 IRQEN_2: VS_UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_2_P2_7_LO_IEN_Pos      (11UL)                    /*!< ADC1 IRQEN_2: P2_7_LO_IEN (Bit 11)                    */
#define ADC1_IRQEN_2_P2_7_LO_IEN_Msk      (0x800UL)                 /*!< ADC1 IRQEN_2: P2_7_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_6_LO_IEN_Pos      (10UL)                    /*!< ADC1 IRQEN_2: P2_6_LO_IEN (Bit 10)                    */
#define ADC1_IRQEN_2_P2_6_LO_IEN_Msk      (0x400UL)                 /*!< ADC1 IRQEN_2: P2_6_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_3_LO_IEN_Pos      (9UL)                     /*!< ADC1 IRQEN_2: P2_3_LO_IEN (Bit 9)                     */
#define ADC1_IRQEN_2_P2_3_LO_IEN_Msk      (0x200UL)                 /*!< ADC1 IRQEN_2: P2_3_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_2_LO_IEN_Pos      (8UL)                     /*!< ADC1 IRQEN_2: P2_2_LO_IEN (Bit 8)                     */
#define ADC1_IRQEN_2_P2_2_LO_IEN_Msk      (0x100UL)                 /*!< ADC1 IRQEN_2: P2_2_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_P2_1_LO_IEN_Pos      (7UL)                     /*!< ADC1 IRQEN_2: P2_1_LO_IEN (Bit 7)                     */
#define ADC1_IRQEN_2_P2_1_LO_IEN_Msk      (0x80UL)                  /*!< ADC1 IRQEN_2: P2_1_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON5_LO_IEN_Pos      (6UL)                     /*!< ADC1 IRQEN_2: MON5_LO_IEN (Bit 6)                     */
#define ADC1_IRQEN_2_MON5_LO_IEN_Msk      (0x40UL)                  /*!< ADC1 IRQEN_2: MON5_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON4_LO_IEN_Pos      (5UL)                     /*!< ADC1 IRQEN_2: MON4_LO_IEN (Bit 5)                     */
#define ADC1_IRQEN_2_MON4_LO_IEN_Msk      (0x20UL)                  /*!< ADC1 IRQEN_2: MON4_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON3_LO_IEN_Pos      (4UL)                     /*!< ADC1 IRQEN_2: MON3_LO_IEN (Bit 4)                     */
#define ADC1_IRQEN_2_MON3_LO_IEN_Msk      (0x10UL)                  /*!< ADC1 IRQEN_2: MON3_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON2_LO_IEN_Pos      (3UL)                     /*!< ADC1 IRQEN_2: MON2_LO_IEN (Bit 3)                     */
#define ADC1_IRQEN_2_MON2_LO_IEN_Msk      (0x8UL)                   /*!< ADC1 IRQEN_2: MON2_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_MON1_LO_IEN_Pos      (2UL)                     /*!< ADC1 IRQEN_2: MON1_LO_IEN (Bit 2)                     */
#define ADC1_IRQEN_2_MON1_LO_IEN_Msk      (0x4UL)                   /*!< ADC1 IRQEN_2: MON1_LO_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_2_VS_LO_IEN_Pos        (1UL)                     /*!< ADC1 IRQEN_2: VS_LO_IEN (Bit 1)                       */
#define ADC1_IRQEN_2_VS_LO_IEN_Msk        (0x2UL)                   /*!< ADC1 IRQEN_2: VS_LO_IEN (Bitfield-Mask: 0x01)         */
/* =======================================================  DUIN_SEL  ======================================================== */
#define ADC1_DUIN_SEL_DU4RES_NEG_Pos      (28UL)                    /*!< ADC1 DUIN_SEL: DU4RES_NEG (Bit 28)                    */
#define ADC1_DUIN_SEL_DU4RES_NEG_Msk      (0x10000000UL)            /*!< ADC1 DUIN_SEL: DU4RES_NEG (Bitfield-Mask: 0x01)       */
#define ADC1_DUIN_SEL_DU4_EN_Pos          (24UL)                    /*!< ADC1 DUIN_SEL: DU4_EN (Bit 24)                        */
#define ADC1_DUIN_SEL_DU4_EN_Msk          (0x1000000UL)             /*!< ADC1 DUIN_SEL: DU4_EN (Bitfield-Mask: 0x01)           */
#define ADC1_DUIN_SEL_DU3RES_NEG_Pos      (20UL)                    /*!< ADC1 DUIN_SEL: DU3RES_NEG (Bit 20)                    */
#define ADC1_DUIN_SEL_DU3RES_NEG_Msk      (0x100000UL)              /*!< ADC1 DUIN_SEL: DU3RES_NEG (Bitfield-Mask: 0x01)       */
#define ADC1_DUIN_SEL_DU3_EN_Pos          (16UL)                    /*!< ADC1 DUIN_SEL: DU3_EN (Bit 16)                        */
#define ADC1_DUIN_SEL_DU3_EN_Msk          (0x10000UL)               /*!< ADC1 DUIN_SEL: DU3_EN (Bitfield-Mask: 0x01)           */
#define ADC1_DUIN_SEL_DU2RES_NEG_Pos      (12UL)                    /*!< ADC1 DUIN_SEL: DU2RES_NEG (Bit 12)                    */
#define ADC1_DUIN_SEL_DU2RES_NEG_Msk      (0x1000UL)                /*!< ADC1 DUIN_SEL: DU2RES_NEG (Bitfield-Mask: 0x01)       */
#define ADC1_DUIN_SEL_DU2_EN_Pos          (8UL)                     /*!< ADC1 DUIN_SEL: DU2_EN (Bit 8)                         */
#define ADC1_DUIN_SEL_DU2_EN_Msk          (0x100UL)                 /*!< ADC1 DUIN_SEL: DU2_EN (Bitfield-Mask: 0x01)           */
#define ADC1_DUIN_SEL_DU1RES_NEG_Pos      (4UL)                     /*!< ADC1 DUIN_SEL: DU1RES_NEG (Bit 4)                     */
#define ADC1_DUIN_SEL_DU1RES_NEG_Msk      (0x10UL)                  /*!< ADC1 DUIN_SEL: DU1RES_NEG (Bitfield-Mask: 0x01)       */
#define ADC1_DUIN_SEL_DU1_EN_Pos          (0UL)                     /*!< ADC1 DUIN_SEL: DU1_EN (Bit 0)                         */
#define ADC1_DUIN_SEL_DU1_EN_Msk          (0x1UL)                   /*!< ADC1 DUIN_SEL: DU1_EN (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */

