zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* =======================================================  CTRL_STS  ======================================================== */
#define ADC2_CTRL_STS_IN_MUX_SEL_Pos      (8UL)                     /*!< ADC2 CTRL_STS: IN_MUX_SEL (Bit 8)                     */
#define ADC2_CTRL_STS_IN_MUX_SEL_Msk      (0xf00UL)                 /*!< ADC2 CTRL_STS: IN_MUX_SEL (Bitfield-Mask: 0x0f)       */
#define ADC2_CTRL_STS_EOC_Pos             (3UL)                     /*!< ADC2 CTRL_STS: EOC (Bit 3)                            */
#define ADC2_CTRL_STS_EOC_Msk             (0x8UL)                   /*!< ADC2 CTRL_STS: EOC (Bitfield-Mask: 0x01)              */
#define ADC2_CTRL_STS_SOS_Pos             (2UL)                     /*!< ADC2 CTRL_STS: SOS (Bit 2)                            */
#define ADC2_CTRL_STS_SOS_Msk             (0x4UL)                   /*!< ADC2 CTRL_STS: SOS (Bitfield-Mask: 0x01)              */
/* ========================================================  STATUS  ========================================================= */
#define ADC2_STATUS_READY_Pos             (1UL)                     /*!< ADC2 STATUS: READY (Bit 1)                            */
#define ADC2_STATUS_READY_Msk             (0x2UL)                   /*!< ADC2 STATUS: READY (Bitfield-Mask: 0x01)              */
/* =========================================================  CTRL1  ========================================================= */
#define ADC2_CTRL1_CALIB_EN_6_0_Pos       (0UL)                     /*!< ADC2 CTRL1: CALIB_EN_6_0 (Bit 0)                      */
#define ADC2_CTRL1_CALIB_EN_6_0_Msk       (0x7fUL)                  /*!< ADC2 CTRL1: CALIB_EN_6_0 (Bitfield-Mask: 0x7f)        */
/* =========================================================  CTRL2  ========================================================= */
#define ADC2_CTRL2_SAMPLE_TIME_int_Pos    (8UL)                     /*!< ADC2 CTRL2: SAMPLE_TIME_int (Bit 8)                   */
#define ADC2_CTRL2_SAMPLE_TIME_int_Msk    (0xf00UL)                 /*!< ADC2 CTRL2: SAMPLE_TIME_int (Bitfield-Mask: 0x0f)     */
#define ADC2_CTRL2_MCM_RDY_Pos            (7UL)                     /*!< ADC2 CTRL2: MCM_RDY (Bit 7)                           */
#define ADC2_CTRL2_MCM_RDY_Msk            (0x80UL)                  /*!< ADC2 CTRL2: MCM_RDY (Bitfield-Mask: 0x01)             */
#define ADC2_CTRL2_MCM_PD_N_Pos           (0UL)                     /*!< ADC2 CTRL2: MCM_PD_N (Bit 0)                          */
#define ADC2_CTRL2_MCM_PD_N_Msk           (0x1UL)                   /*!< ADC2 CTRL2: MCM_PD_N (Bitfield-Mask: 0x01)            */
/* =========================================================  CTRL4  ========================================================= */
#define ADC2_CTRL4_FILT_OUT_SEL_6_0_Pos   (0UL)                     /*!< ADC2 CTRL4: FILT_OUT_SEL_6_0 (Bit 0)                  */
#define ADC2_CTRL4_FILT_OUT_SEL_6_0_Msk   (0x7fUL)                  /*!< ADC2 CTRL4: FILT_OUT_SEL_6_0 (Bitfield-Mask: 0x7f)    */
/* =========================================================  SQ1_4  ========================================================= */
#define ADC2_SQ1_4_SQ4_Pos                (24UL)                    /*!< ADC2 SQ1_4: SQ4 (Bit 24)                              */
#define ADC2_SQ1_4_SQ4_Msk                (0x7f000000UL)            /*!< ADC2 SQ1_4: SQ4 (Bitfield-Mask: 0x7f)                 */
#define ADC2_SQ1_4_SQ3_Pos                (16UL)                    /*!< ADC2 SQ1_4: SQ3 (Bit 16)                              */
#define ADC2_SQ1_4_SQ3_Msk                (0x7f0000UL)              /*!< ADC2 SQ1_4: SQ3 (Bitfield-Mask: 0x7f)                 */
#define ADC2_SQ1_4_SQ2_Pos                (8UL)                     /*!< ADC2 SQ1_4: SQ2 (Bit 8)                               */
#define ADC2_SQ1_4_SQ2_Msk                (0x7f00UL)                /*!< ADC2 SQ1_4: SQ2 (Bitfield-Mask: 0x7f)                 */
#define ADC2_SQ1_4_SQ1_Pos                (0UL)                     /*!< ADC2 SQ1_4: SQ1 (Bit 0)                               */
#define ADC2_SQ1_4_SQ1_Msk                (0x7fUL)                  /*!< ADC2 SQ1_4: SQ1 (Bitfield-Mask: 0x7f)                 */
/* =========================================================  SQ5_8  ========================================================= */
#define ADC2_SQ5_8_SQ7_Pos                (16UL)                    /*!< ADC2 SQ5_8: SQ7 (Bit 16)                              */
#define ADC2_SQ5_8_SQ7_Msk                (0x7f0000UL)              /*!< ADC2 SQ5_8: SQ7 (Bitfield-Mask: 0x7f)                 */
#define ADC2_SQ5_8_SQ6_Pos                (8UL)                     /*!< ADC2 SQ5_8: SQ6 (Bit 8)                               */
#define ADC2_SQ5_8_SQ6_Msk                (0x7f00UL)                /*!< ADC2 SQ5_8: SQ6 (Bitfield-Mask: 0x7f)                 */
#define ADC2_SQ5_8_SQ5_Pos                (0UL)                     /*!< ADC2 SQ5_8: SQ5 (Bit 0)                               */
#define ADC2_SQ5_8_SQ5_Msk                (0x7fUL)                  /*!< ADC2 SQ5_8: SQ5 (Bitfield-Mask: 0x7f)                 */
/* =========================================================  SQ_FB  ========================================================= */
#define ADC2_SQ_FB_CHx_STS_Pos            (16UL)                    /*!< ADC2 SQ_FB: CHx_STS (Bit 16)                          */
#define ADC2_SQ_FB_CHx_STS_Msk            (0xf0000UL)               /*!< ADC2 SQ_FB: CHx_STS (Bitfield-Mask: 0x0f)             */
#define ADC2_SQ_FB_SQx_STS_Pos            (11UL)                    /*!< ADC2 SQ_FB: SQx_STS (Bit 11)                          */
#define ADC2_SQ_FB_SQx_STS_Msk            (0x3800UL)                /*!< ADC2 SQ_FB: SQx_STS (Bitfield-Mask: 0x07)             */
#define ADC2_SQ_FB_EIM_ACTIVE_Pos         (9UL)                     /*!< ADC2 SQ_FB: EIM_ACTIVE (Bit 9)                        */
#define ADC2_SQ_FB_EIM_ACTIVE_Msk         (0x200UL)                 /*!< ADC2 SQ_FB: EIM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC2_SQ_FB_SQ_STOP_Pos            (8UL)                     /*!< ADC2 SQ_FB: SQ_STOP (Bit 8)                           */
#define ADC2_SQ_FB_SQ_STOP_Msk            (0x100UL)                 /*!< ADC2 SQ_FB: SQ_STOP (Bitfield-Mask: 0x01)             */
#define ADC2_SQ_FB_SQ_FB_Pos              (0UL)                     /*!< ADC2 SQ_FB: SQ_FB (Bit 0)                             */
#define ADC2_SQ_FB_SQ_FB_Msk              (0xfUL)                   /*!< ADC2 SQ_FB: SQ_FB (Bitfield-Mask: 0x0f)               */
/* ========================================================  CHx_EIM  ======================================================== */
#define ADC2_CHx_EIM_SEL_Pos              (12UL)                    /*!< ADC2 CHx_EIM: SEL (Bit 12)                            */
#define ADC2_CHx_EIM_SEL_Msk              (0x1000UL)                /*!< ADC2 CHx_EIM: SEL (Bitfield-Mask: 0x01)               */
#define ADC2_CHx_EIM_EN_Pos               (11UL)                    /*!< ADC2 CHx_EIM: EN (Bit 11)                             */
#define ADC2_CHx_EIM_EN_Msk               (0x800UL)                 /*!< ADC2 CHx_EIM: EN (Bitfield-Mask: 0x01)                */
#define ADC2_CHx_EIM_REP_Pos              (8UL)                     /*!< ADC2 CHx_EIM: REP (Bit 8)                             */
#define ADC2_CHx_EIM_REP_Msk              (0x700UL)                 /*!< ADC2 CHx_EIM: REP (Bitfield-Mask: 0x07)               */
#define ADC2_CHx_EIM_CHx_SEL_Pos          (0UL)                     /*!< ADC2 CHx_EIM: CHx_SEL (Bit 0)                         */
#define ADC2_CHx_EIM_CHx_SEL_Msk          (0x7UL)                   /*!< ADC2 CHx_EIM: CHx_SEL (Bitfield-Mask: 0x07)           */
/* =======================================================  MAX_TIME  ======================================================== */
#define ADC2_MAX_TIME_MAX_TIME_Pos        (0UL)                     /*!< ADC2 MAX_TIME: MAX_TIME (Bit 0)                       */
#define ADC2_MAX_TIME_MAX_TIME_Msk        (0xffUL)                  /*!< ADC2 MAX_TIME: MAX_TIME (Bitfield-Mask: 0xff)         */
/* =======================================================  CAL_CH0_1  ======================================================= */
#define ADC2_CAL_CH0_1_GAIN_CH1_Pos       (24UL)                    /*!< ADC2 CAL_CH0_1: GAIN_CH1 (Bit 24)                     */
#define ADC2_CAL_CH0_1_GAIN_CH1_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH0_1: GAIN_CH1 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH0_1_OFFS_CH1_Pos       (16UL)                    /*!< ADC2 CAL_CH0_1: OFFS_CH1 (Bit 16)                     */
#define ADC2_CAL_CH0_1_OFFS_CH1_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH0_1: OFFS_CH1 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH0_1_GAIN_CH0_Pos       (8UL)                     /*!< ADC2 CAL_CH0_1: GAIN_CH0 (Bit 8)                      */
#define ADC2_CAL_CH0_1_GAIN_CH0_Msk       (0xff00UL)                /*!< ADC2 CAL_CH0_1: GAIN_CH0 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH0_1_OFFS_CH0_Pos       (0UL)                     /*!< ADC2 CAL_CH0_1: OFFS_CH0 (Bit 0)                      */
#define ADC2_CAL_CH0_1_OFFS_CH0_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH0_1: OFFS_CH0 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH2_3  ======================================================= */
#define ADC2_CAL_CH2_3_GAIN_CH3_Pos       (24UL)                    /*!< ADC2 CAL_CH2_3: GAIN_CH3 (Bit 24)                     */
#define ADC2_CAL_CH2_3_GAIN_CH3_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH2_3: GAIN_CH3 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH2_3_OFFS_CH3_Pos       (16UL)                    /*!< ADC2 CAL_CH2_3: OFFS_CH3 (Bit 16)                     */
#define ADC2_CAL_CH2_3_OFFS_CH3_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH2_3: OFFS_CH3 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH2_3_GAIN_CH2_Pos       (8UL)                     /*!< ADC2 CAL_CH2_3: GAIN_CH2 (Bit 8)                      */
#define ADC2_CAL_CH2_3_GAIN_CH2_Msk       (0xff00UL)                /*!< ADC2 CAL_CH2_3: GAIN_CH2 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH2_3_OFFS_CH2_Pos       (0UL)                     /*!< ADC2 CAL_CH2_3: OFFS_CH2 (Bit 0)                      */
#define ADC2_CAL_CH2_3_OFFS_CH2_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH2_3: OFFS_CH2 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH4_5  ======================================================= */
#define ADC2_CAL_CH4_5_GAIN_CH5_Pos       (24UL)                    /*!< ADC2 CAL_CH4_5: GAIN_CH5 (Bit 24)                     */
#define ADC2_CAL_CH4_5_GAIN_CH5_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH4_5: GAIN_CH5 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH4_5_OFFS_CH5_Pos       (16UL)                    /*!< ADC2 CAL_CH4_5: OFFS_CH5 (Bit 16)                     */
#define ADC2_CAL_CH4_5_OFFS_CH5_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH4_5: OFFS_CH5 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH4_5_GAIN_CH4_Pos       (8UL)                     /*!< ADC2 CAL_CH4_5: GAIN_CH4 (Bit 8)                      */
#define ADC2_CAL_CH4_5_GAIN_CH4_Msk       (0xff00UL)                /*!< ADC2 CAL_CH4_5: GAIN_CH4 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH4_5_OFFS_CH4_Pos       (0UL)                     /*!< ADC2 CAL_CH4_5: OFFS_CH4 (Bit 0)                      */
#define ADC2_CAL_CH4_5_OFFS_CH4_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH4_5: OFFS_CH4 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH6_7  ======================================================= */
#define ADC2_CAL_CH6_7_GAIN_CH6_Pos       (8UL)                     /*!< ADC2 CAL_CH6_7: GAIN_CH6 (Bit 8)                      */
#define ADC2_CAL_CH6_7_GAIN_CH6_Msk       (0xff00UL)                /*!< ADC2 CAL_CH6_7: GAIN_CH6 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH6_7_OFFS_CH6_Pos       (0UL)                     /*!< ADC2 CAL_CH6_7: OFFS_CH6 (Bit 0)                      */
#define ADC2_CAL_CH6_7_OFFS_CH6_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH6_7: OFFS_CH6 (Bitfield-Mask: 0x1f)        */
/* =====================================================  FILTCOEFF0_7  ====================================================== */
#define ADC2_FILTCOEFF0_7_A_CH7_Pos       (14UL)                    /*!< ADC2 FILTCOEFF0_7: A_CH7 (Bit 14)                     */
#define ADC2_FILTCOEFF0_7_A_CH7_Msk       (0xc000UL)                /*!< ADC2 FILTCOEFF0_7: A_CH7 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH6_Pos       (12UL)                    /*!< ADC2 FILTCOEFF0_7: A_CH6 (Bit 12)                     */
#define ADC2_FILTCOEFF0_7_A_CH6_Msk       (0x3000UL)                /*!< ADC2 FILTCOEFF0_7: A_CH6 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH5_Pos       (10UL)                    /*!< ADC2 FILTCOEFF0_7: A_CH5 (Bit 10)                     */
#define ADC2_FILTCOEFF0_7_A_CH5_Msk       (0xc00UL)                 /*!< ADC2 FILTCOEFF0_7: A_CH5 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH4_Pos       (8UL)                     /*!< ADC2 FILTCOEFF0_7: A_CH4 (Bit 8)                      */
#define ADC2_FILTCOEFF0_7_A_CH4_Msk       (0x300UL)                 /*!< ADC2 FILTCOEFF0_7: A_CH4 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH3_Pos       (6UL)                     /*!< ADC2 FILTCOEFF0_7: A_CH3 (Bit 6)                      */
#define ADC2_FILTCOEFF0_7_A_CH3_Msk       (0xc0UL)                  /*!< ADC2 FILTCOEFF0_7: A_CH3 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH2_Pos       (4UL)                     /*!< ADC2 FILTCOEFF0_7: A_CH2 (Bit 4)                      */
#define ADC2_FILTCOEFF0_7_A_CH2_Msk       (0x30UL)                  /*!< ADC2 FILTCOEFF0_7: A_CH2 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH1_Pos       (2UL)                     /*!< ADC2 FILTCOEFF0_7: A_CH1 (Bit 2)                      */
#define ADC2_FILTCOEFF0_7_A_CH1_Msk       (0xcUL)                   /*!< ADC2 FILTCOEFF0_7: A_CH1 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_7_A_CH0_Pos       (0UL)                     /*!< ADC2 FILTCOEFF0_7: A_CH0 (Bit 0)                      */
#define ADC2_FILTCOEFF0_7_A_CH0_Msk       (0x3UL)                   /*!< ADC2 FILTCOEFF0_7: A_CH0 (Bitfield-Mask: 0x03)        */
/* =======================================================  FILT_OUT0  ======================================================= */
#define ADC2_FILT_OUT0_OUT_CH0_Pos        (0UL)                     /*!< ADC2 FILT_OUT0: OUT_CH0 (Bit 0)                       */
#define ADC2_FILT_OUT0_OUT_CH0_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT0: OUT_CH0 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT1  ======================================================= */
#define ADC2_FILT_OUT1_OUT_CH1_Pos        (0UL)                     /*!< ADC2 FILT_OUT1: OUT_CH1 (Bit 0)                       */
#define ADC2_FILT_OUT1_OUT_CH1_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT1: OUT_CH1 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT2  ======================================================= */
#define ADC2_FILT_OUT2_OUT_CH2_Pos        (0UL)                     /*!< ADC2 FILT_OUT2: OUT_CH2 (Bit 0)                       */
#define ADC2_FILT_OUT2_OUT_CH2_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT2: OUT_CH2 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT3  ======================================================= */
#define ADC2_FILT_OUT3_OUT_CH3_Pos        (0UL)                     /*!< ADC2 FILT_OUT3: OUT_CH3 (Bit 0)                       */
#define ADC2_FILT_OUT3_OUT_CH3_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT3: OUT_CH3 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT4  ======================================================= */
#define ADC2_FILT_OUT4_OUT_CH4_Pos        (0UL)                     /*!< ADC2 FILT_OUT4: OUT_CH4 (Bit 0)                       */
#define ADC2_FILT_OUT4_OUT_CH4_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT4: OUT_CH4 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT5  ======================================================= */
#define ADC2_FILT_OUT5_OUT_CH5_Pos        (0UL)                     /*!< ADC2 FILT_OUT5: OUT_CH5 (Bit 0)                       */
#define ADC2_FILT_OUT5_OUT_CH5_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT5: OUT_CH5 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT6  ======================================================= */
#define ADC2_FILT_OUT6_OUT_CH6_Pos        (0UL)                     /*!< ADC2 FILT_OUT6: OUT_CH6 (Bit 0)                       */
#define ADC2_FILT_OUT6_OUT_CH6_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT6: OUT_CH6 (Bitfield-Mask: 0x3ff)        */
/* =====================================================  FILT_UP_CTRL  ====================================================== */
#define ADC2_FILT_UP_CTRL_UPEN_Ch6_Pos    (6UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch6 (Bit 6)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch6_Msk    (0x40UL)                  /*!< ADC2 FILT_UP_CTRL: UPEN_Ch6 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch5_Pos    (5UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch5 (Bit 5)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch5_Msk    (0x20UL)                  /*!< ADC2 FILT_UP_CTRL: UPEN_Ch5 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch4_Pos    (4UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch4 (Bit 4)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch4_Msk    (0x10UL)                  /*!< ADC2 FILT_UP_CTRL: UPEN_Ch4 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch3_Pos    (3UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch3 (Bit 3)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch3_Msk    (0x8UL)                   /*!< ADC2 FILT_UP_CTRL: UPEN_Ch3 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch2_Pos    (2UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch2 (Bit 2)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch2_Msk    (0x4UL)                   /*!< ADC2 FILT_UP_CTRL: UPEN_Ch2 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch1_Pos    (1UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch1 (Bit 1)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch1_Msk    (0x2UL)                   /*!< ADC2 FILT_UP_CTRL: UPEN_Ch1 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_UP_CTRL_UPEN_Ch0_Pos    (0UL)                     /*!< ADC2 FILT_UP_CTRL: UPEN_Ch0 (Bit 0)                   */
#define ADC2_FILT_UP_CTRL_UPEN_Ch0_Msk    (0x1UL)                   /*!< ADC2 FILT_UP_CTRL: UPEN_Ch0 (Bitfield-Mask: 0x01)     */
/* =====================================================  FILT_LO_CTRL  ====================================================== */
#define ADC2_FILT_LO_CTRL_LOEN_Ch6_Pos    (6UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch6 (Bit 6)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch6_Msk    (0x40UL)                  /*!< ADC2 FILT_LO_CTRL: LOEN_Ch6 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch5_Pos    (5UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch5 (Bit 5)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch5_Msk    (0x20UL)                  /*!< ADC2 FILT_LO_CTRL: LOEN_Ch5 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch4_Pos    (4UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch4 (Bit 4)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch4_Msk    (0x10UL)                  /*!< ADC2 FILT_LO_CTRL: LOEN_Ch4 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch3_Pos    (3UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch3 (Bit 3)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch3_Msk    (0x8UL)                   /*!< ADC2 FILT_LO_CTRL: LOEN_Ch3 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch2_Pos    (2UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch2 (Bit 2)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch2_Msk    (0x4UL)                   /*!< ADC2 FILT_LO_CTRL: LOEN_Ch2 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch1_Pos    (1UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch1 (Bit 1)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch1_Msk    (0x2UL)                   /*!< ADC2 FILT_LO_CTRL: LOEN_Ch1 (Bitfield-Mask: 0x01)     */
#define ADC2_FILT_LO_CTRL_LOEN_Ch0_Pos    (0UL)                     /*!< ADC2 FILT_LO_CTRL: LOEN_Ch0 (Bit 0)                   */
#define ADC2_FILT_LO_CTRL_LOEN_Ch0_Msk    (0x1UL)                   /*!< ADC2 FILT_LO_CTRL: LOEN_Ch0 (Bitfield-Mask: 0x01)     */
/* =======================================================  MMODE0_7  ======================================================== */
#define ADC2_MMODE0_7_MSEL_Ch7_Pos        (14UL)                    /*!< ADC2 MMODE0_7: MSEL_Ch7 (Bit 14)                      */
#define ADC2_MMODE0_7_MSEL_Ch7_Msk        (0xc000UL)                /*!< ADC2 MMODE0_7: MSEL_Ch7 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch6_Pos        (12UL)                    /*!< ADC2 MMODE0_7: MSEL_Ch6 (Bit 12)                      */
#define ADC2_MMODE0_7_MSEL_Ch6_Msk        (0x3000UL)                /*!< ADC2 MMODE0_7: MSEL_Ch6 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch5_Pos        (10UL)                    /*!< ADC2 MMODE0_7: MSEL_Ch5 (Bit 10)                      */
#define ADC2_MMODE0_7_MSEL_Ch5_Msk        (0xc00UL)                 /*!< ADC2 MMODE0_7: MSEL_Ch5 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch4_Pos        (8UL)                     /*!< ADC2 MMODE0_7: MSEL_Ch4 (Bit 8)                       */
#define ADC2_MMODE0_7_MSEL_Ch4_Msk        (0x300UL)                 /*!< ADC2 MMODE0_7: MSEL_Ch4 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch3_Pos        (6UL)                     /*!< ADC2 MMODE0_7: MSEL_Ch3 (Bit 6)                       */
#define ADC2_MMODE0_7_MSEL_Ch3_Msk        (0xc0UL)                  /*!< ADC2 MMODE0_7: MSEL_Ch3 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch2_Pos        (4UL)                     /*!< ADC2 MMODE0_7: MSEL_Ch2 (Bit 4)                       */
#define ADC2_MMODE0_7_MSEL_Ch2_Msk        (0x30UL)                  /*!< ADC2 MMODE0_7: MSEL_Ch2 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch1_Pos        (2UL)                     /*!< ADC2 MMODE0_7: MSEL_Ch1 (Bit 2)                       */
#define ADC2_MMODE0_7_MSEL_Ch1_Msk        (0xcUL)                   /*!< ADC2 MMODE0_7: MSEL_Ch1 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_7_MSEL_Ch0_Pos        (0UL)                     /*!< ADC2 MMODE0_7: MSEL_Ch0 (Bit 0)                       */
#define ADC2_MMODE0_7_MSEL_Ch0_Msk        (0x3UL)                   /*!< ADC2 MMODE0_7: MSEL_Ch0 (Bitfield-Mask: 0x03)         */
/* ======================================================  TH0_3_UPPER  ====================================================== */
#define ADC2_TH0_3_UPPER_THUP_CH3_Pos     (24UL)                    /*!< ADC2 TH0_3_UPPER: THUP_CH3 (Bit 24)                   */
#define ADC2_TH0_3_UPPER_THUP_CH3_Msk     (0xff000000UL)            /*!< ADC2 TH0_3_UPPER: THUP_CH3 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_UPPER_THUP_CH2_Pos     (16UL)                    /*!< ADC2 TH0_3_UPPER: THUP_CH2 (Bit 16)                   */
#define ADC2_TH0_3_UPPER_THUP_CH2_Msk     (0xff0000UL)              /*!< ADC2 TH0_3_UPPER: THUP_CH2 (Bitfield-Mask: 0xff)      */
