zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define ADC2_TH0_3_UPPER_THUP_CH1_Pos     (8UL)                     /*!< ADC2 TH0_3_UPPER: THUP_CH1 (Bit 8)                    */
#define ADC2_TH0_3_UPPER_THUP_CH1_Msk     (0xff00UL)                /*!< ADC2 TH0_3_UPPER: THUP_CH1 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_UPPER_THUP_CH0_Pos     (0UL)                     /*!< ADC2 TH0_3_UPPER: THUP_CH0 (Bit 0)                    */
#define ADC2_TH0_3_UPPER_THUP_CH0_Msk     (0xffUL)                  /*!< ADC2 TH0_3_UPPER: THUP_CH0 (Bitfield-Mask: 0xff)      */
/* ======================================================  TH4_7_UPPER  ====================================================== */
#define ADC2_TH4_7_UPPER_THUP_CH7_Pos     (24UL)                    /*!< ADC2 TH4_7_UPPER: THUP_CH7 (Bit 24)                   */
#define ADC2_TH4_7_UPPER_THUP_CH7_Msk     (0xff000000UL)            /*!< ADC2 TH4_7_UPPER: THUP_CH7 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH6_Pos     (16UL)                    /*!< ADC2 TH4_7_UPPER: THUP_CH6 (Bit 16)                   */
#define ADC2_TH4_7_UPPER_THUP_CH6_Msk     (0xff0000UL)              /*!< ADC2 TH4_7_UPPER: THUP_CH6 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH5_Pos     (8UL)                     /*!< ADC2 TH4_7_UPPER: THUP_CH5 (Bit 8)                    */
#define ADC2_TH4_7_UPPER_THUP_CH5_Msk     (0xff00UL)                /*!< ADC2 TH4_7_UPPER: THUP_CH5 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH4_Pos     (0UL)                     /*!< ADC2 TH4_7_UPPER: THUP_CH4 (Bit 0)                    */
#define ADC2_TH4_7_UPPER_THUP_CH4_Msk     (0xffUL)                  /*!< ADC2 TH4_7_UPPER: THUP_CH4 (Bitfield-Mask: 0xff)      */
/* =====================================================  CNT0_3_UPPER  ====================================================== */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH3_Pos (27UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH3 (Bit 27)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH3_Msk (0x18000000UL)            /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH3 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH3_Pos  (24UL)                    /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH3 (Bit 24)                */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH3_Msk  (0x7000000UL)             /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH3 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH2_Pos (19UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH2 (Bit 19)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH2_Msk (0x180000UL)              /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH2 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH2_Pos  (16UL)                    /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH2 (Bit 16)                */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH2_Msk  (0x70000UL)               /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH2 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH1_Pos (11UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH1 (Bit 11)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH1_Msk (0x1800UL)                /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH1 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH1_Pos  (8UL)                     /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH1 (Bit 8)                 */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH1_Msk  (0x700UL)                 /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH1 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH0_Pos (3UL)                     /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH0 (Bit 3)                */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH0_Msk (0x18UL)                  /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH0 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH0_Pos  (0UL)                     /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH0 (Bit 0)                 */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH0_Msk  (0x7UL)                   /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH0 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT4_7_UPPER  ====================================================== */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH7_Pos (27UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH7 (Bit 27)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH7_Msk (0x18000000UL)            /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH7 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH7_Pos  (24UL)                    /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH7 (Bit 24)                */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH7_Msk  (0x7000000UL)             /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH7 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH6_Pos (19UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH6 (Bit 19)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH6_Msk (0x180000UL)              /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH6 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH6_Pos  (16UL)                    /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH6 (Bit 16)                */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH6_Msk  (0x70000UL)               /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH6 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH5_Pos (11UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH5 (Bit 11)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH5_Msk (0x1800UL)                /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH5 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH5_Pos  (8UL)                     /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH5 (Bit 8)                 */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH5_Msk  (0x700UL)                 /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH5 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH4_Pos (3UL)                     /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH4 (Bit 3)                */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH4_Msk (0x18UL)                  /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH4 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH4_Pos  (0UL)                     /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH4 (Bit 0)                 */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH4_Msk  (0x7UL)                   /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH4 (Bitfield-Mask: 0x07)   */
/* ======================================================  TH0_3_LOWER  ====================================================== */
#define ADC2_TH0_3_LOWER_THLO_CH3_Pos     (24UL)                    /*!< ADC2 TH0_3_LOWER: THLO_CH3 (Bit 24)                   */
#define ADC2_TH0_3_LOWER_THLO_CH3_Msk     (0xff000000UL)            /*!< ADC2 TH0_3_LOWER: THLO_CH3 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH2_Pos     (16UL)                    /*!< ADC2 TH0_3_LOWER: THLO_CH2 (Bit 16)                   */
#define ADC2_TH0_3_LOWER_THLO_CH2_Msk     (0xff0000UL)              /*!< ADC2 TH0_3_LOWER: THLO_CH2 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH1_Pos     (8UL)                     /*!< ADC2 TH0_3_LOWER: THLO_CH1 (Bit 8)                    */
#define ADC2_TH0_3_LOWER_THLO_CH1_Msk     (0xff00UL)                /*!< ADC2 TH0_3_LOWER: THLO_CH1 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH0_Pos     (0UL)                     /*!< ADC2 TH0_3_LOWER: THLO_CH0 (Bit 0)                    */
#define ADC2_TH0_3_LOWER_THLO_CH0_Msk     (0xffUL)                  /*!< ADC2 TH0_3_LOWER: THLO_CH0 (Bitfield-Mask: 0xff)      */
/* ======================================================  TH4_7_LOWER  ====================================================== */
#define ADC2_TH4_7_LOWER_THLO_CH7_Pos     (24UL)                    /*!< ADC2 TH4_7_LOWER: THLO_CH7 (Bit 24)                   */
#define ADC2_TH4_7_LOWER_THLO_CH7_Msk     (0xff000000UL)            /*!< ADC2 TH4_7_LOWER: THLO_CH7 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH6_Pos     (16UL)                    /*!< ADC2 TH4_7_LOWER: THLO_CH6 (Bit 16)                   */
#define ADC2_TH4_7_LOWER_THLO_CH6_Msk     (0xff0000UL)              /*!< ADC2 TH4_7_LOWER: THLO_CH6 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH5_Pos     (8UL)                     /*!< ADC2 TH4_7_LOWER: THLO_CH5 (Bit 8)                    */
#define ADC2_TH4_7_LOWER_THLO_CH5_Msk     (0xff00UL)                /*!< ADC2 TH4_7_LOWER: THLO_CH5 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH4_Pos     (0UL)                     /*!< ADC2 TH4_7_LOWER: THLO_CH4 (Bit 0)                    */
#define ADC2_TH4_7_LOWER_THLO_CH4_Msk     (0xffUL)                  /*!< ADC2 TH4_7_LOWER: THLO_CH4 (Bitfield-Mask: 0xff)      */
/* =====================================================  CNT0_3_LOWER  ====================================================== */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH3_Pos (27UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH3 (Bit 27)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH3_Msk (0x18000000UL)            /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH3 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH3_Pos  (24UL)                    /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH3 (Bit 24)                */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH3_Msk  (0x7000000UL)             /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH3 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH2_Pos (19UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH2 (Bit 19)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH2_Msk (0x180000UL)              /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH2 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH2_Pos  (16UL)                    /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH2 (Bit 16)                */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH2_Msk  (0x70000UL)               /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH2 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH1_Pos (11UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH1 (Bit 11)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH1_Msk (0x1800UL)                /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH1 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH1_Pos  (8UL)                     /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH1 (Bit 8)                 */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH1_Msk  (0x700UL)                 /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH1 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH0_Pos (3UL)                     /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH0 (Bit 3)                */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH0_Msk (0x18UL)                  /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH0 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH0_Pos  (0UL)                     /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH0 (Bit 0)                 */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH0_Msk  (0x7UL)                   /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH0 (Bitfield-Mask: 0x07)   */
/* =====================================================  CNT4_7_LOWER  ====================================================== */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH7_Pos (27UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH7 (Bit 27)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH7_Msk (0x18000000UL)            /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH7 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH7_Pos  (24UL)                    /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH7 (Bit 24)                */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH7_Msk  (0x7000000UL)             /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH7 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH6_Pos (19UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH6 (Bit 19)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH6_Msk (0x180000UL)              /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH6 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH6_Pos  (16UL)                    /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH6 (Bit 16)                */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH6_Msk  (0x70000UL)               /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH6 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH5_Pos (11UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH5 (Bit 11)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH5_Msk (0x1800UL)                /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH5 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH5_Pos  (8UL)                     /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH5 (Bit 8)                 */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH5_Msk  (0x700UL)                 /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH5 (Bitfield-Mask: 0x07)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH4_Pos (3UL)                     /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH4 (Bit 3)                */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH4_Msk (0x18UL)                  /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH4 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH4_Pos  (0UL)                     /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH4 (Bit 0)                 */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH4_Msk  (0x7UL)                   /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH4 (Bitfield-Mask: 0x07)   */


/* =========================================================================================================================== */
/* ================                                           CCU6                                            ================ */
/* =========================================================================================================================== */

