zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define CCU6_IEN_ENT12PM_Msk              (0x80UL)                  /*!< CCU6 IEN: ENT12PM (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENT12OM_Pos              (6UL)                     /*!< CCU6 IEN: ENT12OM (Bit 6)                             */
#define CCU6_IEN_ENT12OM_Msk              (0x40UL)                  /*!< CCU6 IEN: ENT12OM (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC62F_Pos              (5UL)                     /*!< CCU6 IEN: ENCC62F (Bit 5)                             */
#define CCU6_IEN_ENCC62F_Msk              (0x20UL)                  /*!< CCU6 IEN: ENCC62F (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC62R_Pos              (4UL)                     /*!< CCU6 IEN: ENCC62R (Bit 4)                             */
#define CCU6_IEN_ENCC62R_Msk              (0x10UL)                  /*!< CCU6 IEN: ENCC62R (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC61F_Pos              (3UL)                     /*!< CCU6 IEN: ENCC61F (Bit 3)                             */
#define CCU6_IEN_ENCC61F_Msk              (0x8UL)                   /*!< CCU6 IEN: ENCC61F (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC61R_Pos              (2UL)                     /*!< CCU6 IEN: ENCC61R (Bit 2)                             */
#define CCU6_IEN_ENCC61R_Msk              (0x4UL)                   /*!< CCU6 IEN: ENCC61R (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC60F_Pos              (1UL)                     /*!< CCU6 IEN: ENCC60F (Bit 1)                             */
#define CCU6_IEN_ENCC60F_Msk              (0x2UL)                   /*!< CCU6 IEN: ENCC60F (Bitfield-Mask: 0x01)               */
#define CCU6_IEN_ENCC60R_Pos              (0UL)                     /*!< CCU6 IEN: ENCC60R (Bit 0)                             */
#define CCU6_IEN_ENCC60R_Msk              (0x1UL)                   /*!< CCU6 IEN: ENCC60R (Bitfield-Mask: 0x01)               */
/* ==========================================================  INP  ========================================================== */
#define CCU6_INP_INPT13_Pos               (12UL)                    /*!< CCU6 INP: INPT13 (Bit 12)                             */
#define CCU6_INP_INPT13_Msk               (0x3000UL)                /*!< CCU6 INP: INPT13 (Bitfield-Mask: 0x03)                */
#define CCU6_INP_INPT12_Pos               (10UL)                    /*!< CCU6 INP: INPT12 (Bit 10)                             */
#define CCU6_INP_INPT12_Msk               (0xc00UL)                 /*!< CCU6 INP: INPT12 (Bitfield-Mask: 0x03)                */
#define CCU6_INP_INPERR_Pos               (8UL)                     /*!< CCU6 INP: INPERR (Bit 8)                              */
#define CCU6_INP_INPERR_Msk               (0x300UL)                 /*!< CCU6 INP: INPERR (Bitfield-Mask: 0x03)                */
#define CCU6_INP_INPCHE_Pos               (6UL)                     /*!< CCU6 INP: INPCHE (Bit 6)                              */
#define CCU6_INP_INPCHE_Msk               (0xc0UL)                  /*!< CCU6 INP: INPCHE (Bitfield-Mask: 0x03)                */
#define CCU6_INP_INPCC62_Pos              (4UL)                     /*!< CCU6 INP: INPCC62 (Bit 4)                             */
#define CCU6_INP_INPCC62_Msk              (0x30UL)                  /*!< CCU6 INP: INPCC62 (Bitfield-Mask: 0x03)               */
#define CCU6_INP_INPCC61_Pos              (2UL)                     /*!< CCU6 INP: INPCC61 (Bit 2)                             */
#define CCU6_INP_INPCC61_Msk              (0xcUL)                   /*!< CCU6 INP: INPCC61 (Bitfield-Mask: 0x03)               */
#define CCU6_INP_INPCC60_Pos              (0UL)                     /*!< CCU6 INP: INPCC60 (Bit 0)                             */
#define CCU6_INP_INPCC60_Msk              (0x3UL)                   /*!< CCU6 INP: INPCC60 (Bitfield-Mask: 0x03)               */


/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  SYSTICK_CSR  ====================================================== */
#define CPU_SYSTICK_CSR_COUNTFLAG_Pos     (16UL)                    /*!< CPU SYSTICK_CSR: COUNTFLAG (Bit 16)                   */
#define CPU_SYSTICK_CSR_COUNTFLAG_Msk     (0x10000UL)               /*!< CPU SYSTICK_CSR: COUNTFLAG (Bitfield-Mask: 0x01)      */
#define CPU_SYSTICK_CSR_CLKSOURCE_Pos     (2UL)                     /*!< CPU SYSTICK_CSR: CLKSOURCE (Bit 2)                    */
#define CPU_SYSTICK_CSR_CLKSOURCE_Msk     (0x4UL)                   /*!< CPU SYSTICK_CSR: CLKSOURCE (Bitfield-Mask: 0x01)      */
#define CPU_SYSTICK_CSR_TICKINT_Pos       (1UL)                     /*!< CPU SYSTICK_CSR: TICKINT (Bit 1)                      */
#define CPU_SYSTICK_CSR_TICKINT_Msk       (0x2UL)                   /*!< CPU SYSTICK_CSR: TICKINT (Bitfield-Mask: 0x01)        */
#define CPU_SYSTICK_CSR_ENABLE_Pos        (0UL)                     /*!< CPU SYSTICK_CSR: ENABLE (Bit 0)                       */
#define CPU_SYSTICK_CSR_ENABLE_Msk        (0x1UL)                   /*!< CPU SYSTICK_CSR: ENABLE (Bitfield-Mask: 0x01)         */
/* ======================================================  SYSTICK_RVR  ====================================================== */
#define CPU_SYSTICK_RVR_RELOAD_Pos        (0UL)                     /*!< CPU SYSTICK_RVR: RELOAD (Bit 0)                       */
#define CPU_SYSTICK_RVR_RELOAD_Msk        (0xffffffUL)              /*!< CPU SYSTICK_RVR: RELOAD (Bitfield-Mask: 0xffffff)     */
/* ======================================================  SYSTICK_CVR  ====================================================== */
#define CPU_SYSTICK_CVR_CURRENT_Pos       (0UL)                     /*!< CPU SYSTICK_CVR: CURRENT (Bit 0)                      */
#define CPU_SYSTICK_CVR_CURRENT_Msk       (0xffffffUL)              /*!< CPU SYSTICK_CVR: CURRENT (Bitfield-Mask: 0xffffff)    */
/* =====================================================  SYSTICK_CALIB  ===================================================== */
#define CPU_SYSTICK_CALIB_NOREF_Pos       (31UL)                    /*!< CPU SYSTICK_CALIB: NOREF (Bit 31)                     */
#define CPU_SYSTICK_CALIB_NOREF_Msk       (0x80000000UL)            /*!< CPU SYSTICK_CALIB: NOREF (Bitfield-Mask: 0x01)        */
#define CPU_SYSTICK_CALIB_SKEW_Pos        (30UL)                    /*!< CPU SYSTICK_CALIB: SKEW (Bit 30)                      */
#define CPU_SYSTICK_CALIB_SKEW_Msk        (0x40000000UL)            /*!< CPU SYSTICK_CALIB: SKEW (Bitfield-Mask: 0x01)         */
#define CPU_SYSTICK_CALIB_TENMS_Pos       (0UL)                     /*!< CPU SYSTICK_CALIB: TENMS (Bit 0)                      */
#define CPU_SYSTICK_CALIB_TENMS_Msk       (0xffffffUL)              /*!< CPU SYSTICK_CALIB: TENMS (Bitfield-Mask: 0xffffff)    */
/* =======================================================  NVIC_ISER  ======================================================= */
#define CPU_NVIC_ISER_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ISER: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ISER_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ISER: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ISER: Int_MON (Bit 22)                       */
#define CPU_NVIC_ISER_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ISER: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ISER: Int_DU (Bit 21)                        */
#define CPU_NVIC_ISER_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ISER: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISER_Int_HS2_Pos         (20UL)                    /*!< CPU NVIC_ISER: Int_HS2 (Bit 20)                       */
#define CPU_NVIC_ISER_Int_HS2_Msk         (0x100000UL)              /*!< CPU NVIC_ISER: Int_HS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_HS1_Pos         (19UL)                    /*!< CPU NVIC_ISER: Int_HS1 (Bit 19)                       */
#define CPU_NVIC_ISER_Int_HS1_Msk         (0x80000UL)               /*!< CPU NVIC_ISER: Int_HS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_LS2_Pos         (18UL)                    /*!< CPU NVIC_ISER: Int_LS2 (Bit 18)                       */
#define CPU_NVIC_ISER_Int_LS2_Msk         (0x40000UL)               /*!< CPU NVIC_ISER: Int_LS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_LS1_Pos         (17UL)                    /*!< CPU NVIC_ISER: Int_LS1 (Bit 17)                       */
#define CPU_NVIC_ISER_Int_LS1_Msk         (0x20000UL)               /*!< CPU NVIC_ISER: Int_LS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ISER: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ISER_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ISER: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ISER: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ISER_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ISER: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ISER: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ISER_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ISER: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ISER: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ISER_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ISER: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ISER: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ISER_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ISER: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ISER: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ISER_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ISER: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ISER: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ISER_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ISER: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ISER_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ISER_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ISER_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ISER_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ISER: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ISER_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ISER: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ISER: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ISER_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ISER: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ISER: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ISER_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ISER: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ISER: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ISER_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ISER: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* =======================================================  NVIC_ICER  ======================================================= */
#define CPU_NVIC_ICER_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ICER: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ICER_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ICER: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ICER: Int_MON (Bit 22)                       */
#define CPU_NVIC_ICER_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ICER: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ICER: Int_DU (Bit 21)                        */
#define CPU_NVIC_ICER_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ICER: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICER_Int_HS2_Pos         (20UL)                    /*!< CPU NVIC_ICER: Int_HS2 (Bit 20)                       */
#define CPU_NVIC_ICER_Int_HS2_Msk         (0x100000UL)              /*!< CPU NVIC_ICER: Int_HS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_HS1_Pos         (19UL)                    /*!< CPU NVIC_ICER: Int_HS1 (Bit 19)                       */
#define CPU_NVIC_ICER_Int_HS1_Msk         (0x80000UL)               /*!< CPU NVIC_ICER: Int_HS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_LS2_Pos         (18UL)                    /*!< CPU NVIC_ICER: Int_LS2 (Bit 18)                       */
#define CPU_NVIC_ICER_Int_LS2_Msk         (0x40000UL)               /*!< CPU NVIC_ICER: Int_LS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_LS1_Pos         (17UL)                    /*!< CPU NVIC_ICER: Int_LS1 (Bit 17)                       */
#define CPU_NVIC_ICER_Int_LS1_Msk         (0x20000UL)               /*!< CPU NVIC_ICER: Int_LS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ICER: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ICER_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ICER: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ICER: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ICER_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ICER: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ICER: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ICER_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ICER: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ICER: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ICER_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ICER: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ICER: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ICER_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ICER: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ICER: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ICER_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ICER: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ICER: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ICER_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ICER: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ICER_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ICER_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ICER_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ICER_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ICER: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ICER_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ICER: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ICER: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ICER_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ICER: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ICER: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ICER_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ICER: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ICER: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ICER_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ICER: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* =======================================================  NVIC_ISPR  ======================================================= */
#define CPU_NVIC_ISPR_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ISPR: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ISPR_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ISPR: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ISPR: Int_MON (Bit 22)                       */
#define CPU_NVIC_ISPR_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ISPR: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ISPR: Int_DU (Bit 21)                        */
#define CPU_NVIC_ISPR_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ISPR: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISPR_Int_HS2_Pos         (20UL)                    /*!< CPU NVIC_ISPR: Int_HS2 (Bit 20)                       */
#define CPU_NVIC_ISPR_Int_HS2_Msk         (0x100000UL)              /*!< CPU NVIC_ISPR: Int_HS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_HS1_Pos         (19UL)                    /*!< CPU NVIC_ISPR: Int_HS1 (Bit 19)                       */
#define CPU_NVIC_ISPR_Int_HS1_Msk         (0x80000UL)               /*!< CPU NVIC_ISPR: Int_HS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_LS2_Pos         (18UL)                    /*!< CPU NVIC_ISPR: Int_LS2 (Bit 18)                       */
#define CPU_NVIC_ISPR_Int_LS2_Msk         (0x40000UL)               /*!< CPU NVIC_ISPR: Int_LS2 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_LS1_Pos         (17UL)                    /*!< CPU NVIC_ISPR: Int_LS1 (Bit 17)                       */
#define CPU_NVIC_ISPR_Int_LS1_Msk         (0x20000UL)               /*!< CPU NVIC_ISPR: Int_LS1 (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ISPR: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ISPR_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ISPR: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ISPR: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ISPR_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ISPR: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ISPR: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ISPR_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ISPR: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ISPR: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ISPR_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ISPR: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ISPR: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ISPR_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ISPR: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ISPR: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ISPR_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ISPR: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ISPR: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ISPR_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ISPR: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ISPR: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ISPR_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ISPR: Int_ADC1 (Bitfield-Mask: 0x01)         */
