zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* =========================================================  CTRL  ========================================================== */
#define HS_CTRL_HS2_OC_SEL_Pos            (28UL)                    /*!< HS CTRL: HS2_OC_SEL (Bit 28)                          */
#define HS_CTRL_HS2_OC_SEL_Msk            (0x30000000UL)            /*!< HS CTRL: HS2_OC_SEL (Bitfield-Mask: 0x03)             */
#define HS_CTRL_HS2_SRCTL_SEL_Pos         (24UL)                    /*!< HS CTRL: HS2_SRCTL_SEL (Bit 24)                       */
#define HS_CTRL_HS2_SRCTL_SEL_Msk         (0x1000000UL)             /*!< HS CTRL: HS2_SRCTL_SEL (Bitfield-Mask: 0x01)          */
#define HS_CTRL_HS2_CYC_ON_ACTIVE_Pos     (23UL)                    /*!< HS CTRL: HS2_CYC_ON_ACTIVE (Bit 23)                   */
#define HS_CTRL_HS2_CYC_ON_ACTIVE_Msk     (0x800000UL)              /*!< HS CTRL: HS2_CYC_ON_ACTIVE (Bitfield-Mask: 0x01)      */
#define HS_CTRL_HS2_OL_EN_Pos             (19UL)                    /*!< HS CTRL: HS2_OL_EN (Bit 19)                           */
#define HS_CTRL_HS2_OL_EN_Msk             (0x80000UL)               /*!< HS CTRL: HS2_OL_EN (Bitfield-Mask: 0x01)              */
#define HS_CTRL_HS2_ON_Pos                (18UL)                    /*!< HS CTRL: HS2_ON (Bit 18)                              */
#define HS_CTRL_HS2_ON_Msk                (0x40000UL)               /*!< HS CTRL: HS2_ON (Bitfield-Mask: 0x01)                 */
#define HS_CTRL_HS2_PWM_Pos               (17UL)                    /*!< HS CTRL: HS2_PWM (Bit 17)                             */
#define HS_CTRL_HS2_PWM_Msk               (0x20000UL)               /*!< HS CTRL: HS2_PWM (Bitfield-Mask: 0x01)                */
#define HS_CTRL_HS2_EN_Pos                (16UL)                    /*!< HS CTRL: HS2_EN (Bit 16)                              */
#define HS_CTRL_HS2_EN_Msk                (0x10000UL)               /*!< HS CTRL: HS2_EN (Bitfield-Mask: 0x01)                 */
#define HS_CTRL_HS1_OC_SEL_Pos            (12UL)                    /*!< HS CTRL: HS1_OC_SEL (Bit 12)                          */
#define HS_CTRL_HS1_OC_SEL_Msk            (0x3000UL)                /*!< HS CTRL: HS1_OC_SEL (Bitfield-Mask: 0x03)             */
#define HS_CTRL_HS1_SRCTL_SEL_Pos         (8UL)                     /*!< HS CTRL: HS1_SRCTL_SEL (Bit 8)                        */
#define HS_CTRL_HS1_SRCTL_SEL_Msk         (0x100UL)                 /*!< HS CTRL: HS1_SRCTL_SEL (Bitfield-Mask: 0x01)          */
#define HS_CTRL_HS1_CYC_ON_ACTIVE_Pos     (7UL)                     /*!< HS CTRL: HS1_CYC_ON_ACTIVE (Bit 7)                    */
#define HS_CTRL_HS1_CYC_ON_ACTIVE_Msk     (0x80UL)                  /*!< HS CTRL: HS1_CYC_ON_ACTIVE (Bitfield-Mask: 0x01)      */
#define HS_CTRL_HS1_OL_EN_Pos             (3UL)                     /*!< HS CTRL: HS1_OL_EN (Bit 3)                            */
#define HS_CTRL_HS1_OL_EN_Msk             (0x8UL)                   /*!< HS CTRL: HS1_OL_EN (Bitfield-Mask: 0x01)              */
#define HS_CTRL_HS1_ON_Pos                (2UL)                     /*!< HS CTRL: HS1_ON (Bit 2)                               */
#define HS_CTRL_HS1_ON_Msk                (0x4UL)                   /*!< HS CTRL: HS1_ON (Bitfield-Mask: 0x01)                 */
#define HS_CTRL_HS1_PWM_Pos               (1UL)                     /*!< HS CTRL: HS1_PWM (Bit 1)                              */
#define HS_CTRL_HS1_PWM_Msk               (0x2UL)                   /*!< HS CTRL: HS1_PWM (Bitfield-Mask: 0x01)                */
#define HS_CTRL_HS1_EN_Pos                (0UL)                     /*!< HS CTRL: HS1_EN (Bit 0)                               */
#define HS_CTRL_HS1_EN_Msk                (0x1UL)                   /*!< HS CTRL: HS1_EN (Bitfield-Mask: 0x01)                 */
/* =========================================================  IRQS  ========================================================== */
#define HS_IRQS_HS2_OL_STS_Pos            (30UL)                    /*!< HS IRQS: HS2_OL_STS (Bit 30)                          */
#define HS_IRQS_HS2_OL_STS_Msk            (0x40000000UL)            /*!< HS IRQS: HS2_OL_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS2_OT_STS_Pos            (29UL)                    /*!< HS IRQS: HS2_OT_STS (Bit 29)                          */
#define HS_IRQS_HS2_OT_STS_Msk            (0x20000000UL)            /*!< HS IRQS: HS2_OT_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS2_OC_IS_Pos             (23UL)                    /*!< HS IRQS: HS2_OC_IS (Bit 23)                           */
#define HS_IRQS_HS2_OC_IS_Msk             (0x800000UL)              /*!< HS IRQS: HS2_OC_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS2_OL_IS_Pos             (22UL)                    /*!< HS IRQS: HS2_OL_IS (Bit 22)                           */
#define HS_IRQS_HS2_OL_IS_Msk             (0x400000UL)              /*!< HS IRQS: HS2_OL_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS2_OT_IS_Pos             (21UL)                    /*!< HS IRQS: HS2_OT_IS (Bit 21)                           */
#define HS_IRQS_HS2_OT_IS_Msk             (0x200000UL)              /*!< HS IRQS: HS2_OT_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS1_OL_STS_Pos            (14UL)                    /*!< HS IRQS: HS1_OL_STS (Bit 14)                          */
#define HS_IRQS_HS1_OL_STS_Msk            (0x4000UL)                /*!< HS IRQS: HS1_OL_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS1_OT_STS_Pos            (13UL)                    /*!< HS IRQS: HS1_OT_STS (Bit 13)                          */
#define HS_IRQS_HS1_OT_STS_Msk            (0x2000UL)                /*!< HS IRQS: HS1_OT_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS1_OC_IS_Pos             (7UL)                     /*!< HS IRQS: HS1_OC_IS (Bit 7)                            */
#define HS_IRQS_HS1_OC_IS_Msk             (0x80UL)                  /*!< HS IRQS: HS1_OC_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS1_OL_IS_Pos             (6UL)                     /*!< HS IRQS: HS1_OL_IS (Bit 6)                            */
#define HS_IRQS_HS1_OL_IS_Msk             (0x40UL)                  /*!< HS IRQS: HS1_OL_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS1_OT_IS_Pos             (5UL)                     /*!< HS IRQS: HS1_OT_IS (Bit 5)                            */
#define HS_IRQS_HS1_OT_IS_Msk             (0x20UL)                  /*!< HS IRQS: HS1_OT_IS (Bitfield-Mask: 0x01)              */
/* ========================================================  IRQCLR  ========================================================= */
#define HS_IRQCLR_HS2_OL_SC_Pos           (30UL)                    /*!< HS IRQCLR: HS2_OL_SC (Bit 30)                         */
#define HS_IRQCLR_HS2_OL_SC_Msk           (0x40000000UL)            /*!< HS IRQCLR: HS2_OL_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS2_OT_SC_Pos           (29UL)                    /*!< HS IRQCLR: HS2_OT_SC (Bit 29)                         */
#define HS_IRQCLR_HS2_OT_SC_Msk           (0x20000000UL)            /*!< HS IRQCLR: HS2_OT_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS2_OC_ISC_Pos          (23UL)                    /*!< HS IRQCLR: HS2_OC_ISC (Bit 23)                        */
#define HS_IRQCLR_HS2_OC_ISC_Msk          (0x800000UL)              /*!< HS IRQCLR: HS2_OC_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS2_OL_ISC_Pos          (22UL)                    /*!< HS IRQCLR: HS2_OL_ISC (Bit 22)                        */
#define HS_IRQCLR_HS2_OL_ISC_Msk          (0x400000UL)              /*!< HS IRQCLR: HS2_OL_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS2_OT_ISC_Pos          (21UL)                    /*!< HS IRQCLR: HS2_OT_ISC (Bit 21)                        */
#define HS_IRQCLR_HS2_OT_ISC_Msk          (0x200000UL)              /*!< HS IRQCLR: HS2_OT_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS1_OL_SC_Pos           (14UL)                    /*!< HS IRQCLR: HS1_OL_SC (Bit 14)                         */
#define HS_IRQCLR_HS1_OL_SC_Msk           (0x4000UL)                /*!< HS IRQCLR: HS1_OL_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS1_OT_SC_Pos           (13UL)                    /*!< HS IRQCLR: HS1_OT_SC (Bit 13)                         */
#define HS_IRQCLR_HS1_OT_SC_Msk           (0x2000UL)                /*!< HS IRQCLR: HS1_OT_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS1_OC_ISC_Pos          (7UL)                     /*!< HS IRQCLR: HS1_OC_ISC (Bit 7)                         */
#define HS_IRQCLR_HS1_OC_ISC_Msk          (0x80UL)                  /*!< HS IRQCLR: HS1_OC_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS1_OL_ISC_Pos          (6UL)                     /*!< HS IRQCLR: HS1_OL_ISC (Bit 6)                         */
#define HS_IRQCLR_HS1_OL_ISC_Msk          (0x40UL)                  /*!< HS IRQCLR: HS1_OL_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS1_OT_ISC_Pos          (5UL)                     /*!< HS IRQCLR: HS1_OT_ISC (Bit 5)                         */
#define HS_IRQCLR_HS1_OT_ISC_Msk          (0x20UL)                  /*!< HS IRQCLR: HS1_OT_ISC (Bitfield-Mask: 0x01)           */
/* =========================================================  IRQEN  ========================================================= */
#define HS_IRQEN_HS2_OC_IEN_Pos           (23UL)                    /*!< HS IRQEN: HS2_OC_IEN (Bit 23)                         */
#define HS_IRQEN_HS2_OC_IEN_Msk           (0x800000UL)              /*!< HS IRQEN: HS2_OC_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS2_OL_IEN_Pos           (22UL)                    /*!< HS IRQEN: HS2_OL_IEN (Bit 22)                         */
#define HS_IRQEN_HS2_OL_IEN_Msk           (0x400000UL)              /*!< HS IRQEN: HS2_OL_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS2_OT_IEN_Pos           (21UL)                    /*!< HS IRQEN: HS2_OT_IEN (Bit 21)                         */
#define HS_IRQEN_HS2_OT_IEN_Msk           (0x200000UL)              /*!< HS IRQEN: HS2_OT_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS1_OC_IEN_Pos           (7UL)                     /*!< HS IRQEN: HS1_OC_IEN (Bit 7)                          */
#define HS_IRQEN_HS1_OC_IEN_Msk           (0x80UL)                  /*!< HS IRQEN: HS1_OC_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS1_OL_IEN_Pos           (6UL)                     /*!< HS IRQEN: HS1_OL_IEN (Bit 6)                          */
#define HS_IRQEN_HS1_OL_IEN_Msk           (0x40UL)                  /*!< HS IRQEN: HS1_OL_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS1_OT_IEN_Pos           (5UL)                     /*!< HS IRQEN: HS1_OT_IEN (Bit 5)                          */
#define HS_IRQEN_HS1_OT_IEN_Msk           (0x20UL)                  /*!< HS IRQEN: HS1_OT_IEN (Bitfield-Mask: 0x01)            */
/* =======================================================  PWMSRCSEL  ======================================================= */
#define HS_PWMSRCSEL_HS1_SRC_SEL_Pos      (3UL)                     /*!< HS PWMSRCSEL: HS1_SRC_SEL (Bit 3)                     */
#define HS_PWMSRCSEL_HS1_SRC_SEL_Msk      (0x38UL)                  /*!< HS PWMSRCSEL: HS1_SRC_SEL (Bitfield-Mask: 0x07)       */
#define HS_PWMSRCSEL_HS2_SRC_SEL_Pos      (0UL)                     /*!< HS PWMSRCSEL: HS2_SRC_SEL (Bit 0)                     */
#define HS_PWMSRCSEL_HS2_SRC_SEL_Msk      (0x7UL)                   /*!< HS PWMSRCSEL: HS2_SRC_SEL (Bitfield-Mask: 0x07)       */
/* =======================================================  HS1_TRIM  ======================================================== */
#define HS_HS1_TRIM_HS1_OC_OT_BTFILT_SEL_Pos (8UL)                  /*!< HS HS1_TRIM: HS1_OC_OT_BTFILT_SEL (Bit 8)             */
#define HS_HS1_TRIM_HS1_OC_OT_BTFILT_SEL_Msk (0x300UL)              /*!< HS HS1_TRIM: HS1_OC_OT_BTFILT_SEL (Bitfield-Mask: 0x03) */
#define HS_HS1_TRIM_HS1_OL_BTFILT_SEL_Pos (0UL)                     /*!< HS HS1_TRIM: HS1_OL_BTFILT_SEL (Bit 0)                */
#define HS_HS1_TRIM_HS1_OL_BTFILT_SEL_Msk (0x3UL)                   /*!< HS HS1_TRIM: HS1_OL_BTFILT_SEL (Bitfield-Mask: 0x03)  */
/* =======================================================  HS2_TRIM  ======================================================== */
#define HS_HS2_TRIM_HS2_OC_OT_BTFILT_SEL_Pos (8UL)                  /*!< HS HS2_TRIM: HS2_OC_OT_BTFILT_SEL (Bit 8)             */
#define HS_HS2_TRIM_HS2_OC_OT_BTFILT_SEL_Msk (0x300UL)              /*!< HS HS2_TRIM: HS2_OC_OT_BTFILT_SEL (Bitfield-Mask: 0x03) */
#define HS_HS2_TRIM_HS2_OL_BTFILT_SEL_Pos (0UL)                     /*!< HS HS2_TRIM: HS2_OL_BTFILT_SEL (Bit 0)                */
#define HS_HS2_TRIM_HS2_OL_BTFILT_SEL_Msk (0x3UL)                   /*!< HS HS2_TRIM: HS2_OL_BTFILT_SEL (Bitfield-Mask: 0x03)  */


/* =========================================================================================================================== */
/* ================                                            LIN                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define LIN_CTRL_HV_MODE_Pos              (21UL)                    /*!< LIN CTRL: HV_MODE (Bit 21)                            */
#define LIN_CTRL_HV_MODE_Msk              (0x200000UL)              /*!< LIN CTRL: HV_MODE (Bitfield-Mask: 0x01)               */
#define LIN_CTRL_FB_SM3_Pos               (15UL)                    /*!< LIN CTRL: FB_SM3 (Bit 15)                             */
#define LIN_CTRL_FB_SM3_Msk               (0x8000UL)                /*!< LIN CTRL: FB_SM3 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_FB_SM2_Pos               (14UL)                    /*!< LIN CTRL: FB_SM2 (Bit 14)                             */
#define LIN_CTRL_FB_SM2_Msk               (0x4000UL)                /*!< LIN CTRL: FB_SM2 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_FB_SM1_Pos               (13UL)                    /*!< LIN CTRL: FB_SM1 (Bit 13)                             */
#define LIN_CTRL_FB_SM1_Msk               (0x2000UL)                /*!< LIN CTRL: FB_SM1 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_SM_Pos                   (11UL)                    /*!< LIN CTRL: SM (Bit 11)                                 */
#define LIN_CTRL_SM_Msk                   (0x1800UL)                /*!< LIN CTRL: SM (Bitfield-Mask: 0x03)                    */
#define LIN_CTRL_RXD_Pos                  (10UL)                    /*!< LIN CTRL: RXD (Bit 10)                                */
#define LIN_CTRL_RXD_Msk                  (0x400UL)                 /*!< LIN CTRL: RXD (Bitfield-Mask: 0x01)                   */
#define LIN_CTRL_TXD_Pos                  (9UL)                     /*!< LIN CTRL: TXD (Bit 9)                                 */
#define LIN_CTRL_TXD_Msk                  (0x200UL)                 /*!< LIN CTRL: TXD (Bitfield-Mask: 0x01)                   */
#define LIN_CTRL_MODE_FB_Pos              (4UL)                     /*!< LIN CTRL: MODE_FB (Bit 4)                             */
#define LIN_CTRL_MODE_FB_Msk              (0x70UL)                  /*!< LIN CTRL: MODE_FB (Bitfield-Mask: 0x07)               */
#define LIN_CTRL_MODE_Pos                 (1UL)                     /*!< LIN CTRL: MODE (Bit 1)                                */
#define LIN_CTRL_MODE_Msk                 (0x6UL)                   /*!< LIN CTRL: MODE (Bitfield-Mask: 0x03)                  */
/* =========================================================  IRQS  ========================================================== */
#define LIN_IRQS_TXD_TMOUT_STS_Pos        (11UL)                    /*!< LIN IRQS: TXD_TMOUT_STS (Bit 11)                      */
#define LIN_IRQS_TXD_TMOUT_STS_Msk        (0x800UL)                 /*!< LIN IRQS: TXD_TMOUT_STS (Bitfield-Mask: 0x01)         */
#define LIN_IRQS_OT_STS_Pos               (9UL)                     /*!< LIN IRQS: OT_STS (Bit 9)                              */
#define LIN_IRQS_OT_STS_Msk               (0x200UL)                 /*!< LIN IRQS: OT_STS (Bitfield-Mask: 0x01)                */
#define LIN_IRQS_M_SM_ERR_STS_Pos         (8UL)                     /*!< LIN IRQS: M_SM_ERR_STS (Bit 8)                        */
#define LIN_IRQS_M_SM_ERR_STS_Msk         (0x100UL)                 /*!< LIN IRQS: M_SM_ERR_STS (Bitfield-Mask: 0x01)          */
#define LIN_IRQS_TXD_TMOUT_IS_Pos         (6UL)                     /*!< LIN IRQS: TXD_TMOUT_IS (Bit 6)                        */
#define LIN_IRQS_TXD_TMOUT_IS_Msk         (0x40UL)                  /*!< LIN IRQS: TXD_TMOUT_IS (Bitfield-Mask: 0x01)          */
#define LIN_IRQS_OC_IS_Pos                (5UL)                     /*!< LIN IRQS: OC_IS (Bit 5)                               */
#define LIN_IRQS_OC_IS_Msk                (0x20UL)                  /*!< LIN IRQS: OC_IS (Bitfield-Mask: 0x01)                 */
#define LIN_IRQS_OT_IS_Pos                (4UL)                     /*!< LIN IRQS: OT_IS (Bit 4)                               */
#define LIN_IRQS_OT_IS_Msk                (0x10UL)                  /*!< LIN IRQS: OT_IS (Bitfield-Mask: 0x01)                 */
#define LIN_IRQS_M_SM_ERR_IS_Pos          (3UL)                     /*!< LIN IRQS: M_SM_ERR_IS (Bit 3)                         */
#define LIN_IRQS_M_SM_ERR_IS_Msk          (0x8UL)                   /*!< LIN IRQS: M_SM_ERR_IS (Bitfield-Mask: 0x01)           */
/* ========================================================  IRQCLR  ========================================================= */
#define LIN_IRQCLR_TXD_TMOUT_SC_Pos       (11UL)                    /*!< LIN IRQCLR: TXD_TMOUT_SC (Bit 11)                     */
#define LIN_IRQCLR_TXD_TMOUT_SC_Msk       (0x800UL)                 /*!< LIN IRQCLR: TXD_TMOUT_SC (Bitfield-Mask: 0x01)        */
#define LIN_IRQCLR_OT_SC_Pos              (9UL)                     /*!< LIN IRQCLR: OT_SC (Bit 9)                             */
#define LIN_IRQCLR_OT_SC_Msk              (0x200UL)                 /*!< LIN IRQCLR: OT_SC (Bitfield-Mask: 0x01)               */
#define LIN_IRQCLR_M_SM_ERR_SC_Pos        (8UL)                     /*!< LIN IRQCLR: M_SM_ERR_SC (Bit 8)                       */
#define LIN_IRQCLR_M_SM_ERR_SC_Msk        (0x100UL)                 /*!< LIN IRQCLR: M_SM_ERR_SC (Bitfield-Mask: 0x01)         */
#define LIN_IRQCLR_TXD_TMOUT_ISC_Pos      (6UL)                     /*!< LIN IRQCLR: TXD_TMOUT_ISC (Bit 6)                     */
#define LIN_IRQCLR_TXD_TMOUT_ISC_Msk      (0x40UL)                  /*!< LIN IRQCLR: TXD_TMOUT_ISC (Bitfield-Mask: 0x01)       */
#define LIN_IRQCLR_OC_ISC_Pos             (5UL)                     /*!< LIN IRQCLR: OC_ISC (Bit 5)                            */
#define LIN_IRQCLR_OC_ISC_Msk             (0x20UL)                  /*!< LIN IRQCLR: OC_ISC (Bitfield-Mask: 0x01)              */
#define LIN_IRQCLR_OT_ISC_Pos             (4UL)                     /*!< LIN IRQCLR: OT_ISC (Bit 4)                            */
#define LIN_IRQCLR_OT_ISC_Msk             (0x10UL)                  /*!< LIN IRQCLR: OT_ISC (Bitfield-Mask: 0x01)              */
#define LIN_IRQCLR_M_SM_ERR_ISC_Pos       (3UL)                     /*!< LIN IRQCLR: M_SM_ERR_ISC (Bit 3)                      */
#define LIN_IRQCLR_M_SM_ERR_ISC_Msk       (0x8UL)                   /*!< LIN IRQCLR: M_SM_ERR_ISC (Bitfield-Mask: 0x01)        */
/* =========================================================  IRQEN  ========================================================= */
#define LIN_IRQEN_TXD_TMOUT_IEN_Pos       (6UL)                     /*!< LIN IRQEN: TXD_TMOUT_IEN (Bit 6)                      */
#define LIN_IRQEN_TXD_TMOUT_IEN_Msk       (0x40UL)                  /*!< LIN IRQEN: TXD_TMOUT_IEN (Bitfield-Mask: 0x01)        */
#define LIN_IRQEN_OC_IEN_Pos              (5UL)                     /*!< LIN IRQEN: OC_IEN (Bit 5)                             */
#define LIN_IRQEN_OC_IEN_Msk              (0x20UL)                  /*!< LIN IRQEN: OC_IEN (Bitfield-Mask: 0x01)               */
#define LIN_IRQEN_OT_IEN_Pos              (4UL)                     /*!< LIN IRQEN: OT_IEN (Bit 4)                             */
#define LIN_IRQEN_OT_IEN_Msk              (0x10UL)                  /*!< LIN IRQEN: OT_IEN (Bitfield-Mask: 0x01)               */
#define LIN_IRQEN_M_SM_ERR_IEN_Pos        (3UL)                     /*!< LIN IRQEN: M_SM_ERR_IEN (Bit 3)                       */
#define LIN_IRQEN_M_SM_ERR_IEN_Msk        (0x8UL)                   /*!< LIN IRQEN: M_SM_ERR_IEN (Bitfield-Mask: 0x01)         */


/* =========================================================================================================================== */
/* ================                                            LS                                             ================ */
/* =========================================================================================================================== */

