zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* =========================================================  CTRL  ========================================================== */
#define LS_CTRL_LS2_SRCTL_SEL_Pos         (24UL)                    /*!< LS CTRL: LS2_SRCTL_SEL (Bit 24)                       */
#define LS_CTRL_LS2_SRCTL_SEL_Msk         (0x1000000UL)             /*!< LS CTRL: LS2_SRCTL_SEL (Bitfield-Mask: 0x01)          */
#define LS_CTRL_LS2_OL_EN_Pos             (19UL)                    /*!< LS CTRL: LS2_OL_EN (Bit 19)                           */
#define LS_CTRL_LS2_OL_EN_Msk             (0x80000UL)               /*!< LS CTRL: LS2_OL_EN (Bitfield-Mask: 0x01)              */
#define LS_CTRL_LS2_ON_Pos                (18UL)                    /*!< LS CTRL: LS2_ON (Bit 18)                              */
#define LS_CTRL_LS2_ON_Msk                (0x40000UL)               /*!< LS CTRL: LS2_ON (Bitfield-Mask: 0x01)                 */
#define LS_CTRL_LS2_PWM_Pos               (17UL)                    /*!< LS CTRL: LS2_PWM (Bit 17)                             */
#define LS_CTRL_LS2_PWM_Msk               (0x20000UL)               /*!< LS CTRL: LS2_PWM (Bitfield-Mask: 0x01)                */
#define LS_CTRL_LS2_EN_Pos                (16UL)                    /*!< LS CTRL: LS2_EN (Bit 16)                              */
#define LS_CTRL_LS2_EN_Msk                (0x10000UL)               /*!< LS CTRL: LS2_EN (Bitfield-Mask: 0x01)                 */
#define LS_CTRL_LS1_SRCTL_SEL_Pos         (8UL)                     /*!< LS CTRL: LS1_SRCTL_SEL (Bit 8)                        */
#define LS_CTRL_LS1_SRCTL_SEL_Msk         (0x100UL)                 /*!< LS CTRL: LS1_SRCTL_SEL (Bitfield-Mask: 0x01)          */
#define LS_CTRL_LS1_OL_EN_Pos             (3UL)                     /*!< LS CTRL: LS1_OL_EN (Bit 3)                            */
#define LS_CTRL_LS1_OL_EN_Msk             (0x8UL)                   /*!< LS CTRL: LS1_OL_EN (Bitfield-Mask: 0x01)              */
#define LS_CTRL_LS1_ON_Pos                (2UL)                     /*!< LS CTRL: LS1_ON (Bit 2)                               */
#define LS_CTRL_LS1_ON_Msk                (0x4UL)                   /*!< LS CTRL: LS1_ON (Bitfield-Mask: 0x01)                 */
#define LS_CTRL_LS1_PWM_Pos               (1UL)                     /*!< LS CTRL: LS1_PWM (Bit 1)                              */
#define LS_CTRL_LS1_PWM_Msk               (0x2UL)                   /*!< LS CTRL: LS1_PWM (Bitfield-Mask: 0x01)                */
#define LS_CTRL_LS1_EN_Pos                (0UL)                     /*!< LS CTRL: LS1_EN (Bit 0)                               */
#define LS_CTRL_LS1_EN_Msk                (0x1UL)                   /*!< LS CTRL: LS1_EN (Bitfield-Mask: 0x01)                 */
/* =========================================================  IRQS  ========================================================== */
#define LS_IRQS_LS2_OL_STS_Pos            (30UL)                    /*!< LS IRQS: LS2_OL_STS (Bit 30)                          */
#define LS_IRQS_LS2_OL_STS_Msk            (0x40000000UL)            /*!< LS IRQS: LS2_OL_STS (Bitfield-Mask: 0x01)             */
#define LS_IRQS_LS2_OT_STS_Pos            (29UL)                    /*!< LS IRQS: LS2_OT_STS (Bit 29)                          */
#define LS_IRQS_LS2_OT_STS_Msk            (0x20000000UL)            /*!< LS IRQS: LS2_OT_STS (Bitfield-Mask: 0x01)             */
#define LS_IRQS_LS2_OT_PREWARN_STS_Pos    (28UL)                    /*!< LS IRQS: LS2_OT_PREWARN_STS (Bit 28)                  */
#define LS_IRQS_LS2_OT_PREWARN_STS_Msk    (0x10000000UL)            /*!< LS IRQS: LS2_OT_PREWARN_STS (Bitfield-Mask: 0x01)     */
#define LS_IRQS_LS2_OC_IS_Pos             (23UL)                    /*!< LS IRQS: LS2_OC_IS (Bit 23)                           */
#define LS_IRQS_LS2_OC_IS_Msk             (0x800000UL)              /*!< LS IRQS: LS2_OC_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS2_OL_IS_Pos             (22UL)                    /*!< LS IRQS: LS2_OL_IS (Bit 22)                           */
#define LS_IRQS_LS2_OL_IS_Msk             (0x400000UL)              /*!< LS IRQS: LS2_OL_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS2_OT_IS_Pos             (21UL)                    /*!< LS IRQS: LS2_OT_IS (Bit 21)                           */
#define LS_IRQS_LS2_OT_IS_Msk             (0x200000UL)              /*!< LS IRQS: LS2_OT_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS2_OT_PREWARN_IS_Pos     (20UL)                    /*!< LS IRQS: LS2_OT_PREWARN_IS (Bit 20)                   */
#define LS_IRQS_LS2_OT_PREWARN_IS_Msk     (0x100000UL)              /*!< LS IRQS: LS2_OT_PREWARN_IS (Bitfield-Mask: 0x01)      */
#define LS_IRQS_LS1_OL_STS_Pos            (14UL)                    /*!< LS IRQS: LS1_OL_STS (Bit 14)                          */
#define LS_IRQS_LS1_OL_STS_Msk            (0x4000UL)                /*!< LS IRQS: LS1_OL_STS (Bitfield-Mask: 0x01)             */
#define LS_IRQS_LS1_OT_STS_Pos            (13UL)                    /*!< LS IRQS: LS1_OT_STS (Bit 13)                          */
#define LS_IRQS_LS1_OT_STS_Msk            (0x2000UL)                /*!< LS IRQS: LS1_OT_STS (Bitfield-Mask: 0x01)             */
#define LS_IRQS_LS1_OT_PREWARN_STS_Pos    (12UL)                    /*!< LS IRQS: LS1_OT_PREWARN_STS (Bit 12)                  */
#define LS_IRQS_LS1_OT_PREWARN_STS_Msk    (0x1000UL)                /*!< LS IRQS: LS1_OT_PREWARN_STS (Bitfield-Mask: 0x01)     */
#define LS_IRQS_LS1_OC_IS_Pos             (7UL)                     /*!< LS IRQS: LS1_OC_IS (Bit 7)                            */
#define LS_IRQS_LS1_OC_IS_Msk             (0x80UL)                  /*!< LS IRQS: LS1_OC_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS1_OL_IS_Pos             (6UL)                     /*!< LS IRQS: LS1_OL_IS (Bit 6)                            */
#define LS_IRQS_LS1_OL_IS_Msk             (0x40UL)                  /*!< LS IRQS: LS1_OL_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS1_OT_IS_Pos             (5UL)                     /*!< LS IRQS: LS1_OT_IS (Bit 5)                            */
#define LS_IRQS_LS1_OT_IS_Msk             (0x20UL)                  /*!< LS IRQS: LS1_OT_IS (Bitfield-Mask: 0x01)              */
#define LS_IRQS_LS1_OT_PREWARN_IS_Pos     (4UL)                     /*!< LS IRQS: LS1_OT_PREWARN_IS (Bit 4)                    */
#define LS_IRQS_LS1_OT_PREWARN_IS_Msk     (0x10UL)                  /*!< LS IRQS: LS1_OT_PREWARN_IS (Bitfield-Mask: 0x01)      */
/* ========================================================  IRQCLR  ========================================================= */
#define LS_IRQCLR_LS2_OL_SC_Pos           (30UL)                    /*!< LS IRQCLR: LS2_OL_SC (Bit 30)                         */
#define LS_IRQCLR_LS2_OL_SC_Msk           (0x40000000UL)            /*!< LS IRQCLR: LS2_OL_SC (Bitfield-Mask: 0x01)            */
#define LS_IRQCLR_LS2_OT_SC_Pos           (29UL)                    /*!< LS IRQCLR: LS2_OT_SC (Bit 29)                         */
#define LS_IRQCLR_LS2_OT_SC_Msk           (0x20000000UL)            /*!< LS IRQCLR: LS2_OT_SC (Bitfield-Mask: 0x01)            */
#define LS_IRQCLR_LS2_OT_PREWARN_SC_Pos   (28UL)                    /*!< LS IRQCLR: LS2_OT_PREWARN_SC (Bit 28)                 */
#define LS_IRQCLR_LS2_OT_PREWARN_SC_Msk   (0x10000000UL)            /*!< LS IRQCLR: LS2_OT_PREWARN_SC (Bitfield-Mask: 0x01)    */
#define LS_IRQCLR_LS2_OC_ISC_Pos          (23UL)                    /*!< LS IRQCLR: LS2_OC_ISC (Bit 23)                        */
#define LS_IRQCLR_LS2_OC_ISC_Msk          (0x800000UL)              /*!< LS IRQCLR: LS2_OC_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS2_OL_ISC_Pos          (22UL)                    /*!< LS IRQCLR: LS2_OL_ISC (Bit 22)                        */
#define LS_IRQCLR_LS2_OL_ISC_Msk          (0x400000UL)              /*!< LS IRQCLR: LS2_OL_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS2_OT_ISC_Pos          (21UL)                    /*!< LS IRQCLR: LS2_OT_ISC (Bit 21)                        */
#define LS_IRQCLR_LS2_OT_ISC_Msk          (0x200000UL)              /*!< LS IRQCLR: LS2_OT_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS2_OT_PREWARN_ISC_Pos  (20UL)                    /*!< LS IRQCLR: LS2_OT_PREWARN_ISC (Bit 20)                */
#define LS_IRQCLR_LS2_OT_PREWARN_ISC_Msk  (0x100000UL)              /*!< LS IRQCLR: LS2_OT_PREWARN_ISC (Bitfield-Mask: 0x01)   */
#define LS_IRQCLR_LS1_OL_SC_Pos           (14UL)                    /*!< LS IRQCLR: LS1_OL_SC (Bit 14)                         */
#define LS_IRQCLR_LS1_OL_SC_Msk           (0x4000UL)                /*!< LS IRQCLR: LS1_OL_SC (Bitfield-Mask: 0x01)            */
#define LS_IRQCLR_LS1_OT_SC_Pos           (13UL)                    /*!< LS IRQCLR: LS1_OT_SC (Bit 13)                         */
#define LS_IRQCLR_LS1_OT_SC_Msk           (0x2000UL)                /*!< LS IRQCLR: LS1_OT_SC (Bitfield-Mask: 0x01)            */
#define LS_IRQCLR_LS1_OT_PREWARN_SC_Pos   (12UL)                    /*!< LS IRQCLR: LS1_OT_PREWARN_SC (Bit 12)                 */
#define LS_IRQCLR_LS1_OT_PREWARN_SC_Msk   (0x1000UL)                /*!< LS IRQCLR: LS1_OT_PREWARN_SC (Bitfield-Mask: 0x01)    */
#define LS_IRQCLR_LS1_OC_ISC_Pos          (7UL)                     /*!< LS IRQCLR: LS1_OC_ISC (Bit 7)                         */
#define LS_IRQCLR_LS1_OC_ISC_Msk          (0x80UL)                  /*!< LS IRQCLR: LS1_OC_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS1_OL_ISC_Pos          (6UL)                     /*!< LS IRQCLR: LS1_OL_ISC (Bit 6)                         */
#define LS_IRQCLR_LS1_OL_ISC_Msk          (0x40UL)                  /*!< LS IRQCLR: LS1_OL_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS1_OT_ISC_Pos          (5UL)                     /*!< LS IRQCLR: LS1_OT_ISC (Bit 5)                         */
#define LS_IRQCLR_LS1_OT_ISC_Msk          (0x20UL)                  /*!< LS IRQCLR: LS1_OT_ISC (Bitfield-Mask: 0x01)           */
#define LS_IRQCLR_LS1_OT_PREWARN_ISC_Pos  (4UL)                     /*!< LS IRQCLR: LS1_OT_PREWARN_ISC (Bit 4)                 */
#define LS_IRQCLR_LS1_OT_PREWARN_ISC_Msk  (0x10UL)                  /*!< LS IRQCLR: LS1_OT_PREWARN_ISC (Bitfield-Mask: 0x01)   */
/* =========================================================  IRQEN  ========================================================= */
#define LS_IRQEN_LS2_OC_IEN_Pos           (23UL)                    /*!< LS IRQEN: LS2_OC_IEN (Bit 23)                         */
#define LS_IRQEN_LS2_OC_IEN_Msk           (0x800000UL)              /*!< LS IRQEN: LS2_OC_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS2_OL_IEN_Pos           (22UL)                    /*!< LS IRQEN: LS2_OL_IEN (Bit 22)                         */
#define LS_IRQEN_LS2_OL_IEN_Msk           (0x400000UL)              /*!< LS IRQEN: LS2_OL_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS2_OT_IEN_Pos           (21UL)                    /*!< LS IRQEN: LS2_OT_IEN (Bit 21)                         */
#define LS_IRQEN_LS2_OT_IEN_Msk           (0x200000UL)              /*!< LS IRQEN: LS2_OT_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS2_OT_PREWARN_IEN_Pos   (20UL)                    /*!< LS IRQEN: LS2_OT_PREWARN_IEN (Bit 20)                 */
#define LS_IRQEN_LS2_OT_PREWARN_IEN_Msk   (0x100000UL)              /*!< LS IRQEN: LS2_OT_PREWARN_IEN (Bitfield-Mask: 0x01)    */
#define LS_IRQEN_LS1_OC_IEN_Pos           (7UL)                     /*!< LS IRQEN: LS1_OC_IEN (Bit 7)                          */
#define LS_IRQEN_LS1_OC_IEN_Msk           (0x80UL)                  /*!< LS IRQEN: LS1_OC_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS1_OL_IEN_Pos           (6UL)                     /*!< LS IRQEN: LS1_OL_IEN (Bit 6)                          */
#define LS_IRQEN_LS1_OL_IEN_Msk           (0x40UL)                  /*!< LS IRQEN: LS1_OL_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS1_OT_IEN_Pos           (5UL)                     /*!< LS IRQEN: LS1_OT_IEN (Bit 5)                          */
#define LS_IRQEN_LS1_OT_IEN_Msk           (0x20UL)                  /*!< LS IRQEN: LS1_OT_IEN (Bitfield-Mask: 0x01)            */
#define LS_IRQEN_LS1_OT_PREWARN_IEN_Pos   (4UL)                     /*!< LS IRQEN: LS1_OT_PREWARN_IEN (Bit 4)                  */
#define LS_IRQEN_LS1_OT_PREWARN_IEN_Msk   (0x10UL)                  /*!< LS IRQEN: LS1_OT_PREWARN_IEN (Bitfield-Mask: 0x01)    */
/* =======================================================  PWMSRCSEL  ======================================================= */
#define LS_PWMSRCSEL_LS1_SRC_SEL_Pos      (3UL)                     /*!< LS PWMSRCSEL: LS1_SRC_SEL (Bit 3)                     */
#define LS_PWMSRCSEL_LS1_SRC_SEL_Msk      (0x38UL)                  /*!< LS PWMSRCSEL: LS1_SRC_SEL (Bitfield-Mask: 0x07)       */
#define LS_PWMSRCSEL_LS2_SRC_SEL_Pos      (0UL)                     /*!< LS PWMSRCSEL: LS2_SRC_SEL (Bit 0)                     */
#define LS_PWMSRCSEL_LS2_SRC_SEL_Msk      (0x7UL)                   /*!< LS PWMSRCSEL: LS2_SRC_SEL (Bitfield-Mask: 0x07)       */
/* =======================================================  LS1_TRIM  ======================================================== */
#define LS_LS1_TRIM_LS1_OC_BTFILT_SEL_Pos (8UL)                     /*!< LS LS1_TRIM: LS1_OC_BTFILT_SEL (Bit 8)                */
#define LS_LS1_TRIM_LS1_OC_BTFILT_SEL_Msk (0x300UL)                 /*!< LS LS1_TRIM: LS1_OC_BTFILT_SEL (Bitfield-Mask: 0x03)  */
#define LS_LS1_TRIM_LS1_OL_BTFILT_SEL_Pos (0UL)                     /*!< LS LS1_TRIM: LS1_OL_BTFILT_SEL (Bit 0)                */
#define LS_LS1_TRIM_LS1_OL_BTFILT_SEL_Msk (0x3UL)                   /*!< LS LS1_TRIM: LS1_OL_BTFILT_SEL (Bitfield-Mask: 0x03)  */
/* =======================================================  LS2_TRIM  ======================================================== */
#define LS_LS2_TRIM_LS2_OC_BTFILT_SEL_Pos (8UL)                     /*!< LS LS2_TRIM: LS2_OC_BTFILT_SEL (Bit 8)                */
#define LS_LS2_TRIM_LS2_OC_BTFILT_SEL_Msk (0x300UL)                 /*!< LS LS2_TRIM: LS2_OC_BTFILT_SEL (Bitfield-Mask: 0x03)  */
#define LS_LS2_TRIM_LS2_OL_BTFILT_SEL_Pos (0UL)                     /*!< LS LS2_TRIM: LS2_OL_BTFILT_SEL (Bit 0)                */
#define LS_LS2_TRIM_LS2_OL_BTFILT_SEL_Msk (0x3UL)                   /*!< LS LS2_TRIM: LS2_OL_BTFILT_SEL (Bitfield-Mask: 0x03)  */


/* =========================================================================================================================== */
/* ================                                            MF                                             ================ */
/* =========================================================================================================================== */

/* ====================================================  TEMPSENSE_CTRL  ===================================================== */
#define MF_TEMPSENSE_CTRL_SYS_OT_STS_Pos  (7UL)                     /*!< MF TEMPSENSE_CTRL: SYS_OT_STS (Bit 7)                 */
#define MF_TEMPSENSE_CTRL_SYS_OT_STS_Msk  (0x80UL)                  /*!< MF TEMPSENSE_CTRL: SYS_OT_STS (Bitfield-Mask: 0x01)   */
#define MF_TEMPSENSE_CTRL_SYS_OTWARN_STS_Pos (6UL)                  /*!< MF TEMPSENSE_CTRL: SYS_OTWARN_STS (Bit 6)             */
#define MF_TEMPSENSE_CTRL_SYS_OTWARN_STS_Msk (0x40UL)               /*!< MF TEMPSENSE_CTRL: SYS_OTWARN_STS (Bitfield-Mask: 0x01) */
#define MF_TEMPSENSE_CTRL_LS_OT_STS_Pos   (5UL)                     /*!< MF TEMPSENSE_CTRL: LS_OT_STS (Bit 5)                  */
#define MF_TEMPSENSE_CTRL_LS_OT_STS_Msk   (0x20UL)                  /*!< MF TEMPSENSE_CTRL: LS_OT_STS (Bitfield-Mask: 0x01)    */
#define MF_TEMPSENSE_CTRL_LS_OTWARN_STS_Pos (4UL)                   /*!< MF TEMPSENSE_CTRL: LS_OTWARN_STS (Bit 4)              */
#define MF_TEMPSENSE_CTRL_LS_OTWARN_STS_Msk (0x10UL)                /*!< MF TEMPSENSE_CTRL: LS_OTWARN_STS (Bitfield-Mask: 0x01) */
/* =======================================================  REF1_STS  ======================================================== */
#define MF_REF1_STS_REFBG_UPTHWARN_STS_Pos (5UL)                    /*!< MF REF1_STS: REFBG_UPTHWARN_STS (Bit 5)               */
#define MF_REF1_STS_REFBG_UPTHWARN_STS_Msk (0x20UL)                 /*!< MF REF1_STS: REFBG_UPTHWARN_STS (Bitfield-Mask: 0x01) */
#define MF_REF1_STS_REFBG_LOTHWARN_STS_Pos (4UL)                    /*!< MF REF1_STS: REFBG_LOTHWARN_STS (Bit 4)               */
#define MF_REF1_STS_REFBG_LOTHWARN_STS_Msk (0x10UL)                 /*!< MF REF1_STS: REFBG_LOTHWARN_STS (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

