zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* ======================================================  SUPPLY_STS  ======================================================= */
#define PMU_SUPPLY_STS_PMU_5V_FAIL_EN_Pos (6UL)                     /*!< PMU SUPPLY_STS: PMU_5V_FAIL_EN (Bit 6)                */
#define PMU_SUPPLY_STS_PMU_5V_FAIL_EN_Msk (0x40UL)                  /*!< PMU SUPPLY_STS: PMU_5V_FAIL_EN (Bitfield-Mask: 0x01)  */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_Pos (5UL)                    /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD (Bit 5)               */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_Msk (0x20UL)                 /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_Pos (4UL)                    /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT (Bit 4)               */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_Msk (0x10UL)                 /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_FAIL_EN_Pos (2UL)                    /*!< PMU SUPPLY_STS: PMU_1V5_FAIL_EN (Bit 2)               */
#define PMU_SUPPLY_STS_PMU_1V5_FAIL_EN_Msk (0x4UL)                  /*!< PMU SUPPLY_STS: PMU_1V5_FAIL_EN (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_Pos (1UL)                   /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD (Bit 1)              */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_Msk (0x2UL)                 /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_Pos (0UL)                   /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT (Bit 0)              */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_Msk (0x1UL)                 /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT (Bitfield-Mask: 0x01) */
/* ======================================================  VDDEXT_CTRL  ====================================================== */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_SC_Pos  (13UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_OT_SC (Bit 13)                */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_SC_Msk  (0x2000UL)                /*!< PMU VDDEXT_CTRL: VDDEXT_OT_SC (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_ISC_Pos (12UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_UV_ISC (Bit 12)               */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_ISC_Msk (0x1000UL)                /*!< PMU VDDEXT_CTRL: VDDEXT_UV_ISC (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_ISC_Pos (11UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_OT_ISC (Bit 11)               */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_ISC_Msk (0x800UL)                 /*!< PMU VDDEXT_CTRL: VDDEXT_OT_ISC (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_STABLE_Pos (7UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_STABLE (Bit 7)                */
#define PMU_VDDEXT_CTRL_VDDEXT_STABLE_Msk (0x80UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_STABLE (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_Pos     (6UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT (Bit 6)                    */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_Msk     (0x40UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_OT (Bitfield-Mask: 0x01)      */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_STS_Pos (5UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT_STS (Bit 5)                */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_STS_Msk (0x20UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_OT_STS (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_IS_Pos  (4UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_UV_IS (Bit 4)                 */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_IS_Msk  (0x10UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_UV_IS (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_IS_Pos  (3UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT_IS (Bit 3)                 */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_IS_Msk  (0x8UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_OT_IS (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_FAIL_EN_Pos (2UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_FAIL_EN (Bit 2)               */
#define PMU_VDDEXT_CTRL_VDDEXT_FAIL_EN_Msk (0x4UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_FAIL_EN (Bitfield-Mask: 0x01) */
#define PMU_VDDEXT_CTRL_VDDEXT_CYC_EN_Pos (1UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_CYC_EN (Bit 1)                */
#define PMU_VDDEXT_CTRL_VDDEXT_CYC_EN_Msk (0x2UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_CYC_EN (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_ENABLE_Pos (0UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_ENABLE (Bit 0)                */
#define PMU_VDDEXT_CTRL_VDDEXT_ENABLE_Msk (0x1UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_ENABLE (Bitfield-Mask: 0x01)  */
/* ==========================================================  WFS  ========================================================== */
#define PMU_WFS_LP_CLKWD_Pos              (7UL)                     /*!< PMU WFS: LP_CLKWD (Bit 7)                             */
#define PMU_WFS_LP_CLKWD_Msk              (0x80UL)                  /*!< PMU WFS: LP_CLKWD (Bitfield-Mask: 0x01)               */
#define PMU_WFS_WDT1_SEQ_FAIL_Pos         (6UL)                     /*!< PMU WFS: WDT1_SEQ_FAIL (Bit 6)                        */
#define PMU_WFS_WDT1_SEQ_FAIL_Msk         (0x40UL)                  /*!< PMU WFS: WDT1_SEQ_FAIL (Bitfield-Mask: 0x01)          */
#define PMU_WFS_SYS_OT_Pos                (5UL)                     /*!< PMU WFS: SYS_OT (Bit 5)                               */
#define PMU_WFS_SYS_OT_Msk                (0x20UL)                  /*!< PMU WFS: SYS_OT (Bitfield-Mask: 0x01)                 */
#define PMU_WFS_SYS_CLK_WDT_Pos           (4UL)                     /*!< PMU WFS: SYS_CLK_WDT (Bit 4)                          */
#define PMU_WFS_SYS_CLK_WDT_Msk           (0x10UL)                  /*!< PMU WFS: SYS_CLK_WDT (Bitfield-Mask: 0x01)            */
#define PMU_WFS_PMU_5V_OVL_Pos            (3UL)                     /*!< PMU WFS: PMU_5V_OVL (Bit 3)                           */
#define PMU_WFS_PMU_5V_OVL_Msk            (0x8UL)                   /*!< PMU WFS: PMU_5V_OVL (Bitfield-Mask: 0x01)             */
#define PMU_WFS_PMU_1V5_OVL_Pos           (2UL)                     /*!< PMU WFS: PMU_1V5_OVL (Bit 2)                          */
#define PMU_WFS_PMU_1V5_OVL_Msk           (0x4UL)                   /*!< PMU WFS: PMU_1V5_OVL (Bitfield-Mask: 0x01)            */
#define PMU_WFS_SUPP_TMOUT_Pos            (1UL)                     /*!< PMU WFS: SUPP_TMOUT (Bit 1)                           */
#define PMU_WFS_SUPP_TMOUT_Msk            (0x2UL)                   /*!< PMU WFS: SUPP_TMOUT (Bitfield-Mask: 0x01)             */
#define PMU_WFS_SUPP_SHORT_Pos            (0UL)                     /*!< PMU WFS: SUPP_SHORT (Bit 0)                           */
#define PMU_WFS_SUPP_SHORT_Msk            (0x1UL)                   /*!< PMU WFS: SUPP_SHORT (Bitfield-Mask: 0x01)             */
/* =====================================================  HIGHSIDE_CTRL  ===================================================== */
#define PMU_HIGHSIDE_CTRL_HS2_CYC_EN_Pos  (10UL)                    /*!< PMU HIGHSIDE_CTRL: HS2_CYC_EN (Bit 10)                */
#define PMU_HIGHSIDE_CTRL_HS2_CYC_EN_Msk  (0x400UL)                 /*!< PMU HIGHSIDE_CTRL: HS2_CYC_EN (Bitfield-Mask: 0x01)   */
#define PMU_HIGHSIDE_CTRL_HS1_CYC_EN_Pos  (2UL)                     /*!< PMU HIGHSIDE_CTRL: HS1_CYC_EN (Bit 2)                 */
#define PMU_HIGHSIDE_CTRL_HS1_CYC_EN_Msk  (0x4UL)                   /*!< PMU HIGHSIDE_CTRL: HS1_CYC_EN (Bitfield-Mask: 0x01)   */
/* =======================================================  CPREG_CNF  ======================================================= */
#define PMU_CPREG_CNF_SEL_GPIO_Pos        (0UL)                     /*!< PMU CPREG_CNF: SEL_GPIO (Bit 0)                       */
#define PMU_CPREG_CNF_SEL_GPIO_Msk        (0x1UL)                   /*!< PMU CPREG_CNF: SEL_GPIO (Bitfield-Mask: 0x01)         */
/* ====================================================  WAKE_CNF_GPIO1  ===================================================== */
#define PMU_WAKE_CNF_GPIO1_CYC_4_Pos      (20UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_4 (Bit 20)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_4_Msk      (0x100000UL)              /*!< PMU WAKE_CNF_GPIO1: CYC_4 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_3_Pos      (19UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_3 (Bit 19)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_3_Msk      (0x80000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_3 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_2_Pos      (18UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_2 (Bit 18)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_2_Msk      (0x40000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_2 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_1_Pos      (17UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_1 (Bit 17)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_1_Msk      (0x20000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_1 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_0_Pos      (16UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_0 (Bit 16)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_0_Msk      (0x10000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_0 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_FA_4_Pos       (12UL)                    /*!< PMU WAKE_CNF_GPIO1: FA_4 (Bit 12)                     */
#define PMU_WAKE_CNF_GPIO1_FA_4_Msk       (0x1000UL)                /*!< PMU WAKE_CNF_GPIO1: FA_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_3_Pos       (11UL)                    /*!< PMU WAKE_CNF_GPIO1: FA_3 (Bit 11)                     */
#define PMU_WAKE_CNF_GPIO1_FA_3_Msk       (0x800UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_3 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_2_Pos       (10UL)                    /*!< PMU WAKE_CNF_GPIO1: FA_2 (Bit 10)                     */
#define PMU_WAKE_CNF_GPIO1_FA_2_Msk       (0x400UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_1_Pos       (9UL)                     /*!< PMU WAKE_CNF_GPIO1: FA_1 (Bit 9)                      */
#define PMU_WAKE_CNF_GPIO1_FA_1_Msk       (0x200UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_0_Pos       (8UL)                     /*!< PMU WAKE_CNF_GPIO1: FA_0 (Bit 8)                      */
#define PMU_WAKE_CNF_GPIO1_FA_0_Msk       (0x100UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_0 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_4_Pos       (4UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_4 (Bit 4)                      */
#define PMU_WAKE_CNF_GPIO1_RI_4_Msk       (0x10UL)                  /*!< PMU WAKE_CNF_GPIO1: RI_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_3_Pos       (3UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_3 (Bit 3)                      */
#define PMU_WAKE_CNF_GPIO1_RI_3_Msk       (0x8UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_3 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_2_Pos       (2UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_2 (Bit 2)                      */
#define PMU_WAKE_CNF_GPIO1_RI_2_Msk       (0x4UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_1_Pos       (1UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_1 (Bit 1)                      */
#define PMU_WAKE_CNF_GPIO1_RI_1_Msk       (0x2UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_0_Pos       (0UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_0 (Bit 0)                      */
#define PMU_WAKE_CNF_GPIO1_RI_0_Msk       (0x1UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_0 (Bitfield-Mask: 0x01)        */
/* ====================================================  CNF_WAKE_FILTER  ==================================================== */
#define PMU_CNF_WAKE_FILTER_CNF_GPIO_FT_Pos (2UL)                   /*!< PMU CNF_WAKE_FILTER: CNF_GPIO_FT (Bit 2)              */
#define PMU_CNF_WAKE_FILTER_CNF_GPIO_FT_Msk (0xcUL)                 /*!< PMU CNF_WAKE_FILTER: CNF_GPIO_FT (Bitfield-Mask: 0x03) */
#define PMU_CNF_WAKE_FILTER_CNF_MON_FT_Pos (1UL)                    /*!< PMU CNF_WAKE_FILTER: CNF_MON_FT (Bit 1)               */
#define PMU_CNF_WAKE_FILTER_CNF_MON_FT_Msk (0x2UL)                  /*!< PMU CNF_WAKE_FILTER: CNF_MON_FT (Bitfield-Mask: 0x01) */
#define PMU_CNF_WAKE_FILTER_CNF_LIN_FT_Pos (0UL)                    /*!< PMU CNF_WAKE_FILTER: CNF_LIN_FT (Bit 0)               */
#define PMU_CNF_WAKE_FILTER_CNF_LIN_FT_Msk (0x1UL)                  /*!< PMU CNF_WAKE_FILTER: CNF_LIN_FT (Bitfield-Mask: 0x01) */
/* ======================================================  LIN_WAKE_EN  ====================================================== */
#define PMU_LIN_WAKE_EN_LIN_EN_Pos        (7UL)                     /*!< PMU LIN_WAKE_EN: LIN_EN (Bit 7)                       */
#define PMU_LIN_WAKE_EN_LIN_EN_Msk        (0x80UL)                  /*!< PMU LIN_WAKE_EN: LIN_EN (Bitfield-Mask: 0x01)         */
/* ======================================================  WAKE_STATUS  ====================================================== */
#define PMU_WAKE_STATUS_VDDEXT_UV_Pos     (18UL)                    /*!< PMU WAKE_STATUS: VDDEXT_UV (Bit 18)                   */
#define PMU_WAKE_STATUS_VDDEXT_UV_Msk     (0x40000UL)               /*!< PMU WAKE_STATUS: VDDEXT_UV (Bitfield-Mask: 0x01)      */
#define PMU_WAKE_STATUS_VDDEXT_OT_Pos     (17UL)                    /*!< PMU WAKE_STATUS: VDDEXT_OT (Bit 17)                   */
#define PMU_WAKE_STATUS_VDDEXT_OT_Msk     (0x20000UL)               /*!< PMU WAKE_STATUS: VDDEXT_OT (Bitfield-Mask: 0x01)      */
#define PMU_WAKE_STATUS_MON5_WAKE_STS_Pos (12UL)                    /*!< PMU WAKE_STATUS: MON5_WAKE_STS (Bit 12)               */
#define PMU_WAKE_STATUS_MON5_WAKE_STS_Msk (0x1000UL)                /*!< PMU WAKE_STATUS: MON5_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON4_WAKE_STS_Pos (11UL)                    /*!< PMU WAKE_STATUS: MON4_WAKE_STS (Bit 11)               */
#define PMU_WAKE_STATUS_MON4_WAKE_STS_Msk (0x800UL)                 /*!< PMU WAKE_STATUS: MON4_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON3_WAKE_STS_Pos (10UL)                    /*!< PMU WAKE_STATUS: MON3_WAKE_STS (Bit 10)               */
#define PMU_WAKE_STATUS_MON3_WAKE_STS_Msk (0x400UL)                 /*!< PMU WAKE_STATUS: MON3_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON2_WAKE_STS_Pos (9UL)                     /*!< PMU WAKE_STATUS: MON2_WAKE_STS (Bit 9)                */
#define PMU_WAKE_STATUS_MON2_WAKE_STS_Msk (0x200UL)                 /*!< PMU WAKE_STATUS: MON2_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON1_WAKE_STS_Pos (8UL)                     /*!< PMU WAKE_STATUS: MON1_WAKE_STS (Bit 8)                */
#define PMU_WAKE_STATUS_MON1_WAKE_STS_Msk (0x100UL)                 /*!< PMU WAKE_STATUS: MON1_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_GPIO2_Pos         (6UL)                     /*!< PMU WAKE_STATUS: GPIO2 (Bit 6)                        */
#define PMU_WAKE_STATUS_GPIO2_Msk         (0x40UL)                  /*!< PMU WAKE_STATUS: GPIO2 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_FAIL_Pos          (5UL)                     /*!< PMU WAKE_STATUS: FAIL (Bit 5)                         */
#define PMU_WAKE_STATUS_FAIL_Msk          (0x20UL)                  /*!< PMU WAKE_STATUS: FAIL (Bitfield-Mask: 0x01)           */
#define PMU_WAKE_STATUS_CYC_WAKE_Pos      (4UL)                     /*!< PMU WAKE_STATUS: CYC_WAKE (Bit 4)                     */
#define PMU_WAKE_STATUS_CYC_WAKE_Msk      (0x10UL)                  /*!< PMU WAKE_STATUS: CYC_WAKE (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_STATUS_GPIO1_Pos         (3UL)                     /*!< PMU WAKE_STATUS: GPIO1 (Bit 3)                        */
#define PMU_WAKE_STATUS_GPIO1_Msk         (0x8UL)                   /*!< PMU WAKE_STATUS: GPIO1 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_GPIO0_Pos         (2UL)                     /*!< PMU WAKE_STATUS: GPIO0 (Bit 2)                        */
#define PMU_WAKE_STATUS_GPIO0_Msk         (0x4UL)                   /*!< PMU WAKE_STATUS: GPIO0 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_MON_Pos           (1UL)                     /*!< PMU WAKE_STATUS: MON (Bit 1)                          */
#define PMU_WAKE_STATUS_MON_Msk           (0x2UL)                   /*!< PMU WAKE_STATUS: MON (Bitfield-Mask: 0x01)            */
#define PMU_WAKE_STATUS_LIN_WAKE_Pos      (0UL)                     /*!< PMU WAKE_STATUS: LIN_WAKE (Bit 0)                     */
#define PMU_WAKE_STATUS_LIN_WAKE_Msk      (0x1UL)                   /*!< PMU WAKE_STATUS: LIN_WAKE (Bitfield-Mask: 0x01)       */
/* ===================================================  GPIO_WAKE_STATUS  ==================================================== */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_4_Pos (12UL)                 /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_4 (Bit 12)            */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_4_Msk (0x1000UL)             /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_4 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_2_Pos (10UL)                 /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_2 (Bit 10)            */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_2_Msk (0x400UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_2 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_1_Pos (9UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_1 (Bit 9)             */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_1_Msk (0x200UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_1 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_0_Pos (8UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_0 (Bit 8)             */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_0_Msk (0x100UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_0 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_4_Pos (4UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_4 (Bit 4)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_4_Msk (0x10UL)               /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_4 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_3_Pos (3UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_3 (Bit 3)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_3_Msk (0x8UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_3 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_2_Pos (2UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_2 (Bit 2)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_2_Msk (0x4UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_2 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_1_Pos (1UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_1 (Bit 1)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_1_Msk (0x2UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_1 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_0_Pos (0UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_0 (Bit 0)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_0_Msk (0x1UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_0 (Bitfield-Mask: 0x01) */
/* =========================================================  SLEEP  ========================================================= */
#define PMU_SLEEP_CYC_SENSE_S_DEL_Pos     (24UL)                    /*!< PMU SLEEP: CYC_SENSE_S_DEL (Bit 24)                   */
#define PMU_SLEEP_CYC_SENSE_S_DEL_Msk     (0x7000000UL)             /*!< PMU SLEEP: CYC_SENSE_S_DEL (Bitfield-Mask: 0x07)      */
#define PMU_SLEEP_CYC_WAKE_E01_Pos        (20UL)                    /*!< PMU SLEEP: CYC_WAKE_E01 (Bit 20)                      */
#define PMU_SLEEP_CYC_WAKE_E01_Msk        (0x300000UL)              /*!< PMU SLEEP: CYC_WAKE_E01 (Bitfield-Mask: 0x03)         */
#define PMU_SLEEP_CYC_WAKE_M03_Pos        (16UL)                    /*!< PMU SLEEP: CYC_WAKE_M03 (Bit 16)                      */
#define PMU_SLEEP_CYC_WAKE_M03_Msk        (0xf0000UL)               /*!< PMU SLEEP: CYC_WAKE_M03 (Bitfield-Mask: 0x0f)         */
#define PMU_SLEEP_CYC_SENSE_E01_Pos       (12UL)                    /*!< PMU SLEEP: CYC_SENSE_E01 (Bit 12)                     */
#define PMU_SLEEP_CYC_SENSE_E01_Msk       (0x3000UL)                /*!< PMU SLEEP: CYC_SENSE_E01 (Bitfield-Mask: 0x03)        */
#define PMU_SLEEP_CYC_SENSE_M03_Pos       (8UL)                     /*!< PMU SLEEP: CYC_SENSE_M03 (Bit 8)                      */
#define PMU_SLEEP_CYC_SENSE_M03_Msk       (0xf00UL)                 /*!< PMU SLEEP: CYC_SENSE_M03 (Bitfield-Mask: 0x0f)        */
#define PMU_SLEEP_RFU_Pos                 (4UL)                     /*!< PMU SLEEP: RFU (Bit 4)                                */
#define PMU_SLEEP_RFU_Msk                 (0x10UL)                  /*!< PMU SLEEP: RFU (Bitfield-Mask: 0x01)                  */
#define PMU_SLEEP_CYC_SENSE_EN_Pos        (3UL)                     /*!< PMU SLEEP: CYC_SENSE_EN (Bit 3)                       */
#define PMU_SLEEP_CYC_SENSE_EN_Msk        (0x8UL)                   /*!< PMU SLEEP: CYC_SENSE_EN (Bitfield-Mask: 0x01)         */
#define PMU_SLEEP_CYC_WAKE_EN_Pos         (2UL)                     /*!< PMU SLEEP: CYC_WAKE_EN (Bit 2)                        */
#define PMU_SLEEP_CYC_WAKE_EN_Msk         (0x4UL)                   /*!< PMU SLEEP: CYC_WAKE_EN (Bitfield-Mask: 0x01)          */
#define PMU_SLEEP_EN_0V9_N_Pos            (1UL)                     /*!< PMU SLEEP: EN_0V9_N (Bit 1)                           */
#define PMU_SLEEP_EN_0V9_N_Msk            (0x2UL)                   /*!< PMU SLEEP: EN_0V9_N (Bitfield-Mask: 0x01)             */
#define PMU_SLEEP_WAKE_W_RST_Pos          (0UL)                     /*!< PMU SLEEP: WAKE_W_RST (Bit 0)                         */
#define PMU_SLEEP_WAKE_W_RST_Msk          (0x1UL)                   /*!< PMU SLEEP: WAKE_W_RST (Bitfield-Mask: 0x01)           */
/* ======================================================  CNF_RST_TFB  ====================================================== */
#define PMU_CNF_RST_TFB_RST_TFB_Pos       (0UL)                     /*!< PMU CNF_RST_TFB: RST_TFB (Bit 0)                      */
#define PMU_CNF_RST_TFB_RST_TFB_Msk       (0x3UL)                   /*!< PMU CNF_RST_TFB: RST_TFB (Bitfield-Mask: 0x03)        */
/* =======================================================  RESET_STS  ======================================================= */
#define PMU_RESET_STS_LOCKUP_Pos          (10UL)                    /*!< PMU RESET_STS: LOCKUP (Bit 10)                        */
#define PMU_RESET_STS_LOCKUP_Msk          (0x400UL)                 /*!< PMU RESET_STS: LOCKUP (Bitfield-Mask: 0x01)           */
#define PMU_RESET_STS_PMU_SOFT_Pos        (9UL)                     /*!< PMU RESET_STS: PMU_SOFT (Bit 9)                       */
#define PMU_RESET_STS_PMU_SOFT_Msk        (0x200UL)                 /*!< PMU RESET_STS: PMU_SOFT (Bitfield-Mask: 0x01)         */
#define PMU_RESET_STS_PMU_VS_POR_Pos      (7UL)                     /*!< PMU RESET_STS: PMU_VS_POR (Bit 7)                     */
#define PMU_RESET_STS_PMU_VS_POR_Msk      (0x80UL)                  /*!< PMU RESET_STS: PMU_VS_POR (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_PIN_Pos         (6UL)                     /*!< PMU RESET_STS: PMU_PIN (Bit 6)                        */
#define PMU_RESET_STS_PMU_PIN_Msk         (0x40UL)                  /*!< PMU RESET_STS: PMU_PIN (Bitfield-Mask: 0x01)          */
#define PMU_RESET_STS_PMU_ExtWDT_Pos      (5UL)                     /*!< PMU RESET_STS: PMU_ExtWDT (Bit 5)                     */
