zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define PMU_RESET_STS_PMU_ExtWDT_Msk      (0x20UL)                  /*!< PMU RESET_STS: PMU_ExtWDT (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_ClkWDT_Pos      (4UL)                     /*!< PMU RESET_STS: PMU_ClkWDT (Bit 4)                     */
#define PMU_RESET_STS_PMU_ClkWDT_Msk      (0x10UL)                  /*!< PMU RESET_STS: PMU_ClkWDT (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_LPR_Pos         (3UL)                     /*!< PMU RESET_STS: PMU_LPR (Bit 3)                        */
#define PMU_RESET_STS_PMU_LPR_Msk         (0x8UL)                   /*!< PMU RESET_STS: PMU_LPR (Bitfield-Mask: 0x01)          */
#define PMU_RESET_STS_PMU_SleepEX_Pos     (2UL)                     /*!< PMU RESET_STS: PMU_SleepEX (Bit 2)                    */
#define PMU_RESET_STS_PMU_SleepEX_Msk     (0x4UL)                   /*!< PMU RESET_STS: PMU_SleepEX (Bitfield-Mask: 0x01)      */
#define PMU_RESET_STS_PMU_WAKE_Pos        (1UL)                     /*!< PMU RESET_STS: PMU_WAKE (Bit 1)                       */
#define PMU_RESET_STS_PMU_WAKE_Msk        (0x2UL)                   /*!< PMU RESET_STS: PMU_WAKE (Bitfield-Mask: 0x01)         */
#define PMU_RESET_STS_SYS_FAIL_Pos        (0UL)                     /*!< PMU RESET_STS: SYS_FAIL (Bit 0)                       */
#define PMU_RESET_STS_SYS_FAIL_Msk        (0x1UL)                   /*!< PMU RESET_STS: SYS_FAIL (Bitfield-Mask: 0x01)         */
/* ======================================================  GPUDATA0to3  ====================================================== */
#define PMU_GPUDATA0to3_DATA3_Pos         (24UL)                    /*!< PMU GPUDATA0to3: DATA3 (Bit 24)                       */
#define PMU_GPUDATA0to3_DATA3_Msk         (0xff000000UL)            /*!< PMU GPUDATA0to3: DATA3 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA2_Pos         (16UL)                    /*!< PMU GPUDATA0to3: DATA2 (Bit 16)                       */
#define PMU_GPUDATA0to3_DATA2_Msk         (0xff0000UL)              /*!< PMU GPUDATA0to3: DATA2 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA1_Pos         (8UL)                     /*!< PMU GPUDATA0to3: DATA1 (Bit 8)                        */
#define PMU_GPUDATA0to3_DATA1_Msk         (0xff00UL)                /*!< PMU GPUDATA0to3: DATA1 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA0_Pos         (0UL)                     /*!< PMU GPUDATA0to3: DATA0 (Bit 0)                        */
#define PMU_GPUDATA0to3_DATA0_Msk         (0xffUL)                  /*!< PMU GPUDATA0to3: DATA0 (Bitfield-Mask: 0xff)          */
/* ======================================================  GPUDATA4to7  ====================================================== */
#define PMU_GPUDATA4to7_DATA7_Pos         (24UL)                    /*!< PMU GPUDATA4to7: DATA7 (Bit 24)                       */
#define PMU_GPUDATA4to7_DATA7_Msk         (0xff000000UL)            /*!< PMU GPUDATA4to7: DATA7 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA6_Pos         (16UL)                    /*!< PMU GPUDATA4to7: DATA6 (Bit 16)                       */
#define PMU_GPUDATA4to7_DATA6_Msk         (0xff0000UL)              /*!< PMU GPUDATA4to7: DATA6 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA5_Pos         (8UL)                     /*!< PMU GPUDATA4to7: DATA5 (Bit 8)                        */
#define PMU_GPUDATA4to7_DATA5_Msk         (0xff00UL)                /*!< PMU GPUDATA4to7: DATA5 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA4_Pos         (0UL)                     /*!< PMU GPUDATA4to7: DATA4 (Bit 0)                        */
#define PMU_GPUDATA4to7_DATA4_Msk         (0xffUL)                  /*!< PMU GPUDATA4to7: DATA4 (Bitfield-Mask: 0xff)          */
/* =====================================================  GPUDATA8to11  ====================================================== */
#define PMU_GPUDATA8to11_DATA11_Pos       (24UL)                    /*!< PMU GPUDATA8to11: DATA11 (Bit 24)                     */
#define PMU_GPUDATA8to11_DATA11_Msk       (0xff000000UL)            /*!< PMU GPUDATA8to11: DATA11 (Bitfield-Mask: 0xff)        */
#define PMU_GPUDATA8to11_DATA10_Pos       (16UL)                    /*!< PMU GPUDATA8to11: DATA10 (Bit 16)                     */
#define PMU_GPUDATA8to11_DATA10_Msk       (0xff0000UL)              /*!< PMU GPUDATA8to11: DATA10 (Bitfield-Mask: 0xff)        */
#define PMU_GPUDATA8to11_DATA9_Pos        (8UL)                     /*!< PMU GPUDATA8to11: DATA9 (Bit 8)                       */
#define PMU_GPUDATA8to11_DATA9_Msk        (0xff00UL)                /*!< PMU GPUDATA8to11: DATA9 (Bitfield-Mask: 0xff)         */
#define PMU_GPUDATA8to11_DATA8_Pos        (0UL)                     /*!< PMU GPUDATA8to11: DATA8 (Bit 0)                       */
#define PMU_GPUDATA8to11_DATA8_Msk        (0xffUL)                  /*!< PMU GPUDATA8to11: DATA8 (Bitfield-Mask: 0xff)         */
/* =======================================================  MON_CNF1  ======================================================== */
#define PMU_MON_CNF1_MON4_STS_Pos         (31UL)                    /*!< PMU MON_CNF1: MON4_STS (Bit 31)                       */
#define PMU_MON_CNF1_MON4_STS_Msk         (0x80000000UL)            /*!< PMU MON_CNF1: MON4_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON4_PU_Pos          (29UL)                    /*!< PMU MON_CNF1: MON4_PU (Bit 29)                        */
#define PMU_MON_CNF1_MON4_PU_Msk          (0x20000000UL)            /*!< PMU MON_CNF1: MON4_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON4_PD_Pos          (28UL)                    /*!< PMU MON_CNF1: MON4_PD (Bit 28)                        */
#define PMU_MON_CNF1_MON4_PD_Msk          (0x10000000UL)            /*!< PMU MON_CNF1: MON4_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON4_CYC_Pos         (27UL)                    /*!< PMU MON_CNF1: MON4_CYC (Bit 27)                       */
#define PMU_MON_CNF1_MON4_CYC_Msk         (0x8000000UL)             /*!< PMU MON_CNF1: MON4_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON4_RISE_Pos        (26UL)                    /*!< PMU MON_CNF1: MON4_RISE (Bit 26)                      */
#define PMU_MON_CNF1_MON4_RISE_Msk        (0x4000000UL)             /*!< PMU MON_CNF1: MON4_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON4_FALL_Pos        (25UL)                    /*!< PMU MON_CNF1: MON4_FALL (Bit 25)                      */
#define PMU_MON_CNF1_MON4_FALL_Msk        (0x2000000UL)             /*!< PMU MON_CNF1: MON4_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON4_EN_Pos          (24UL)                    /*!< PMU MON_CNF1: MON4_EN (Bit 24)                        */
#define PMU_MON_CNF1_MON4_EN_Msk          (0x1000000UL)             /*!< PMU MON_CNF1: MON4_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_STS_Pos         (23UL)                    /*!< PMU MON_CNF1: MON3_STS (Bit 23)                       */
#define PMU_MON_CNF1_MON3_STS_Msk         (0x800000UL)              /*!< PMU MON_CNF1: MON3_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON3_PU_Pos          (21UL)                    /*!< PMU MON_CNF1: MON3_PU (Bit 21)                        */
#define PMU_MON_CNF1_MON3_PU_Msk          (0x200000UL)              /*!< PMU MON_CNF1: MON3_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_PD_Pos          (20UL)                    /*!< PMU MON_CNF1: MON3_PD (Bit 20)                        */
#define PMU_MON_CNF1_MON3_PD_Msk          (0x100000UL)              /*!< PMU MON_CNF1: MON3_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_CYC_Pos         (19UL)                    /*!< PMU MON_CNF1: MON3_CYC (Bit 19)                       */
#define PMU_MON_CNF1_MON3_CYC_Msk         (0x80000UL)               /*!< PMU MON_CNF1: MON3_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON3_RISE_Pos        (18UL)                    /*!< PMU MON_CNF1: MON3_RISE (Bit 18)                      */
#define PMU_MON_CNF1_MON3_RISE_Msk        (0x40000UL)               /*!< PMU MON_CNF1: MON3_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON3_FALL_Pos        (17UL)                    /*!< PMU MON_CNF1: MON3_FALL (Bit 17)                      */
#define PMU_MON_CNF1_MON3_FALL_Msk        (0x20000UL)               /*!< PMU MON_CNF1: MON3_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON3_EN_Pos          (16UL)                    /*!< PMU MON_CNF1: MON3_EN (Bit 16)                        */
#define PMU_MON_CNF1_MON3_EN_Msk          (0x10000UL)               /*!< PMU MON_CNF1: MON3_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_STS_Pos         (15UL)                    /*!< PMU MON_CNF1: MON2_STS (Bit 15)                       */
#define PMU_MON_CNF1_MON2_STS_Msk         (0x8000UL)                /*!< PMU MON_CNF1: MON2_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON2_PU_Pos          (13UL)                    /*!< PMU MON_CNF1: MON2_PU (Bit 13)                        */
#define PMU_MON_CNF1_MON2_PU_Msk          (0x2000UL)                /*!< PMU MON_CNF1: MON2_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_PD_Pos          (12UL)                    /*!< PMU MON_CNF1: MON2_PD (Bit 12)                        */
#define PMU_MON_CNF1_MON2_PD_Msk          (0x1000UL)                /*!< PMU MON_CNF1: MON2_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_CYC_Pos         (11UL)                    /*!< PMU MON_CNF1: MON2_CYC (Bit 11)                       */
#define PMU_MON_CNF1_MON2_CYC_Msk         (0x800UL)                 /*!< PMU MON_CNF1: MON2_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON2_RISE_Pos        (10UL)                    /*!< PMU MON_CNF1: MON2_RISE (Bit 10)                      */
#define PMU_MON_CNF1_MON2_RISE_Msk        (0x400UL)                 /*!< PMU MON_CNF1: MON2_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON2_FALL_Pos        (9UL)                     /*!< PMU MON_CNF1: MON2_FALL (Bit 9)                       */
#define PMU_MON_CNF1_MON2_FALL_Msk        (0x200UL)                 /*!< PMU MON_CNF1: MON2_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON2_EN_Pos          (8UL)                     /*!< PMU MON_CNF1: MON2_EN (Bit 8)                         */
#define PMU_MON_CNF1_MON2_EN_Msk          (0x100UL)                 /*!< PMU MON_CNF1: MON2_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_STS_Pos         (7UL)                     /*!< PMU MON_CNF1: MON1_STS (Bit 7)                        */
#define PMU_MON_CNF1_MON1_STS_Msk         (0x80UL)                  /*!< PMU MON_CNF1: MON1_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON1_PU_Pos          (5UL)                     /*!< PMU MON_CNF1: MON1_PU (Bit 5)                         */
#define PMU_MON_CNF1_MON1_PU_Msk          (0x20UL)                  /*!< PMU MON_CNF1: MON1_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_PD_Pos          (4UL)                     /*!< PMU MON_CNF1: MON1_PD (Bit 4)                         */
#define PMU_MON_CNF1_MON1_PD_Msk          (0x10UL)                  /*!< PMU MON_CNF1: MON1_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_CYC_Pos         (3UL)                     /*!< PMU MON_CNF1: MON1_CYC (Bit 3)                        */
#define PMU_MON_CNF1_MON1_CYC_Msk         (0x8UL)                   /*!< PMU MON_CNF1: MON1_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON1_RISE_Pos        (2UL)                     /*!< PMU MON_CNF1: MON1_RISE (Bit 2)                       */
#define PMU_MON_CNF1_MON1_RISE_Msk        (0x4UL)                   /*!< PMU MON_CNF1: MON1_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON1_FALL_Pos        (1UL)                     /*!< PMU MON_CNF1: MON1_FALL (Bit 1)                       */
#define PMU_MON_CNF1_MON1_FALL_Msk        (0x2UL)                   /*!< PMU MON_CNF1: MON1_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON1_EN_Pos          (0UL)                     /*!< PMU MON_CNF1: MON1_EN (Bit 0)                         */
#define PMU_MON_CNF1_MON1_EN_Msk          (0x1UL)                   /*!< PMU MON_CNF1: MON1_EN (Bitfield-Mask: 0x01)           */
/* =======================================================  MON_CNF2  ======================================================== */
#define PMU_MON_CNF2_MON5_STS_Pos         (7UL)                     /*!< PMU MON_CNF2: MON5_STS (Bit 7)                        */
#define PMU_MON_CNF2_MON5_STS_Msk         (0x80UL)                  /*!< PMU MON_CNF2: MON5_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF2_MON5_PU_Pos          (5UL)                     /*!< PMU MON_CNF2: MON5_PU (Bit 5)                         */
#define PMU_MON_CNF2_MON5_PU_Msk          (0x20UL)                  /*!< PMU MON_CNF2: MON5_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF2_MON5_PD_Pos          (4UL)                     /*!< PMU MON_CNF2: MON5_PD (Bit 4)                         */
#define PMU_MON_CNF2_MON5_PD_Msk          (0x10UL)                  /*!< PMU MON_CNF2: MON5_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF2_MON5_CYC_Pos         (3UL)                     /*!< PMU MON_CNF2: MON5_CYC (Bit 3)                        */
#define PMU_MON_CNF2_MON5_CYC_Msk         (0x8UL)                   /*!< PMU MON_CNF2: MON5_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF2_MON5_RISE_Pos        (2UL)                     /*!< PMU MON_CNF2: MON5_RISE (Bit 2)                       */
#define PMU_MON_CNF2_MON5_RISE_Msk        (0x4UL)                   /*!< PMU MON_CNF2: MON5_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF2_MON5_FALL_Pos        (1UL)                     /*!< PMU MON_CNF2: MON5_FALL (Bit 1)                       */
#define PMU_MON_CNF2_MON5_FALL_Msk        (0x2UL)                   /*!< PMU MON_CNF2: MON5_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF2_MON5_EN_Pos          (0UL)                     /*!< PMU MON_CNF2: MON5_EN (Bit 0)                         */
#define PMU_MON_CNF2_MON5_EN_Msk          (0x1UL)                   /*!< PMU MON_CNF2: MON5_EN (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                           PORT                                            ================ */
/* =========================================================================================================================== */

