zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* ========================================================  P0_DATA  ======================================================== */
#define PORT_P0_DATA_PP5_STS_Pos          (21UL)                    /*!< PORT P0_DATA: PP5_STS (Bit 21)                        */
#define PORT_P0_DATA_PP5_STS_Msk          (0x200000UL)              /*!< PORT P0_DATA: PP5_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP4_STS_Pos          (20UL)                    /*!< PORT P0_DATA: PP4_STS (Bit 20)                        */
#define PORT_P0_DATA_PP4_STS_Msk          (0x100000UL)              /*!< PORT P0_DATA: PP4_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP3_STS_Pos          (19UL)                    /*!< PORT P0_DATA: PP3_STS (Bit 19)                        */
#define PORT_P0_DATA_PP3_STS_Msk          (0x80000UL)               /*!< PORT P0_DATA: PP3_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP2_STS_Pos          (18UL)                    /*!< PORT P0_DATA: PP2_STS (Bit 18)                        */
#define PORT_P0_DATA_PP2_STS_Msk          (0x40000UL)               /*!< PORT P0_DATA: PP2_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP1_STS_Pos          (17UL)                    /*!< PORT P0_DATA: PP1_STS (Bit 17)                        */
#define PORT_P0_DATA_PP1_STS_Msk          (0x20000UL)               /*!< PORT P0_DATA: PP1_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP0_STS_Pos          (16UL)                    /*!< PORT P0_DATA: PP0_STS (Bit 16)                        */
#define PORT_P0_DATA_PP0_STS_Msk          (0x10000UL)               /*!< PORT P0_DATA: PP0_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP5_Pos              (5UL)                     /*!< PORT P0_DATA: PP5 (Bit 5)                             */
#define PORT_P0_DATA_PP5_Msk              (0x20UL)                  /*!< PORT P0_DATA: PP5 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP4_Pos              (4UL)                     /*!< PORT P0_DATA: PP4 (Bit 4)                             */
#define PORT_P0_DATA_PP4_Msk              (0x10UL)                  /*!< PORT P0_DATA: PP4 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP3_Pos              (3UL)                     /*!< PORT P0_DATA: PP3 (Bit 3)                             */
#define PORT_P0_DATA_PP3_Msk              (0x8UL)                   /*!< PORT P0_DATA: PP3 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP2_Pos              (2UL)                     /*!< PORT P0_DATA: PP2 (Bit 2)                             */
#define PORT_P0_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P0_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP1_Pos              (1UL)                     /*!< PORT P0_DATA: PP1 (Bit 1)                             */
#define PORT_P0_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P0_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP0_Pos              (0UL)                     /*!< PORT P0_DATA: PP0 (Bit 0)                             */
#define PORT_P0_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P0_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P0_DIR  ========================================================= */
#define PORT_P0_DIR_PP5_INEN_Pos          (21UL)                    /*!< PORT P0_DIR: PP5_INEN (Bit 21)                        */
#define PORT_P0_DIR_PP5_INEN_Msk          (0x200000UL)              /*!< PORT P0_DIR: PP5_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP4_INEN_Pos          (20UL)                    /*!< PORT P0_DIR: PP4_INEN (Bit 20)                        */
#define PORT_P0_DIR_PP4_INEN_Msk          (0x100000UL)              /*!< PORT P0_DIR: PP4_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP3_INEN_Pos          (19UL)                    /*!< PORT P0_DIR: PP3_INEN (Bit 19)                        */
#define PORT_P0_DIR_PP3_INEN_Msk          (0x80000UL)               /*!< PORT P0_DIR: PP3_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP2_INEN_Pos          (18UL)                    /*!< PORT P0_DIR: PP2_INEN (Bit 18)                        */
#define PORT_P0_DIR_PP2_INEN_Msk          (0x40000UL)               /*!< PORT P0_DIR: PP2_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP1_INEN_Pos          (17UL)                    /*!< PORT P0_DIR: PP1_INEN (Bit 17)                        */
#define PORT_P0_DIR_PP1_INEN_Msk          (0x20000UL)               /*!< PORT P0_DIR: PP1_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP0_INEN_Pos          (16UL)                    /*!< PORT P0_DIR: PP0_INEN (Bit 16)                        */
#define PORT_P0_DIR_PP0_INEN_Msk          (0x10000UL)               /*!< PORT P0_DIR: PP0_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP5_Pos               (5UL)                     /*!< PORT P0_DIR: PP5 (Bit 5)                              */
#define PORT_P0_DIR_PP5_Msk               (0x20UL)                  /*!< PORT P0_DIR: PP5 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP4_Pos               (4UL)                     /*!< PORT P0_DIR: PP4 (Bit 4)                              */
#define PORT_P0_DIR_PP4_Msk               (0x10UL)                  /*!< PORT P0_DIR: PP4 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP3_Pos               (3UL)                     /*!< PORT P0_DIR: PP3 (Bit 3)                              */
#define PORT_P0_DIR_PP3_Msk               (0x8UL)                   /*!< PORT P0_DIR: PP3 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP2_Pos               (2UL)                     /*!< PORT P0_DIR: PP2 (Bit 2)                              */
#define PORT_P0_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P0_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP1_Pos               (1UL)                     /*!< PORT P0_DIR: PP1 (Bit 1)                              */
#define PORT_P0_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P0_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP0_Pos               (0UL)                     /*!< PORT P0_DIR: PP0 (Bit 0)                              */
#define PORT_P0_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P0_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =========================================================  P0_OD  ========================================================= */
#define PORT_P0_OD_PP5_Pos                (5UL)                     /*!< PORT P0_OD: PP5 (Bit 5)                               */
#define PORT_P0_OD_PP5_Msk                (0x20UL)                  /*!< PORT P0_OD: PP5 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP4_Pos                (4UL)                     /*!< PORT P0_OD: PP4 (Bit 4)                               */
#define PORT_P0_OD_PP4_Msk                (0x10UL)                  /*!< PORT P0_OD: PP4 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP3_Pos                (3UL)                     /*!< PORT P0_OD: PP3 (Bit 3)                               */
#define PORT_P0_OD_PP3_Msk                (0x8UL)                   /*!< PORT P0_OD: PP3 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP2_Pos                (2UL)                     /*!< PORT P0_OD: PP2 (Bit 2)                               */
#define PORT_P0_OD_PP2_Msk                (0x4UL)                   /*!< PORT P0_OD: PP2 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP1_Pos                (1UL)                     /*!< PORT P0_OD: PP1 (Bit 1)                               */
#define PORT_P0_OD_PP1_Msk                (0x2UL)                   /*!< PORT P0_OD: PP1 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP0_Pos                (0UL)                     /*!< PORT P0_OD: PP0 (Bit 0)                               */
#define PORT_P0_OD_PP0_Msk                (0x1UL)                   /*!< PORT P0_OD: PP0 (Bitfield-Mask: 0x01)                 */
/* =======================================================  P0_PUDSEL  ======================================================= */
#define PORT_P0_PUDSEL_PP5_Pos            (5UL)                     /*!< PORT P0_PUDSEL: PP5 (Bit 5)                           */
#define PORT_P0_PUDSEL_PP5_Msk            (0x20UL)                  /*!< PORT P0_PUDSEL: PP5 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP4_Pos            (4UL)                     /*!< PORT P0_PUDSEL: PP4 (Bit 4)                           */
#define PORT_P0_PUDSEL_PP4_Msk            (0x10UL)                  /*!< PORT P0_PUDSEL: PP4 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP3_Pos            (3UL)                     /*!< PORT P0_PUDSEL: PP3 (Bit 3)                           */
#define PORT_P0_PUDSEL_PP3_Msk            (0x8UL)                   /*!< PORT P0_PUDSEL: PP3 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P0_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P0_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P0_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P0_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P0_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P0_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P0_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P0_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P0_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */
/* =======================================================  P0_PUDEN  ======================================================== */
#define PORT_P0_PUDEN_PP5_Pos             (5UL)                     /*!< PORT P0_PUDEN: PP5 (Bit 5)                            */
#define PORT_P0_PUDEN_PP5_Msk             (0x20UL)                  /*!< PORT P0_PUDEN: PP5 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP4_Pos             (4UL)                     /*!< PORT P0_PUDEN: PP4 (Bit 4)                            */
#define PORT_P0_PUDEN_PP4_Msk             (0x10UL)                  /*!< PORT P0_PUDEN: PP4 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP3_Pos             (3UL)                     /*!< PORT P0_PUDEN: PP3 (Bit 3)                            */
#define PORT_P0_PUDEN_PP3_Msk             (0x8UL)                   /*!< PORT P0_PUDEN: PP3 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P0_PUDEN: PP2 (Bit 2)                            */
#define PORT_P0_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P0_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P0_PUDEN: PP1 (Bit 1)                            */
#define PORT_P0_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P0_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P0_PUDEN: PP0 (Bit 0)                            */
#define PORT_P0_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P0_PUDEN: PP0 (Bitfield-Mask: 0x01)              */
/* ======================================================  P0_ALTSEL0  ======================================================= */
#define PORT_P0_ALTSEL0_PP5_Pos           (5UL)                     /*!< PORT P0_ALTSEL0: PP5 (Bit 5)                          */
#define PORT_P0_ALTSEL0_PP5_Msk           (0x20UL)                  /*!< PORT P0_ALTSEL0: PP5 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP4_Pos           (4UL)                     /*!< PORT P0_ALTSEL0: PP4 (Bit 4)                          */
#define PORT_P0_ALTSEL0_PP4_Msk           (0x10UL)                  /*!< PORT P0_ALTSEL0: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP3_Pos           (3UL)                     /*!< PORT P0_ALTSEL0: PP3 (Bit 3)                          */
#define PORT_P0_ALTSEL0_PP3_Msk           (0x8UL)                   /*!< PORT P0_ALTSEL0: PP3 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP2_Pos           (2UL)                     /*!< PORT P0_ALTSEL0: PP2 (Bit 2)                          */
#define PORT_P0_ALTSEL0_PP2_Msk           (0x4UL)                   /*!< PORT P0_ALTSEL0: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP1_Pos           (1UL)                     /*!< PORT P0_ALTSEL0: PP1 (Bit 1)                          */
#define PORT_P0_ALTSEL0_PP1_Msk           (0x2UL)                   /*!< PORT P0_ALTSEL0: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP0_Pos           (0UL)                     /*!< PORT P0_ALTSEL0: PP0 (Bit 0)                          */
#define PORT_P0_ALTSEL0_PP0_Msk           (0x1UL)                   /*!< PORT P0_ALTSEL0: PP0 (Bitfield-Mask: 0x01)            */
/* ======================================================  P0_ALTSEL1  ======================================================= */
#define PORT_P0_ALTSEL1_PP5_Pos           (5UL)                     /*!< PORT P0_ALTSEL1: PP5 (Bit 5)                          */
#define PORT_P0_ALTSEL1_PP5_Msk           (0x20UL)                  /*!< PORT P0_ALTSEL1: PP5 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP4_Pos           (4UL)                     /*!< PORT P0_ALTSEL1: PP4 (Bit 4)                          */
#define PORT_P0_ALTSEL1_PP4_Msk           (0x10UL)                  /*!< PORT P0_ALTSEL1: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP3_Pos           (3UL)                     /*!< PORT P0_ALTSEL1: PP3 (Bit 3)                          */
#define PORT_P0_ALTSEL1_PP3_Msk           (0x8UL)                   /*!< PORT P0_ALTSEL1: PP3 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP2_Pos           (2UL)                     /*!< PORT P0_ALTSEL1: PP2 (Bit 2)                          */
#define PORT_P0_ALTSEL1_PP2_Msk           (0x4UL)                   /*!< PORT P0_ALTSEL1: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP1_Pos           (1UL)                     /*!< PORT P0_ALTSEL1: PP1 (Bit 1)                          */
#define PORT_P0_ALTSEL1_PP1_Msk           (0x2UL)                   /*!< PORT P0_ALTSEL1: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP0_Pos           (0UL)                     /*!< PORT P0_ALTSEL1: PP0 (Bit 0)                          */
#define PORT_P0_ALTSEL1_PP0_Msk           (0x1UL)                   /*!< PORT P0_ALTSEL1: PP0 (Bitfield-Mask: 0x01)            */
/* ========================================================  P1_DATA  ======================================================== */
#define PORT_P1_DATA_PP4_STS_Pos          (20UL)                    /*!< PORT P1_DATA: PP4_STS (Bit 20)                        */
#define PORT_P1_DATA_PP4_STS_Msk          (0x100000UL)              /*!< PORT P1_DATA: PP4_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP2_STS_Pos          (18UL)                    /*!< PORT P1_DATA: PP2_STS (Bit 18)                        */
#define PORT_P1_DATA_PP2_STS_Msk          (0x40000UL)               /*!< PORT P1_DATA: PP2_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP1_STS_Pos          (17UL)                    /*!< PORT P1_DATA: PP1_STS (Bit 17)                        */
#define PORT_P1_DATA_PP1_STS_Msk          (0x20000UL)               /*!< PORT P1_DATA: PP1_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP0_STS_Pos          (16UL)                    /*!< PORT P1_DATA: PP0_STS (Bit 16)                        */
#define PORT_P1_DATA_PP0_STS_Msk          (0x10000UL)               /*!< PORT P1_DATA: PP0_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP4_Pos              (4UL)                     /*!< PORT P1_DATA: PP4 (Bit 4)                             */
#define PORT_P1_DATA_PP4_Msk              (0x10UL)                  /*!< PORT P1_DATA: PP4 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP2_Pos              (2UL)                     /*!< PORT P1_DATA: PP2 (Bit 2)                             */
#define PORT_P1_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P1_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP1_Pos              (1UL)                     /*!< PORT P1_DATA: PP1 (Bit 1)                             */
#define PORT_P1_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P1_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP0_Pos              (0UL)                     /*!< PORT P1_DATA: PP0 (Bit 0)                             */
#define PORT_P1_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P1_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P1_DIR  ========================================================= */
#define PORT_P1_DIR_PP4_INEN_Pos          (20UL)                    /*!< PORT P1_DIR: PP4_INEN (Bit 20)                        */
#define PORT_P1_DIR_PP4_INEN_Msk          (0x100000UL)              /*!< PORT P1_DIR: PP4_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP2_INEN_Pos          (18UL)                    /*!< PORT P1_DIR: PP2_INEN (Bit 18)                        */
#define PORT_P1_DIR_PP2_INEN_Msk          (0x40000UL)               /*!< PORT P1_DIR: PP2_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP1_INEN_Pos          (17UL)                    /*!< PORT P1_DIR: PP1_INEN (Bit 17)                        */
#define PORT_P1_DIR_PP1_INEN_Msk          (0x20000UL)               /*!< PORT P1_DIR: PP1_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP0_INEN_Pos          (16UL)                    /*!< PORT P1_DIR: PP0_INEN (Bit 16)                        */
#define PORT_P1_DIR_PP0_INEN_Msk          (0x10000UL)               /*!< PORT P1_DIR: PP0_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP4_Pos               (4UL)                     /*!< PORT P1_DIR: PP4 (Bit 4)                              */
#define PORT_P1_DIR_PP4_Msk               (0x10UL)                  /*!< PORT P1_DIR: PP4 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP2_Pos               (2UL)                     /*!< PORT P1_DIR: PP2 (Bit 2)                              */
#define PORT_P1_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P1_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP1_Pos               (1UL)                     /*!< PORT P1_DIR: PP1 (Bit 1)                              */
#define PORT_P1_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P1_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP0_Pos               (0UL)                     /*!< PORT P1_DIR: PP0 (Bit 0)                              */
#define PORT_P1_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P1_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =========================================================  P1_OD  ========================================================= */
#define PORT_P1_OD_PP4_Pos                (4UL)                     /*!< PORT P1_OD: PP4 (Bit 4)                               */
#define PORT_P1_OD_PP4_Msk                (0x10UL)                  /*!< PORT P1_OD: PP4 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP2_Pos                (2UL)                     /*!< PORT P1_OD: PP2 (Bit 2)                               */
#define PORT_P1_OD_PP2_Msk                (0x4UL)                   /*!< PORT P1_OD: PP2 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP1_Pos                (1UL)                     /*!< PORT P1_OD: PP1 (Bit 1)                               */
#define PORT_P1_OD_PP1_Msk                (0x2UL)                   /*!< PORT P1_OD: PP1 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP0_Pos                (0UL)                     /*!< PORT P1_OD: PP0 (Bit 0)                               */
#define PORT_P1_OD_PP0_Msk                (0x1UL)                   /*!< PORT P1_OD: PP0 (Bitfield-Mask: 0x01)                 */
/* =======================================================  P1_PUDSEL  ======================================================= */
#define PORT_P1_PUDSEL_PP4_Pos            (4UL)                     /*!< PORT P1_PUDSEL: PP4 (Bit 4)                           */
#define PORT_P1_PUDSEL_PP4_Msk            (0x10UL)                  /*!< PORT P1_PUDSEL: PP4 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P1_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P1_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P1_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P1_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P1_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P1_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P1_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P1_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P1_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */
/* =======================================================  P1_PUDEN  ======================================================== */
#define PORT_P1_PUDEN_PP4_Pos             (4UL)                     /*!< PORT P1_PUDEN: PP4 (Bit 4)                            */
#define PORT_P1_PUDEN_PP4_Msk             (0x10UL)                  /*!< PORT P1_PUDEN: PP4 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P1_PUDEN: PP2 (Bit 2)                            */
#define PORT_P1_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P1_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P1_PUDEN: PP1 (Bit 1)                            */
#define PORT_P1_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P1_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P1_PUDEN: PP0 (Bit 0)                            */
#define PORT_P1_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P1_PUDEN: PP0 (Bitfield-Mask: 0x01)              */
/* ======================================================  P1_ALTSEL0  ======================================================= */
#define PORT_P1_ALTSEL0_PP4_Pos           (4UL)                     /*!< PORT P1_ALTSEL0: PP4 (Bit 4)                          */
#define PORT_P1_ALTSEL0_PP4_Msk           (0x10UL)                  /*!< PORT P1_ALTSEL0: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP2_Pos           (2UL)                     /*!< PORT P1_ALTSEL0: PP2 (Bit 2)                          */
#define PORT_P1_ALTSEL0_PP2_Msk           (0x4UL)                   /*!< PORT P1_ALTSEL0: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP1_Pos           (1UL)                     /*!< PORT P1_ALTSEL0: PP1 (Bit 1)                          */
#define PORT_P1_ALTSEL0_PP1_Msk           (0x2UL)                   /*!< PORT P1_ALTSEL0: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP0_Pos           (0UL)                     /*!< PORT P1_ALTSEL0: PP0 (Bit 0)                          */
