zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define PORT_P1_ALTSEL0_PP0_Msk           (0x1UL)                   /*!< PORT P1_ALTSEL0: PP0 (Bitfield-Mask: 0x01)            */
/* ======================================================  P1_ALTSEL1  ======================================================= */
#define PORT_P1_ALTSEL1_PP4_Pos           (4UL)                     /*!< PORT P1_ALTSEL1: PP4 (Bit 4)                          */
#define PORT_P1_ALTSEL1_PP4_Msk           (0x10UL)                  /*!< PORT P1_ALTSEL1: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP2_Pos           (2UL)                     /*!< PORT P1_ALTSEL1: PP2 (Bit 2)                          */
#define PORT_P1_ALTSEL1_PP2_Msk           (0x4UL)                   /*!< PORT P1_ALTSEL1: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP1_Pos           (1UL)                     /*!< PORT P1_ALTSEL1: PP1 (Bit 1)                          */
#define PORT_P1_ALTSEL1_PP1_Msk           (0x2UL)                   /*!< PORT P1_ALTSEL1: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP0_Pos           (0UL)                     /*!< PORT P1_ALTSEL1: PP0 (Bit 0)                          */
#define PORT_P1_ALTSEL1_PP0_Msk           (0x1UL)                   /*!< PORT P1_ALTSEL1: PP0 (Bitfield-Mask: 0x01)            */
/* ========================================================  P2_DATA  ======================================================== */
#define PORT_P2_DATA_PP7_Pos              (7UL)                     /*!< PORT P2_DATA: PP7 (Bit 7)                             */
#define PORT_P2_DATA_PP7_Msk              (0x80UL)                  /*!< PORT P2_DATA: PP7 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP6_Pos              (6UL)                     /*!< PORT P2_DATA: PP6 (Bit 6)                             */
#define PORT_P2_DATA_PP6_Msk              (0x40UL)                  /*!< PORT P2_DATA: PP6 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP5_Pos              (5UL)                     /*!< PORT P2_DATA: PP5 (Bit 5)                             */
#define PORT_P2_DATA_PP5_Msk              (0x20UL)                  /*!< PORT P2_DATA: PP5 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP4_Pos              (4UL)                     /*!< PORT P2_DATA: PP4 (Bit 4)                             */
#define PORT_P2_DATA_PP4_Msk              (0x10UL)                  /*!< PORT P2_DATA: PP4 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP3_Pos              (3UL)                     /*!< PORT P2_DATA: PP3 (Bit 3)                             */
#define PORT_P2_DATA_PP3_Msk              (0x8UL)                   /*!< PORT P2_DATA: PP3 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP2_Pos              (2UL)                     /*!< PORT P2_DATA: PP2 (Bit 2)                             */
#define PORT_P2_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P2_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP1_Pos              (1UL)                     /*!< PORT P2_DATA: PP1 (Bit 1)                             */
#define PORT_P2_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P2_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP0_Pos              (0UL)                     /*!< PORT P2_DATA: PP0 (Bit 0)                             */
#define PORT_P2_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P2_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P2_DIR  ========================================================= */
#define PORT_P2_DIR_PP7_Pos               (7UL)                     /*!< PORT P2_DIR: PP7 (Bit 7)                              */
#define PORT_P2_DIR_PP7_Msk               (0x80UL)                  /*!< PORT P2_DIR: PP7 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP6_Pos               (6UL)                     /*!< PORT P2_DIR: PP6 (Bit 6)                              */
#define PORT_P2_DIR_PP6_Msk               (0x40UL)                  /*!< PORT P2_DIR: PP6 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP5_Pos               (5UL)                     /*!< PORT P2_DIR: PP5 (Bit 5)                              */
#define PORT_P2_DIR_PP5_Msk               (0x20UL)                  /*!< PORT P2_DIR: PP5 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP4_Pos               (4UL)                     /*!< PORT P2_DIR: PP4 (Bit 4)                              */
#define PORT_P2_DIR_PP4_Msk               (0x10UL)                  /*!< PORT P2_DIR: PP4 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP3_Pos               (3UL)                     /*!< PORT P2_DIR: PP3 (Bit 3)                              */
#define PORT_P2_DIR_PP3_Msk               (0x8UL)                   /*!< PORT P2_DIR: PP3 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP2_Pos               (2UL)                     /*!< PORT P2_DIR: PP2 (Bit 2)                              */
#define PORT_P2_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P2_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP1_Pos               (1UL)                     /*!< PORT P2_DIR: PP1 (Bit 1)                              */
#define PORT_P2_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P2_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP0_Pos               (0UL)                     /*!< PORT P2_DIR: PP0 (Bit 0)                              */
#define PORT_P2_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P2_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =======================================================  P2_PUDSEL  ======================================================= */
#define PORT_P2_PUDSEL_PP7_Pos            (7UL)                     /*!< PORT P2_PUDSEL: PP7 (Bit 7)                           */
#define PORT_P2_PUDSEL_PP7_Msk            (0x80UL)                  /*!< PORT P2_PUDSEL: PP7 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP6_Pos            (6UL)                     /*!< PORT P2_PUDSEL: PP6 (Bit 6)                           */
#define PORT_P2_PUDSEL_PP6_Msk            (0x40UL)                  /*!< PORT P2_PUDSEL: PP6 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP5_Pos            (5UL)                     /*!< PORT P2_PUDSEL: PP5 (Bit 5)                           */
#define PORT_P2_PUDSEL_PP5_Msk            (0x20UL)                  /*!< PORT P2_PUDSEL: PP5 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP4_Pos            (4UL)                     /*!< PORT P2_PUDSEL: PP4 (Bit 4)                           */
#define PORT_P2_PUDSEL_PP4_Msk            (0x10UL)                  /*!< PORT P2_PUDSEL: PP4 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP3_Pos            (3UL)                     /*!< PORT P2_PUDSEL: PP3 (Bit 3)                           */
#define PORT_P2_PUDSEL_PP3_Msk            (0x8UL)                   /*!< PORT P2_PUDSEL: PP3 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P2_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P2_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P2_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P2_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P2_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P2_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P2_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P2_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P2_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */
/* =======================================================  P2_PUDEN  ======================================================== */
#define PORT_P2_PUDEN_PP7_Pos             (7UL)                     /*!< PORT P2_PUDEN: PP7 (Bit 7)                            */
#define PORT_P2_PUDEN_PP7_Msk             (0x80UL)                  /*!< PORT P2_PUDEN: PP7 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP6_Pos             (6UL)                     /*!< PORT P2_PUDEN: PP6 (Bit 6)                            */
#define PORT_P2_PUDEN_PP6_Msk             (0x40UL)                  /*!< PORT P2_PUDEN: PP6 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP5_Pos             (5UL)                     /*!< PORT P2_PUDEN: PP5 (Bit 5)                            */
#define PORT_P2_PUDEN_PP5_Msk             (0x20UL)                  /*!< PORT P2_PUDEN: PP5 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP4_Pos             (4UL)                     /*!< PORT P2_PUDEN: PP4 (Bit 4)                            */
#define PORT_P2_PUDEN_PP4_Msk             (0x10UL)                  /*!< PORT P2_PUDEN: PP4 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP3_Pos             (3UL)                     /*!< PORT P2_PUDEN: PP3 (Bit 3)                            */
#define PORT_P2_PUDEN_PP3_Msk             (0x8UL)                   /*!< PORT P2_PUDEN: PP3 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P2_PUDEN: PP2 (Bit 2)                            */
#define PORT_P2_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P2_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P2_PUDEN: PP1 (Bit 1)                            */
#define PORT_P2_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P2_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P2_PUDEN: PP0 (Bit 0)                            */
#define PORT_P2_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P2_PUDEN: PP0 (Bitfield-Mask: 0x01)              */


/* =========================================================================================================================== */
/* ================                                            SCU                                            ================ */
/* =========================================================================================================================== */

