zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* ========================================================  OSC_CON  ======================================================== */
#define SCU_OSC_CON_XPD_Pos               (4UL)                     /*!< SCU OSC_CON: XPD (Bit 4)                              */
#define SCU_OSC_CON_XPD_Msk               (0x10UL)                  /*!< SCU OSC_CON: XPD (Bitfield-Mask: 0x01)                */
#define SCU_OSC_CON_OSC2L_Pos             (3UL)                     /*!< SCU OSC_CON: OSC2L (Bit 3)                            */
#define SCU_OSC_CON_OSC2L_Msk             (0x8UL)                   /*!< SCU OSC_CON: OSC2L (Bitfield-Mask: 0x01)              */
#define SCU_OSC_CON_OSCWDTRST_Pos         (2UL)                     /*!< SCU OSC_CON: OSCWDTRST (Bit 2)                        */
#define SCU_OSC_CON_OSCWDTRST_Msk         (0x4UL)                   /*!< SCU OSC_CON: OSCWDTRST (Bitfield-Mask: 0x01)          */
#define SCU_OSC_CON_OSCSS_Pos             (0UL)                     /*!< SCU OSC_CON: OSCSS (Bit 0)                            */
#define SCU_OSC_CON_OSCSS_Msk             (0x3UL)                   /*!< SCU OSC_CON: OSCSS (Bitfield-Mask: 0x03)              */
/* ========================================================  PLL_CON  ======================================================== */
#define SCU_PLL_CON_UNPROT_VCOBYP_Pos     (11UL)                    /*!< SCU PLL_CON: UNPROT_VCOBYP (Bit 11)                   */
#define SCU_PLL_CON_UNPROT_VCOBYP_Msk     (0x800UL)                 /*!< SCU PLL_CON: UNPROT_VCOBYP (Bitfield-Mask: 0x01)      */
#define SCU_PLL_CON_UNPROT_OSCDISC_Pos    (10UL)                    /*!< SCU PLL_CON: UNPROT_OSCDISC (Bit 10)                  */
#define SCU_PLL_CON_UNPROT_OSCDISC_Msk    (0x400UL)                 /*!< SCU PLL_CON: UNPROT_OSCDISC (Bitfield-Mask: 0x01)     */
#define SCU_PLL_CON_NDIV_Pos              (4UL)                     /*!< SCU PLL_CON: NDIV (Bit 4)                             */
#define SCU_PLL_CON_NDIV_Msk              (0xf0UL)                  /*!< SCU PLL_CON: NDIV (Bitfield-Mask: 0x0f)               */
#define SCU_PLL_CON_VCOBYP_Pos            (3UL)                     /*!< SCU PLL_CON: VCOBYP (Bit 3)                           */
#define SCU_PLL_CON_VCOBYP_Msk            (0x8UL)                   /*!< SCU PLL_CON: VCOBYP (Bitfield-Mask: 0x01)             */
#define SCU_PLL_CON_OSCDISC_Pos           (2UL)                     /*!< SCU PLL_CON: OSCDISC (Bit 2)                          */
#define SCU_PLL_CON_OSCDISC_Msk           (0x4UL)                   /*!< SCU PLL_CON: OSCDISC (Bitfield-Mask: 0x01)            */
#define SCU_PLL_CON_RESLD_Pos             (1UL)                     /*!< SCU PLL_CON: RESLD (Bit 1)                            */
#define SCU_PLL_CON_RESLD_Msk             (0x2UL)                   /*!< SCU PLL_CON: RESLD (Bitfield-Mask: 0x01)              */
#define SCU_PLL_CON_LOCK_Pos              (0UL)                     /*!< SCU PLL_CON: LOCK (Bit 0)                             */
#define SCU_PLL_CON_LOCK_Msk              (0x1UL)                   /*!< SCU PLL_CON: LOCK (Bitfield-Mask: 0x01)               */
/* ========================================================  CMCON1  ========================================================= */
#define SCU_CMCON1_PDIV_Pos               (8UL)                     /*!< SCU CMCON1: PDIV (Bit 8)                              */
#define SCU_CMCON1_PDIV_Msk               (0x300UL)                 /*!< SCU CMCON1: PDIV (Bitfield-Mask: 0x03)                */
#define SCU_CMCON1_K1DIV_Pos              (6UL)                     /*!< SCU CMCON1: K1DIV (Bit 6)                             */
#define SCU_CMCON1_K1DIV_Msk              (0x40UL)                  /*!< SCU CMCON1: K1DIV (Bitfield-Mask: 0x01)               */
#define SCU_CMCON1_K2DIV_Pos              (4UL)                     /*!< SCU CMCON1: K2DIV (Bit 4)                             */
#define SCU_CMCON1_K2DIV_Msk              (0x30UL)                  /*!< SCU CMCON1: K2DIV (Bitfield-Mask: 0x03)               */
#define SCU_CMCON1_CLKREL_Pos             (0UL)                     /*!< SCU CMCON1: CLKREL (Bit 0)                            */
#define SCU_CMCON1_CLKREL_Msk             (0xfUL)                   /*!< SCU CMCON1: CLKREL (Bitfield-Mask: 0x0f)              */
/* ========================================================  CMCON2  ========================================================= */
#define SCU_CMCON2_PBA0CLKREL_Pos         (0UL)                     /*!< SCU CMCON2: PBA0CLKREL (Bit 0)                        */
#define SCU_CMCON2_PBA0CLKREL_Msk         (0x1UL)                   /*!< SCU CMCON2: PBA0CLKREL (Bitfield-Mask: 0x01)          */
/* ========================================================  SYSCON0  ======================================================== */
#define SCU_SYSCON0_SYSCLKSEL_Pos         (6UL)                     /*!< SCU SYSCON0: SYSCLKSEL (Bit 6)                        */
#define SCU_SYSCON0_SYSCLKSEL_Msk         (0xc0UL)                  /*!< SCU SYSCON0: SYSCLKSEL (Bitfield-Mask: 0x03)          */
#define SCU_SYSCON0_NVMCLKFAC_Pos         (4UL)                     /*!< SCU SYSCON0: NVMCLKFAC (Bit 4)                        */
#define SCU_SYSCON0_NVMCLKFAC_Msk         (0x30UL)                  /*!< SCU SYSCON0: NVMCLKFAC (Bitfield-Mask: 0x03)          */
/* ======================================================  APCLK_CTRL  ======================================================= */
#define SCU_APCLK_CTRL_CLKWDT_IE_Pos      (8UL)                     /*!< SCU APCLK_CTRL: CLKWDT_IE (Bit 8)                     */
#define SCU_APCLK_CTRL_CLKWDT_IE_Msk      (0x100UL)                 /*!< SCU APCLK_CTRL: CLKWDT_IE (Bitfield-Mask: 0x01)       */
#define SCU_APCLK_CTRL_APCLK_SET_Pos      (0UL)                     /*!< SCU APCLK_CTRL: APCLK_SET (Bit 0)                     */
#define SCU_APCLK_CTRL_APCLK_SET_Msk      (0x1UL)                   /*!< SCU APCLK_CTRL: APCLK_SET (Bitfield-Mask: 0x01)       */
/* =========================================================  APCLK  ========================================================= */
#define SCU_APCLK_BGCLK_DIV_Pos           (25UL)                    /*!< SCU APCLK: BGCLK_DIV (Bit 25)                         */
#define SCU_APCLK_BGCLK_DIV_Msk           (0x2000000UL)             /*!< SCU APCLK: BGCLK_DIV (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_BGCLK_SEL_Pos           (24UL)                    /*!< SCU APCLK: BGCLK_SEL (Bit 24)                         */
#define SCU_APCLK_BGCLK_SEL_Msk           (0x1000000UL)             /*!< SCU APCLK: BGCLK_SEL (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_APCLK2FAC_Pos           (8UL)                     /*!< SCU APCLK: APCLK2FAC (Bit 8)                          */
#define SCU_APCLK_APCLK2FAC_Msk           (0x1f00UL)                /*!< SCU APCLK: APCLK2FAC (Bitfield-Mask: 0x1f)            */
#define SCU_APCLK_APCLK1FAC_Pos           (0UL)                     /*!< SCU APCLK: APCLK1FAC (Bit 0)                          */
#define SCU_APCLK_APCLK1FAC_Msk           (0x3UL)                   /*!< SCU APCLK: APCLK1FAC (Bitfield-Mask: 0x03)            */
/* =======================================================  ADC1_CLK  ======================================================== */
#define SCU_ADC1_CLK_DPP1_CLK_DIV_Pos     (8UL)                     /*!< SCU ADC1_CLK: DPP1_CLK_DIV (Bit 8)                    */
#define SCU_ADC1_CLK_DPP1_CLK_DIV_Msk     (0x300UL)                 /*!< SCU ADC1_CLK: DPP1_CLK_DIV (Bitfield-Mask: 0x03)      */
#define SCU_ADC1_CLK_ADC1_CLK_DIV_Pos     (0UL)                     /*!< SCU ADC1_CLK: ADC1_CLK_DIV (Bit 0)                    */
#define SCU_ADC1_CLK_ADC1_CLK_DIV_Msk     (0xfUL)                   /*!< SCU ADC1_CLK: ADC1_CLK_DIV (Bitfield-Mask: 0x0f)      */
/* =======================================================  APCLK_STS  ======================================================= */
#define SCU_APCLK_STS_PLL_LOCK_Pos        (24UL)                    /*!< SCU APCLK_STS: PLL_LOCK (Bit 24)                      */
#define SCU_APCLK_STS_PLL_LOCK_Msk        (0x1000000UL)             /*!< SCU APCLK_STS: PLL_LOCK (Bitfield-Mask: 0x01)         */
#define SCU_APCLK_STS_APCLK3STS_Pos       (16UL)                    /*!< SCU APCLK_STS: APCLK3STS (Bit 16)                     */
#define SCU_APCLK_STS_APCLK3STS_Msk       (0x10000UL)               /*!< SCU APCLK_STS: APCLK3STS (Bitfield-Mask: 0x01)        */
#define SCU_APCLK_STS_APCLK2STS_Pos       (8UL)                     /*!< SCU APCLK_STS: APCLK2STS (Bit 8)                      */
#define SCU_APCLK_STS_APCLK2STS_Msk       (0x300UL)                 /*!< SCU APCLK_STS: APCLK2STS (Bitfield-Mask: 0x03)        */
#define SCU_APCLK_STS_APCLK1STS_Pos       (0UL)                     /*!< SCU APCLK_STS: APCLK1STS (Bit 0)                      */
#define SCU_APCLK_STS_APCLK1STS_Msk       (0x3UL)                   /*!< SCU APCLK_STS: APCLK1STS (Bitfield-Mask: 0x03)        */
/* ======================================================  APCLK_SCLR  ======================================================= */
#define SCU_APCLK_SCLR_PLL_LOCK_SCLR_Pos  (24UL)                    /*!< SCU APCLK_SCLR: PLL_LOCK_SCLR (Bit 24)                */
#define SCU_APCLK_SCLR_PLL_LOCK_SCLR_Msk  (0x1000000UL)             /*!< SCU APCLK_SCLR: PLL_LOCK_SCLR (Bitfield-Mask: 0x01)   */
#define SCU_APCLK_SCLR_APCLK3SCLR_Pos     (16UL)                    /*!< SCU APCLK_SCLR: APCLK3SCLR (Bit 16)                   */
#define SCU_APCLK_SCLR_APCLK3SCLR_Msk     (0x10000UL)               /*!< SCU APCLK_SCLR: APCLK3SCLR (Bitfield-Mask: 0x01)      */
#define SCU_APCLK_SCLR_APCLK2SCLR_Pos     (8UL)                     /*!< SCU APCLK_SCLR: APCLK2SCLR (Bit 8)                    */
#define SCU_APCLK_SCLR_APCLK2SCLR_Msk     (0x100UL)                 /*!< SCU APCLK_SCLR: APCLK2SCLR (Bitfield-Mask: 0x01)      */
#define SCU_APCLK_SCLR_APCLK1SCLR_Pos     (0UL)                     /*!< SCU APCLK_SCLR: APCLK1SCLR (Bit 0)                    */
#define SCU_APCLK_SCLR_APCLK1SCLR_Msk     (0x1UL)                   /*!< SCU APCLK_SCLR: APCLK1SCLR (Bitfield-Mask: 0x01)      */
/* =========================================================  COCON  ========================================================= */
#define SCU_COCON_EN_Pos                  (7UL)                     /*!< SCU COCON: EN (Bit 7)                                 */
#define SCU_COCON_EN_Msk                  (0x80UL)                  /*!< SCU COCON: EN (Bitfield-Mask: 0x01)                   */
#define SCU_COCON_COUTS1_Pos              (6UL)                     /*!< SCU COCON: COUTS1 (Bit 6)                             */
#define SCU_COCON_COUTS1_Msk              (0x40UL)                  /*!< SCU COCON: COUTS1 (Bitfield-Mask: 0x01)               */
#define SCU_COCON_TLEN_Pos                (5UL)                     /*!< SCU COCON: TLEN (Bit 5)                               */
#define SCU_COCON_TLEN_Msk                (0x20UL)                  /*!< SCU COCON: TLEN (Bitfield-Mask: 0x01)                 */
#define SCU_COCON_COUTS0_Pos              (4UL)                     /*!< SCU COCON: COUTS0 (Bit 4)                             */
#define SCU_COCON_COUTS0_Msk              (0x10UL)                  /*!< SCU COCON: COUTS0 (Bitfield-Mask: 0x01)               */
#define SCU_COCON_COREL_Pos               (0UL)                     /*!< SCU COCON: COREL (Bit 0)                              */
#define SCU_COCON_COREL_Msk               (0xfUL)                   /*!< SCU COCON: COREL (Bitfield-Mask: 0x0f)                */
/* ========================================================  RSTCON  ========================================================= */
#define SCU_RSTCON_LOCKUP_EN_Pos          (7UL)                     /*!< SCU RSTCON: LOCKUP_EN (Bit 7)                         */
#define SCU_RSTCON_LOCKUP_EN_Msk          (0x80UL)                  /*!< SCU RSTCON: LOCKUP_EN (Bitfield-Mask: 0x01)           */
#define SCU_RSTCON_LOCKUP_Pos             (0UL)                     /*!< SCU RSTCON: LOCKUP (Bit 0)                            */
#define SCU_RSTCON_LOCKUP_Msk             (0x1UL)                   /*!< SCU RSTCON: LOCKUP (Bitfield-Mask: 0x01)              */
/* ========================================================  PMCON0  ========================================================= */
#define SCU_PMCON0_SD_Pos                 (3UL)                     /*!< SCU PMCON0: SD (Bit 3)                                */
#define SCU_PMCON0_SD_Msk                 (0x8UL)                   /*!< SCU PMCON0: SD (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_PD_Pos                 (2UL)                     /*!< SCU PMCON0: PD (Bit 2)                                */
#define SCU_PMCON0_PD_Msk                 (0x4UL)                   /*!< SCU PMCON0: PD (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_SL_Pos                 (1UL)                     /*!< SCU PMCON0: SL (Bit 1)                                */
#define SCU_PMCON0_SL_Msk                 (0x2UL)                   /*!< SCU PMCON0: SL (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_XTAL_ON_Pos            (0UL)                     /*!< SCU PMCON0: XTAL_ON (Bit 0)                           */
#define SCU_PMCON0_XTAL_ON_Msk            (0x1UL)                   /*!< SCU PMCON0: XTAL_ON (Bitfield-Mask: 0x01)             */
/* =========================================================  IEN0  ========================================================== */
#define SCU_IEN0_EA_Pos                   (31UL)                    /*!< SCU IEN0: EA (Bit 31)                                 */
#define SCU_IEN0_EA_Msk                   (0x80000000UL)            /*!< SCU IEN0: EA (Bitfield-Mask: 0x01)                    */
/* =========================================================  VTOR  ========================================================== */
#define SCU_VTOR_VTOR_BYP_Pos             (0UL)                     /*!< SCU VTOR: VTOR_BYP (Bit 0)                            */
#define SCU_VTOR_VTOR_BYP_Msk             (0x3UL)                   /*!< SCU VTOR: VTOR_BYP (Bitfield-Mask: 0x03)              */
/* ========================================================  NMICON  ========================================================= */
#define SCU_NMICON_NMISUP_Pos             (7UL)                     /*!< SCU NMICON: NMISUP (Bit 7)                            */
#define SCU_NMICON_NMISUP_Msk             (0x80UL)                  /*!< SCU NMICON: NMISUP (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIECC_Pos             (6UL)                     /*!< SCU NMICON: NMIECC (Bit 6)                            */
#define SCU_NMICON_NMIECC_Msk             (0x40UL)                  /*!< SCU NMICON: NMIECC (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIMAP_Pos             (5UL)                     /*!< SCU NMICON: NMIMAP (Bit 5)                            */
#define SCU_NMICON_NMIMAP_Msk             (0x20UL)                  /*!< SCU NMICON: NMIMAP (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIOWD_Pos             (4UL)                     /*!< SCU NMICON: NMIOWD (Bit 4)                            */
#define SCU_NMICON_NMIOWD_Msk             (0x10UL)                  /*!< SCU NMICON: NMIOWD (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIOT_Pos              (3UL)                     /*!< SCU NMICON: NMIOT (Bit 3)                             */
#define SCU_NMICON_NMIOT_Msk              (0x8UL)                   /*!< SCU NMICON: NMIOT (Bitfield-Mask: 0x01)               */
#define SCU_NMICON_NMINVM_Pos             (2UL)                     /*!< SCU NMICON: NMINVM (Bit 2)                            */
#define SCU_NMICON_NMINVM_Msk             (0x4UL)                   /*!< SCU NMICON: NMINVM (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIPLL_Pos             (1UL)                     /*!< SCU NMICON: NMIPLL (Bit 1)                            */
#define SCU_NMICON_NMIPLL_Msk             (0x2UL)                   /*!< SCU NMICON: NMIPLL (Bitfield-Mask: 0x01)              */
/* ========================================================  EXICON0  ======================================================== */
#define SCU_EXICON0_EXINT2_Pos            (4UL)                     /*!< SCU EXICON0: EXINT2 (Bit 4)                           */
#define SCU_EXICON0_EXINT2_Msk            (0x30UL)                  /*!< SCU EXICON0: EXINT2 (Bitfield-Mask: 0x03)             */
#define SCU_EXICON0_EXINT1_Pos            (2UL)                     /*!< SCU EXICON0: EXINT1 (Bit 2)                           */
#define SCU_EXICON0_EXINT1_Msk            (0xcUL)                   /*!< SCU EXICON0: EXINT1 (Bitfield-Mask: 0x03)             */
#define SCU_EXICON0_EXINT0_Pos            (0UL)                     /*!< SCU EXICON0: EXINT0 (Bit 0)                           */
#define SCU_EXICON0_EXINT0_Msk            (0x3UL)                   /*!< SCU EXICON0: EXINT0 (Bitfield-Mask: 0x03)             */
/* ========================================================  EXICON1  ======================================================== */
#define SCU_EXICON1_MON5_Pos              (8UL)                     /*!< SCU EXICON1: MON5 (Bit 8)                             */
#define SCU_EXICON1_MON5_Msk              (0x300UL)                 /*!< SCU EXICON1: MON5 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON4_Pos              (6UL)                     /*!< SCU EXICON1: MON4 (Bit 6)                             */
#define SCU_EXICON1_MON4_Msk              (0xc0UL)                  /*!< SCU EXICON1: MON4 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON3_Pos              (4UL)                     /*!< SCU EXICON1: MON3 (Bit 4)                             */
#define SCU_EXICON1_MON3_Msk              (0x30UL)                  /*!< SCU EXICON1: MON3 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON2_Pos              (2UL)                     /*!< SCU EXICON1: MON2 (Bit 2)                             */
#define SCU_EXICON1_MON2_Msk              (0xcUL)                   /*!< SCU EXICON1: MON2 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON1_Pos              (0UL)                     /*!< SCU EXICON1: MON1 (Bit 0)                             */
#define SCU_EXICON1_MON1_Msk              (0x3UL)                   /*!< SCU EXICON1: MON1 (Bitfield-Mask: 0x03)               */
/* ========================================================  WAKECON  ======================================================== */
#define SCU_WAKECON_WAKEUPEN_Pos          (0UL)                     /*!< SCU WAKECON: WAKEUPEN (Bit 0)                         */
#define SCU_WAKECON_WAKEUPEN_Msk          (0x1UL)                   /*!< SCU WAKECON: WAKEUPEN (Bitfield-Mask: 0x01)           */
/* ========================================================  IRCON0  ========================================================= */
#define SCU_IRCON0_EXINT2F_Pos            (5UL)                     /*!< SCU IRCON0: EXINT2F (Bit 5)                           */
#define SCU_IRCON0_EXINT2F_Msk            (0x20UL)                  /*!< SCU IRCON0: EXINT2F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT2R_Pos            (4UL)                     /*!< SCU IRCON0: EXINT2R (Bit 4)                           */
#define SCU_IRCON0_EXINT2R_Msk            (0x10UL)                  /*!< SCU IRCON0: EXINT2R (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT1F_Pos            (3UL)                     /*!< SCU IRCON0: EXINT1F (Bit 3)                           */
#define SCU_IRCON0_EXINT1F_Msk            (0x8UL)                   /*!< SCU IRCON0: EXINT1F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT1R_Pos            (2UL)                     /*!< SCU IRCON0: EXINT1R (Bit 2)                           */
#define SCU_IRCON0_EXINT1R_Msk            (0x4UL)                   /*!< SCU IRCON0: EXINT1R (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT0F_Pos            (1UL)                     /*!< SCU IRCON0: EXINT0F (Bit 1)                           */
#define SCU_IRCON0_EXINT0F_Msk            (0x2UL)                   /*!< SCU IRCON0: EXINT0F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT0R_Pos            (0UL)                     /*!< SCU IRCON0: EXINT0R (Bit 0)                           */
#define SCU_IRCON0_EXINT0R_Msk            (0x1UL)                   /*!< SCU IRCON0: EXINT0R (Bitfield-Mask: 0x01)             */
/* =======================================================  IRCON0CLR  ======================================================= */
#define SCU_IRCON0CLR_EXINT2FC_Pos        (5UL)                     /*!< SCU IRCON0CLR: EXINT2FC (Bit 5)                       */
#define SCU_IRCON0CLR_EXINT2FC_Msk        (0x20UL)                  /*!< SCU IRCON0CLR: EXINT2FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT2RC_Pos        (4UL)                     /*!< SCU IRCON0CLR: EXINT2RC (Bit 4)                       */
#define SCU_IRCON0CLR_EXINT2RC_Msk        (0x10UL)                  /*!< SCU IRCON0CLR: EXINT2RC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT1FC_Pos        (3UL)                     /*!< SCU IRCON0CLR: EXINT1FC (Bit 3)                       */
#define SCU_IRCON0CLR_EXINT1FC_Msk        (0x8UL)                   /*!< SCU IRCON0CLR: EXINT1FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT1RC_Pos        (2UL)                     /*!< SCU IRCON0CLR: EXINT1RC (Bit 2)                       */
#define SCU_IRCON0CLR_EXINT1RC_Msk        (0x4UL)                   /*!< SCU IRCON0CLR: EXINT1RC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT0FC_Pos        (1UL)                     /*!< SCU IRCON0CLR: EXINT0FC (Bit 1)                       */
#define SCU_IRCON0CLR_EXINT0FC_Msk        (0x2UL)                   /*!< SCU IRCON0CLR: EXINT0FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT0RC_Pos        (0UL)                     /*!< SCU IRCON0CLR: EXINT0RC (Bit 0)                       */
#define SCU_IRCON0CLR_EXINT0RC_Msk        (0x1UL)                   /*!< SCU IRCON0CLR: EXINT0RC (Bitfield-Mask: 0x01)         */
/* ========================================================  IRCON1  ========================================================= */
#define SCU_IRCON1_MON5F_Pos              (9UL)                     /*!< SCU IRCON1: MON5F (Bit 9)                             */
#define SCU_IRCON1_MON5F_Msk              (0x200UL)                 /*!< SCU IRCON1: MON5F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON5R_Pos              (8UL)                     /*!< SCU IRCON1: MON5R (Bit 8)                             */
#define SCU_IRCON1_MON5R_Msk              (0x100UL)                 /*!< SCU IRCON1: MON5R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON4F_Pos              (7UL)                     /*!< SCU IRCON1: MON4F (Bit 7)                             */
#define SCU_IRCON1_MON4F_Msk              (0x80UL)                  /*!< SCU IRCON1: MON4F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON4R_Pos              (6UL)                     /*!< SCU IRCON1: MON4R (Bit 6)                             */
#define SCU_IRCON1_MON4R_Msk              (0x40UL)                  /*!< SCU IRCON1: MON4R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON3F_Pos              (5UL)                     /*!< SCU IRCON1: MON3F (Bit 5)                             */
#define SCU_IRCON1_MON3F_Msk              (0x20UL)                  /*!< SCU IRCON1: MON3F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON3R_Pos              (4UL)                     /*!< SCU IRCON1: MON3R (Bit 4)                             */
#define SCU_IRCON1_MON3R_Msk              (0x10UL)                  /*!< SCU IRCON1: MON3R (Bitfield-Mask: 0x01)               */
