zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define SCU_IRCON1_MON2F_Pos              (3UL)                     /*!< SCU IRCON1: MON2F (Bit 3)                             */
#define SCU_IRCON1_MON2F_Msk              (0x8UL)                   /*!< SCU IRCON1: MON2F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON2R_Pos              (2UL)                     /*!< SCU IRCON1: MON2R (Bit 2)                             */
#define SCU_IRCON1_MON2R_Msk              (0x4UL)                   /*!< SCU IRCON1: MON2R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON1F_Pos              (1UL)                     /*!< SCU IRCON1: MON1F (Bit 1)                             */
#define SCU_IRCON1_MON1F_Msk              (0x2UL)                   /*!< SCU IRCON1: MON1F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON1R_Pos              (0UL)                     /*!< SCU IRCON1: MON1R (Bit 0)                             */
#define SCU_IRCON1_MON1R_Msk              (0x1UL)                   /*!< SCU IRCON1: MON1R (Bitfield-Mask: 0x01)               */
/* =======================================================  IRCON1CLR  ======================================================= */
#define SCU_IRCON1CLR_MON5FC_Pos          (9UL)                     /*!< SCU IRCON1CLR: MON5FC (Bit 9)                         */
#define SCU_IRCON1CLR_MON5FC_Msk          (0x200UL)                 /*!< SCU IRCON1CLR: MON5FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON5RC_Pos          (8UL)                     /*!< SCU IRCON1CLR: MON5RC (Bit 8)                         */
#define SCU_IRCON1CLR_MON5RC_Msk          (0x100UL)                 /*!< SCU IRCON1CLR: MON5RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON4FC_Pos          (7UL)                     /*!< SCU IRCON1CLR: MON4FC (Bit 7)                         */
#define SCU_IRCON1CLR_MON4FC_Msk          (0x80UL)                  /*!< SCU IRCON1CLR: MON4FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON4RC_Pos          (6UL)                     /*!< SCU IRCON1CLR: MON4RC (Bit 6)                         */
#define SCU_IRCON1CLR_MON4RC_Msk          (0x40UL)                  /*!< SCU IRCON1CLR: MON4RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON3FC_Pos          (5UL)                     /*!< SCU IRCON1CLR: MON3FC (Bit 5)                         */
#define SCU_IRCON1CLR_MON3FC_Msk          (0x20UL)                  /*!< SCU IRCON1CLR: MON3FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON3RC_Pos          (4UL)                     /*!< SCU IRCON1CLR: MON3RC (Bit 4)                         */
#define SCU_IRCON1CLR_MON3RC_Msk          (0x10UL)                  /*!< SCU IRCON1CLR: MON3RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON2FC_Pos          (3UL)                     /*!< SCU IRCON1CLR: MON2FC (Bit 3)                         */
#define SCU_IRCON1CLR_MON2FC_Msk          (0x8UL)                   /*!< SCU IRCON1CLR: MON2FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON2RC_Pos          (2UL)                     /*!< SCU IRCON1CLR: MON2RC (Bit 2)                         */
#define SCU_IRCON1CLR_MON2RC_Msk          (0x4UL)                   /*!< SCU IRCON1CLR: MON2RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON1FC_Pos          (1UL)                     /*!< SCU IRCON1CLR: MON1FC (Bit 1)                         */
#define SCU_IRCON1CLR_MON1FC_Msk          (0x2UL)                   /*!< SCU IRCON1CLR: MON1FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON1RC_Pos          (0UL)                     /*!< SCU IRCON1CLR: MON1RC (Bit 0)                         */
#define SCU_IRCON1CLR_MON1RC_Msk          (0x1UL)                   /*!< SCU IRCON1CLR: MON1RC (Bitfield-Mask: 0x01)           */
/* ========================================================  IRCON2  ========================================================= */
#define SCU_IRCON2_RIR1_Pos               (2UL)                     /*!< SCU IRCON2: RIR1 (Bit 2)                              */
#define SCU_IRCON2_RIR1_Msk               (0x4UL)                   /*!< SCU IRCON2: RIR1 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON2_TIR1_Pos               (1UL)                     /*!< SCU IRCON2: TIR1 (Bit 1)                              */
#define SCU_IRCON2_TIR1_Msk               (0x2UL)                   /*!< SCU IRCON2: TIR1 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON2_EIR1_Pos               (0UL)                     /*!< SCU IRCON2: EIR1 (Bit 0)                              */
#define SCU_IRCON2_EIR1_Msk               (0x1UL)                   /*!< SCU IRCON2: EIR1 (Bitfield-Mask: 0x01)                */
/* =======================================================  IRCON2CLR  ======================================================= */
#define SCU_IRCON2CLR_RIR1C_Pos           (2UL)                     /*!< SCU IRCON2CLR: RIR1C (Bit 2)                          */
#define SCU_IRCON2CLR_RIR1C_Msk           (0x4UL)                   /*!< SCU IRCON2CLR: RIR1C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON2CLR_TIR1C_Pos           (1UL)                     /*!< SCU IRCON2CLR: TIR1C (Bit 1)                          */
#define SCU_IRCON2CLR_TIR1C_Msk           (0x2UL)                   /*!< SCU IRCON2CLR: TIR1C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON2CLR_EIR1C_Pos           (0UL)                     /*!< SCU IRCON2CLR: EIR1C (Bit 0)                          */
#define SCU_IRCON2CLR_EIR1C_Msk           (0x1UL)                   /*!< SCU IRCON2CLR: EIR1C (Bitfield-Mask: 0x01)            */
/* ========================================================  IRCON3  ========================================================= */
#define SCU_IRCON3_RIR2_Pos               (2UL)                     /*!< SCU IRCON3: RIR2 (Bit 2)                              */
#define SCU_IRCON3_RIR2_Msk               (0x4UL)                   /*!< SCU IRCON3: RIR2 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON3_TIR2_Pos               (1UL)                     /*!< SCU IRCON3: TIR2 (Bit 1)                              */
#define SCU_IRCON3_TIR2_Msk               (0x2UL)                   /*!< SCU IRCON3: TIR2 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON3_EIR2_Pos               (0UL)                     /*!< SCU IRCON3: EIR2 (Bit 0)                              */
#define SCU_IRCON3_EIR2_Msk               (0x1UL)                   /*!< SCU IRCON3: EIR2 (Bitfield-Mask: 0x01)                */
/* =======================================================  IRCON3CLR  ======================================================= */
#define SCU_IRCON3CLR_RIR2C_Pos           (2UL)                     /*!< SCU IRCON3CLR: RIR2C (Bit 2)                          */
#define SCU_IRCON3CLR_RIR2C_Msk           (0x4UL)                   /*!< SCU IRCON3CLR: RIR2C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON3CLR_TIR2C_Pos           (1UL)                     /*!< SCU IRCON3CLR: TIR2C (Bit 1)                          */
#define SCU_IRCON3CLR_TIR2C_Msk           (0x2UL)                   /*!< SCU IRCON3CLR: TIR2C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON3CLR_EIR2C_Pos           (0UL)                     /*!< SCU IRCON3CLR: EIR2C (Bit 0)                          */
#define SCU_IRCON3CLR_EIR2C_Msk           (0x1UL)                   /*!< SCU IRCON3CLR: EIR2C (Bitfield-Mask: 0x01)            */
/* ========================================================  IRCON4  ========================================================= */
#define SCU_IRCON4_CCU6SR3_Pos            (20UL)                    /*!< SCU IRCON4: CCU6SR3 (Bit 20)                          */
#define SCU_IRCON4_CCU6SR3_Msk            (0x100000UL)              /*!< SCU IRCON4: CCU6SR3 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR2_Pos            (16UL)                    /*!< SCU IRCON4: CCU6SR2 (Bit 16)                          */
#define SCU_IRCON4_CCU6SR2_Msk            (0x10000UL)               /*!< SCU IRCON4: CCU6SR2 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR1_Pos            (4UL)                     /*!< SCU IRCON4: CCU6SR1 (Bit 4)                           */
#define SCU_IRCON4_CCU6SR1_Msk            (0x10UL)                  /*!< SCU IRCON4: CCU6SR1 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR0_Pos            (0UL)                     /*!< SCU IRCON4: CCU6SR0 (Bit 0)                           */
#define SCU_IRCON4_CCU6SR0_Msk            (0x1UL)                   /*!< SCU IRCON4: CCU6SR0 (Bitfield-Mask: 0x01)             */
/* =======================================================  IRCON4CLR  ======================================================= */
#define SCU_IRCON4CLR_CCU6SR3C_Pos        (20UL)                    /*!< SCU IRCON4CLR: CCU6SR3C (Bit 20)                      */
#define SCU_IRCON4CLR_CCU6SR3C_Msk        (0x100000UL)              /*!< SCU IRCON4CLR: CCU6SR3C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR2C_Pos        (16UL)                    /*!< SCU IRCON4CLR: CCU6SR2C (Bit 16)                      */
#define SCU_IRCON4CLR_CCU6SR2C_Msk        (0x10000UL)               /*!< SCU IRCON4CLR: CCU6SR2C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR1C_Pos        (4UL)                     /*!< SCU IRCON4CLR: CCU6SR1C (Bit 4)                       */
#define SCU_IRCON4CLR_CCU6SR1C_Msk        (0x10UL)                  /*!< SCU IRCON4CLR: CCU6SR1C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR0C_Pos        (0UL)                     /*!< SCU IRCON4CLR: CCU6SR0C (Bit 0)                       */
#define SCU_IRCON4CLR_CCU6SR0C_Msk        (0x1UL)                   /*!< SCU IRCON4CLR: CCU6SR0C (Bitfield-Mask: 0x01)         */
/* ========================================================  IRCON5  ========================================================= */
#define SCU_IRCON5_WAKEUP_Pos             (0UL)                     /*!< SCU IRCON5: WAKEUP (Bit 0)                            */
#define SCU_IRCON5_WAKEUP_Msk             (0x1UL)                   /*!< SCU IRCON5: WAKEUP (Bitfield-Mask: 0x01)              */
/* =======================================================  IRCON5CLR  ======================================================= */
#define SCU_IRCON5CLR_WAKEUPC_Pos         (0UL)                     /*!< SCU IRCON5CLR: WAKEUPC (Bit 0)                        */
#define SCU_IRCON5CLR_WAKEUPC_Msk         (0x1UL)                   /*!< SCU IRCON5CLR: WAKEUPC (Bitfield-Mask: 0x01)          */
/* =======================================================  GPT12IRC  ======================================================== */
#define SCU_GPT12IRC_GPT12CR_Pos          (5UL)                     /*!< SCU GPT12IRC: GPT12CR (Bit 5)                         */
#define SCU_GPT12IRC_GPT12CR_Msk          (0x20UL)                  /*!< SCU GPT12IRC: GPT12CR (Bitfield-Mask: 0x01)           */
#define SCU_GPT12IRC_GPT2T6_Pos           (4UL)                     /*!< SCU GPT12IRC: GPT2T6 (Bit 4)                          */
#define SCU_GPT12IRC_GPT2T6_Msk           (0x10UL)                  /*!< SCU GPT12IRC: GPT2T6 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT2T5_Pos           (3UL)                     /*!< SCU GPT12IRC: GPT2T5 (Bit 3)                          */
#define SCU_GPT12IRC_GPT2T5_Msk           (0x8UL)                   /*!< SCU GPT12IRC: GPT2T5 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T4_Pos           (2UL)                     /*!< SCU GPT12IRC: GPT1T4 (Bit 2)                          */
#define SCU_GPT12IRC_GPT1T4_Msk           (0x4UL)                   /*!< SCU GPT12IRC: GPT1T4 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T3_Pos           (1UL)                     /*!< SCU GPT12IRC: GPT1T3 (Bit 1)                          */
#define SCU_GPT12IRC_GPT1T3_Msk           (0x2UL)                   /*!< SCU GPT12IRC: GPT1T3 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T2_Pos           (0UL)                     /*!< SCU GPT12IRC: GPT1T2 (Bit 0)                          */
#define SCU_GPT12IRC_GPT1T2_Msk           (0x1UL)                   /*!< SCU GPT12IRC: GPT1T2 (Bitfield-Mask: 0x01)            */
/* =======================================================  GPT12ICLR  ======================================================= */
#define SCU_GPT12ICLR_GPT12CRC_Pos        (5UL)                     /*!< SCU GPT12ICLR: GPT12CRC (Bit 5)                       */
#define SCU_GPT12ICLR_GPT12CRC_Msk        (0x20UL)                  /*!< SCU GPT12ICLR: GPT12CRC (Bitfield-Mask: 0x01)         */
#define SCU_GPT12ICLR_GPT2T6C_Pos         (4UL)                     /*!< SCU GPT12ICLR: GPT2T6C (Bit 4)                        */
#define SCU_GPT12ICLR_GPT2T6C_Msk         (0x10UL)                  /*!< SCU GPT12ICLR: GPT2T6C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT2T5C_Pos         (3UL)                     /*!< SCU GPT12ICLR: GPT2T5C (Bit 3)                        */
#define SCU_GPT12ICLR_GPT2T5C_Msk         (0x8UL)                   /*!< SCU GPT12ICLR: GPT2T5C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T4C_Pos         (2UL)                     /*!< SCU GPT12ICLR: GPT1T4C (Bit 2)                        */
#define SCU_GPT12ICLR_GPT1T4C_Msk         (0x4UL)                   /*!< SCU GPT12ICLR: GPT1T4C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T3C_Pos         (1UL)                     /*!< SCU GPT12ICLR: GPT1T3C (Bit 1)                        */
#define SCU_GPT12ICLR_GPT1T3C_Msk         (0x2UL)                   /*!< SCU GPT12ICLR: GPT1T3C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T2C_Pos         (0UL)                     /*!< SCU GPT12ICLR: GPT1T2C (Bit 0)                        */
#define SCU_GPT12ICLR_GPT1T2C_Msk         (0x1UL)                   /*!< SCU GPT12ICLR: GPT1T2C (Bitfield-Mask: 0x01)          */
/* =========================================================  NMISR  ========================================================= */
#define SCU_NMISR_FNMISUP_Pos             (7UL)                     /*!< SCU NMISR: FNMISUP (Bit 7)                            */
#define SCU_NMISR_FNMISUP_Msk             (0x80UL)                  /*!< SCU NMISR: FNMISUP (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIECC_Pos             (6UL)                     /*!< SCU NMISR: FNMIECC (Bit 6)                            */
#define SCU_NMISR_FNMIECC_Msk             (0x40UL)                  /*!< SCU NMISR: FNMIECC (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIMAP_Pos             (5UL)                     /*!< SCU NMISR: FNMIMAP (Bit 5)                            */
#define SCU_NMISR_FNMIMAP_Msk             (0x20UL)                  /*!< SCU NMISR: FNMIMAP (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIOWD_Pos             (4UL)                     /*!< SCU NMISR: FNMIOWD (Bit 4)                            */
#define SCU_NMISR_FNMIOWD_Msk             (0x10UL)                  /*!< SCU NMISR: FNMIOWD (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIOT_Pos              (3UL)                     /*!< SCU NMISR: FNMIOT (Bit 3)                             */
#define SCU_NMISR_FNMIOT_Msk              (0x8UL)                   /*!< SCU NMISR: FNMIOT (Bitfield-Mask: 0x01)               */
#define SCU_NMISR_FNMINVM_Pos             (2UL)                     /*!< SCU NMISR: FNMINVM (Bit 2)                            */
#define SCU_NMISR_FNMINVM_Msk             (0x4UL)                   /*!< SCU NMISR: FNMINVM (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIPLL_Pos             (1UL)                     /*!< SCU NMISR: FNMIPLL (Bit 1)                            */
#define SCU_NMISR_FNMIPLL_Msk             (0x2UL)                   /*!< SCU NMISR: FNMIPLL (Bitfield-Mask: 0x01)              */
/* =======================================================  NMISRCLR  ======================================================== */
#define SCU_NMISRCLR_FNMISUPC_Pos         (7UL)                     /*!< SCU NMISRCLR: FNMISUPC (Bit 7)                        */
#define SCU_NMISRCLR_FNMISUPC_Msk         (0x80UL)                  /*!< SCU NMISRCLR: FNMISUPC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIECCC_Pos         (6UL)                     /*!< SCU NMISRCLR: FNMIECCC (Bit 6)                        */
#define SCU_NMISRCLR_FNMIECCC_Msk         (0x40UL)                  /*!< SCU NMISRCLR: FNMIECCC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIMAPC_Pos         (5UL)                     /*!< SCU NMISRCLR: FNMIMAPC (Bit 5)                        */
#define SCU_NMISRCLR_FNMIMAPC_Msk         (0x20UL)                  /*!< SCU NMISRCLR: FNMIMAPC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIOWDC_Pos         (4UL)                     /*!< SCU NMISRCLR: FNMIOWDC (Bit 4)                        */
#define SCU_NMISRCLR_FNMIOWDC_Msk         (0x10UL)                  /*!< SCU NMISRCLR: FNMIOWDC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIOTC_Pos          (3UL)                     /*!< SCU NMISRCLR: FNMIOTC (Bit 3)                         */
#define SCU_NMISRCLR_FNMIOTC_Msk          (0x8UL)                   /*!< SCU NMISRCLR: FNMIOTC (Bitfield-Mask: 0x01)           */
#define SCU_NMISRCLR_FNMINVMC_Pos         (2UL)                     /*!< SCU NMISRCLR: FNMINVMC (Bit 2)                        */
#define SCU_NMISRCLR_FNMINVMC_Msk         (0x4UL)                   /*!< SCU NMISRCLR: FNMINVMC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIPLLC_Pos         (1UL)                     /*!< SCU NMISRCLR: FNMIPLLC (Bit 1)                        */
#define SCU_NMISRCLR_FNMIPLLC_Msk         (0x2UL)                   /*!< SCU NMISRCLR: FNMIPLLC (Bitfield-Mask: 0x01)          */
/* ========================================================  MODIEN1  ======================================================== */
#define SCU_MODIEN1_RIREN2_Pos            (10UL)                    /*!< SCU MODIEN1: RIREN2 (Bit 10)                          */
#define SCU_MODIEN1_RIREN2_Msk            (0x400UL)                 /*!< SCU MODIEN1: RIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_TIREN2_Pos            (9UL)                     /*!< SCU MODIEN1: TIREN2 (Bit 9)                           */
#define SCU_MODIEN1_TIREN2_Msk            (0x200UL)                 /*!< SCU MODIEN1: TIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_EIREN2_Pos            (8UL)                     /*!< SCU MODIEN1: EIREN2 (Bit 8)                           */
#define SCU_MODIEN1_EIREN2_Msk            (0x100UL)                 /*!< SCU MODIEN1: EIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_RIREN1_Pos            (2UL)                     /*!< SCU MODIEN1: RIREN1 (Bit 2)                           */
#define SCU_MODIEN1_RIREN1_Msk            (0x4UL)                   /*!< SCU MODIEN1: RIREN1 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_TIREN1_Pos            (1UL)                     /*!< SCU MODIEN1: TIREN1 (Bit 1)                           */
#define SCU_MODIEN1_TIREN1_Msk            (0x2UL)                   /*!< SCU MODIEN1: TIREN1 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_EIREN1_Pos            (0UL)                     /*!< SCU MODIEN1: EIREN1 (Bit 0)                           */
#define SCU_MODIEN1_EIREN1_Msk            (0x1UL)                   /*!< SCU MODIEN1: EIREN1 (Bitfield-Mask: 0x01)             */
/* ========================================================  MODIEN2  ======================================================== */
#define SCU_MODIEN2_TIEN2_Pos             (7UL)                     /*!< SCU MODIEN2: TIEN2 (Bit 7)                            */
#define SCU_MODIEN2_TIEN2_Msk             (0x80UL)                  /*!< SCU MODIEN2: TIEN2 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_RIEN2_Pos             (6UL)                     /*!< SCU MODIEN2: RIEN2 (Bit 6)                            */
#define SCU_MODIEN2_RIEN2_Msk             (0x40UL)                  /*!< SCU MODIEN2: RIEN2 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_EXINT2_EN_Pos         (5UL)                     /*!< SCU MODIEN2: EXINT2_EN (Bit 5)                        */
#define SCU_MODIEN2_EXINT2_EN_Msk         (0x20UL)                  /*!< SCU MODIEN2: EXINT2_EN (Bitfield-Mask: 0x01)          */
#define SCU_MODIEN2_TIEN1_Pos             (1UL)                     /*!< SCU MODIEN2: TIEN1 (Bit 1)                            */
#define SCU_MODIEN2_TIEN1_Msk             (0x2UL)                   /*!< SCU MODIEN2: TIEN1 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_RIEN1_Pos             (0UL)                     /*!< SCU MODIEN2: RIEN1 (Bit 0)                            */
#define SCU_MODIEN2_RIEN1_Msk             (0x1UL)                   /*!< SCU MODIEN2: RIEN1 (Bitfield-Mask: 0x01)              */
/* ========================================================  MODIEN3  ======================================================== */
#define SCU_MODIEN3_IE0_Pos               (0UL)                     /*!< SCU MODIEN3: IE0 (Bit 0)                              */
#define SCU_MODIEN3_IE0_Msk               (0x1UL)                   /*!< SCU MODIEN3: IE0 (Bitfield-Mask: 0x01)                */
/* ========================================================  MODIEN4  ======================================================== */
#define SCU_MODIEN4_IE1_Pos               (0UL)                     /*!< SCU MODIEN4: IE1 (Bit 0)                              */
#define SCU_MODIEN4_IE1_Msk               (0x1UL)                   /*!< SCU MODIEN4: IE1 (Bitfield-Mask: 0x01)                */
/* ========================================================  MONIEN  ========================================================= */
#define SCU_MONIEN_MON5IE_Pos             (4UL)                     /*!< SCU MONIEN: MON5IE (Bit 4)                            */
#define SCU_MONIEN_MON5IE_Msk             (0x10UL)                  /*!< SCU MONIEN: MON5IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON4IE_Pos             (3UL)                     /*!< SCU MONIEN: MON4IE (Bit 3)                            */
#define SCU_MONIEN_MON4IE_Msk             (0x8UL)                   /*!< SCU MONIEN: MON4IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON3IE_Pos             (2UL)                     /*!< SCU MONIEN: MON3IE (Bit 2)                            */
#define SCU_MONIEN_MON3IE_Msk             (0x4UL)                   /*!< SCU MONIEN: MON3IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON2IE_Pos             (1UL)                     /*!< SCU MONIEN: MON2IE (Bit 1)                            */
#define SCU_MONIEN_MON2IE_Msk             (0x2UL)                   /*!< SCU MONIEN: MON2IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON1IE_Pos             (0UL)                     /*!< SCU MONIEN: MON1IE (Bit 0)                            */
#define SCU_MONIEN_MON1IE_Msk             (0x1UL)                   /*!< SCU MONIEN: MON1IE (Bitfield-Mask: 0x01)              */
/* =======================================================  GPT12IEN  ======================================================== */
#define SCU_GPT12IEN_CRIE_Pos             (5UL)                     /*!< SCU GPT12IEN: CRIE (Bit 5)                            */
#define SCU_GPT12IEN_CRIE_Msk             (0x20UL)                  /*!< SCU GPT12IEN: CRIE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T6IE_Pos             (4UL)                     /*!< SCU GPT12IEN: T6IE (Bit 4)                            */
#define SCU_GPT12IEN_T6IE_Msk             (0x10UL)                  /*!< SCU GPT12IEN: T6IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T5IE_Pos             (3UL)                     /*!< SCU GPT12IEN: T5IE (Bit 3)                            */
