zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
#define SCU_GPT12IEN_T5IE_Msk             (0x8UL)                   /*!< SCU GPT12IEN: T5IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T4IE_Pos             (2UL)                     /*!< SCU GPT12IEN: T4IE (Bit 2)                            */
#define SCU_GPT12IEN_T4IE_Msk             (0x4UL)                   /*!< SCU GPT12IEN: T4IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T3IE_Pos             (1UL)                     /*!< SCU GPT12IEN: T3IE (Bit 1)                            */
#define SCU_GPT12IEN_T3IE_Msk             (0x2UL)                   /*!< SCU GPT12IEN: T3IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T2IE_Pos             (0UL)                     /*!< SCU GPT12IEN: T2IE (Bit 0)                            */
#define SCU_GPT12IEN_T2IE_Msk             (0x1UL)                   /*!< SCU GPT12IEN: T2IE (Bitfield-Mask: 0x01)              */
/* =======================================================  MODPISEL  ======================================================== */
#define SCU_MODPISEL_SSC12_S_MRST_OUTSEL_Pos (18UL)                 /*!< SCU MODPISEL: SSC12_S_MRST_OUTSEL (Bit 18)            */
#define SCU_MODPISEL_SSC12_S_MRST_OUTSEL_Msk (0x40000UL)            /*!< SCU MODPISEL: SSC12_S_MRST_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_SSC12_M_MTSR_OUTSEL_Pos (17UL)                 /*!< SCU MODPISEL: SSC12_M_MTSR_OUTSEL (Bit 17)            */
#define SCU_MODPISEL_SSC12_M_MTSR_OUTSEL_Msk (0x20000UL)            /*!< SCU MODPISEL: SSC12_M_MTSR_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_SSC12_M_SCK_OUTSEL_Pos (16UL)                  /*!< SCU MODPISEL: SSC12_M_SCK_OUTSEL (Bit 16)             */
#define SCU_MODPISEL_SSC12_M_SCK_OUTSEL_Msk (0x10000UL)             /*!< SCU MODPISEL: SSC12_M_SCK_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_U_TX_CONDIS_Pos      (7UL)                     /*!< SCU MODPISEL: U_TX_CONDIS (Bit 7)                     */
#define SCU_MODPISEL_U_TX_CONDIS_Msk      (0x80UL)                  /*!< SCU MODPISEL: U_TX_CONDIS (Bitfield-Mask: 0x01)       */
#define SCU_MODPISEL_URIOS1_Pos           (6UL)                     /*!< SCU MODPISEL: URIOS1 (Bit 6)                          */
#define SCU_MODPISEL_URIOS1_Msk           (0x40UL)                  /*!< SCU MODPISEL: URIOS1 (Bitfield-Mask: 0x01)            */
#define SCU_MODPISEL_EXINT2IS_Pos         (4UL)                     /*!< SCU MODPISEL: EXINT2IS (Bit 4)                        */
#define SCU_MODPISEL_EXINT2IS_Msk         (0x30UL)                  /*!< SCU MODPISEL: EXINT2IS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL_EXINT1IS_Pos         (2UL)                     /*!< SCU MODPISEL: EXINT1IS (Bit 2)                        */
#define SCU_MODPISEL_EXINT1IS_Msk         (0xcUL)                   /*!< SCU MODPISEL: EXINT1IS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL_EXINT0IS_Pos         (0UL)                     /*!< SCU MODPISEL: EXINT0IS (Bit 0)                        */
#define SCU_MODPISEL_EXINT0IS_Msk         (0x3UL)                   /*!< SCU MODPISEL: EXINT0IS (Bitfield-Mask: 0x03)          */
/* =======================================================  MODPISEL1  ======================================================= */
#define SCU_MODPISEL1_T21EXCON_Pos        (7UL)                     /*!< SCU MODPISEL1: T21EXCON (Bit 7)                       */
#define SCU_MODPISEL1_T21EXCON_Msk        (0x80UL)                  /*!< SCU MODPISEL1: T21EXCON (Bitfield-Mask: 0x01)         */
#define SCU_MODPISEL1_T2EXCON_Pos         (6UL)                     /*!< SCU MODPISEL1: T2EXCON (Bit 6)                        */
#define SCU_MODPISEL1_T2EXCON_Msk         (0x40UL)                  /*!< SCU MODPISEL1: T2EXCON (Bitfield-Mask: 0x01)          */
#define SCU_MODPISEL1_XTAL12EN_Pos        (0UL)                     /*!< SCU MODPISEL1: XTAL12EN (Bit 0)                       */
#define SCU_MODPISEL1_XTAL12EN_Msk        (0x1UL)                   /*!< SCU MODPISEL1: XTAL12EN (Bitfield-Mask: 0x01)         */
/* =======================================================  MODPISEL2  ======================================================= */
#define SCU_MODPISEL2_T21EXIS_Pos         (6UL)                     /*!< SCU MODPISEL2: T21EXIS (Bit 6)                        */
#define SCU_MODPISEL2_T21EXIS_Msk         (0xc0UL)                  /*!< SCU MODPISEL2: T21EXIS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL2_T2EXIS_Pos          (4UL)                     /*!< SCU MODPISEL2: T2EXIS (Bit 4)                         */
#define SCU_MODPISEL2_T2EXIS_Msk          (0x30UL)                  /*!< SCU MODPISEL2: T2EXIS (Bitfield-Mask: 0x03)           */
#define SCU_MODPISEL2_T21IS_Pos           (2UL)                     /*!< SCU MODPISEL2: T21IS (Bit 2)                          */
#define SCU_MODPISEL2_T21IS_Msk           (0xcUL)                   /*!< SCU MODPISEL2: T21IS (Bitfield-Mask: 0x03)            */
#define SCU_MODPISEL2_T2IS_Pos            (0UL)                     /*!< SCU MODPISEL2: T2IS (Bit 0)                           */
#define SCU_MODPISEL2_T2IS_Msk            (0x3UL)                   /*!< SCU MODPISEL2: T2IS (Bitfield-Mask: 0x03)             */
/* =======================================================  MODPISEL3  ======================================================= */
#define SCU_MODPISEL3_URIOS2_Pos          (6UL)                     /*!< SCU MODPISEL3: URIOS2 (Bit 6)                         */
#define SCU_MODPISEL3_URIOS2_Msk          (0x40UL)                  /*!< SCU MODPISEL3: URIOS2 (Bitfield-Mask: 0x01)           */
/* =======================================================  P0_POCON0  ======================================================= */
#define SCU_P0_POCON0_P0_PDM5_Pos         (20UL)                    /*!< SCU P0_POCON0: P0_PDM5 (Bit 20)                       */
#define SCU_P0_POCON0_P0_PDM5_Msk         (0x700000UL)              /*!< SCU P0_POCON0: P0_PDM5 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM4_Pos         (16UL)                    /*!< SCU P0_POCON0: P0_PDM4 (Bit 16)                       */
#define SCU_P0_POCON0_P0_PDM4_Msk         (0x70000UL)               /*!< SCU P0_POCON0: P0_PDM4 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM3_Pos         (12UL)                    /*!< SCU P0_POCON0: P0_PDM3 (Bit 12)                       */
#define SCU_P0_POCON0_P0_PDM3_Msk         (0x7000UL)                /*!< SCU P0_POCON0: P0_PDM3 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM2_Pos         (8UL)                     /*!< SCU P0_POCON0: P0_PDM2 (Bit 8)                        */
#define SCU_P0_POCON0_P0_PDM2_Msk         (0x700UL)                 /*!< SCU P0_POCON0: P0_PDM2 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM1_Pos         (4UL)                     /*!< SCU P0_POCON0: P0_PDM1 (Bit 4)                        */
#define SCU_P0_POCON0_P0_PDM1_Msk         (0x70UL)                  /*!< SCU P0_POCON0: P0_PDM1 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM0_Pos         (0UL)                     /*!< SCU P0_POCON0: P0_PDM0 (Bit 0)                        */
#define SCU_P0_POCON0_P0_PDM0_Msk         (0x7UL)                   /*!< SCU P0_POCON0: P0_PDM0 (Bitfield-Mask: 0x07)          */
/* =======================================================  P1_POCON0  ======================================================= */
#define SCU_P1_POCON0_P1_PDM4_Pos         (16UL)                    /*!< SCU P1_POCON0: P1_PDM4 (Bit 16)                       */
#define SCU_P1_POCON0_P1_PDM4_Msk         (0x70000UL)               /*!< SCU P1_POCON0: P1_PDM4 (Bitfield-Mask: 0x07)          */
#define SCU_P1_POCON0_P1_PDM2_Pos         (8UL)                     /*!< SCU P1_POCON0: P1_PDM2 (Bit 8)                        */
#define SCU_P1_POCON0_P1_PDM2_Msk         (0x700UL)                 /*!< SCU P1_POCON0: P1_PDM2 (Bitfield-Mask: 0x07)          */
#define SCU_P1_POCON0_P1_PDM1_Pos         (4UL)                     /*!< SCU P1_POCON0: P1_PDM1 (Bit 4)                        */
#define SCU_P1_POCON0_P1_PDM1_Msk         (0x70UL)                  /*!< SCU P1_POCON0: P1_PDM1 (Bitfield-Mask: 0x07)          */
#define SCU_P1_POCON0_P1_PDM0_Pos         (0UL)                     /*!< SCU P1_POCON0: P1_PDM0 (Bit 0)                        */
#define SCU_P1_POCON0_P1_PDM0_Msk         (0x7UL)                   /*!< SCU P1_POCON0: P1_PDM0 (Bitfield-Mask: 0x07)          */
/* =========================================================  TCCR  ========================================================== */
#define SCU_TCCR_TCC_Pos                  (0UL)                     /*!< SCU TCCR: TCC (Bit 0)                                 */
#define SCU_TCCR_TCC_Msk                  (0x3UL)                   /*!< SCU TCCR: TCC (Bitfield-Mask: 0x03)                   */
/* ======================================================  GPT12PISEL  ======================================================= */
#define SCU_GPT12PISEL_GPT12_SEL_Pos      (5UL)                     /*!< SCU GPT12PISEL: GPT12_SEL (Bit 5)                     */
#define SCU_GPT12PISEL_GPT12_SEL_Msk      (0x20UL)                  /*!< SCU GPT12PISEL: GPT12_SEL (Bitfield-Mask: 0x01)       */
#define SCU_GPT12PISEL_TRIG_CONF_Pos      (4UL)                     /*!< SCU GPT12PISEL: TRIG_CONF (Bit 4)                     */
#define SCU_GPT12PISEL_TRIG_CONF_Msk      (0x10UL)                  /*!< SCU GPT12PISEL: TRIG_CONF (Bitfield-Mask: 0x01)       */
#define SCU_GPT12PISEL_GPT12_Pos          (0UL)                     /*!< SCU GPT12PISEL: GPT12 (Bit 0)                         */
#define SCU_GPT12PISEL_GPT12_Msk          (0xfUL)                   /*!< SCU GPT12PISEL: GPT12 (Bitfield-Mask: 0x0f)           */
/* =======================================================  MODPISEL4  ======================================================= */
#define SCU_MODPISEL4_DU4TRIGGEN_Pos      (24UL)                    /*!< SCU MODPISEL4: DU4TRIGGEN (Bit 24)                    */
#define SCU_MODPISEL4_DU4TRIGGEN_Msk      (0x7000000UL)             /*!< SCU MODPISEL4: DU4TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU3TRIGGEN_Pos      (16UL)                    /*!< SCU MODPISEL4: DU3TRIGGEN (Bit 16)                    */
#define SCU_MODPISEL4_DU3TRIGGEN_Msk      (0x70000UL)               /*!< SCU MODPISEL4: DU3TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU2TRIGGEN_Pos      (8UL)                     /*!< SCU MODPISEL4: DU2TRIGGEN (Bit 8)                     */
#define SCU_MODPISEL4_DU2TRIGGEN_Msk      (0x700UL)                 /*!< SCU MODPISEL4: DU2TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU1TRIGGEN_Pos      (0UL)                     /*!< SCU MODPISEL4: DU1TRIGGEN (Bit 0)                     */
#define SCU_MODPISEL4_DU1TRIGGEN_Msk      (0x7UL)                   /*!< SCU MODPISEL4: DU1TRIGGEN (Bitfield-Mask: 0x07)       */
/* =========================================================  PMCON  ========================================================= */
#define SCU_PMCON_T21_DIS_Pos             (10UL)                    /*!< SCU PMCON: T21_DIS (Bit 10)                           */
#define SCU_PMCON_T21_DIS_Msk             (0x400UL)                 /*!< SCU PMCON: T21_DIS (Bitfield-Mask: 0x01)              */
#define SCU_PMCON_SSC2_DIS_Pos            (8UL)                     /*!< SCU PMCON: SSC2_DIS (Bit 8)                           */
#define SCU_PMCON_SSC2_DIS_Msk            (0x100UL)                 /*!< SCU PMCON: SSC2_DIS (Bitfield-Mask: 0x01)             */
#define SCU_PMCON_GPT12_DIS_Pos           (4UL)                     /*!< SCU PMCON: GPT12_DIS (Bit 4)                          */
#define SCU_PMCON_GPT12_DIS_Msk           (0x10UL)                  /*!< SCU PMCON: GPT12_DIS (Bitfield-Mask: 0x01)            */
#define SCU_PMCON_T2_DIS_Pos              (3UL)                     /*!< SCU PMCON: T2_DIS (Bit 3)                             */
#define SCU_PMCON_T2_DIS_Msk              (0x8UL)                   /*!< SCU PMCON: T2_DIS (Bitfield-Mask: 0x01)               */
#define SCU_PMCON_CCU_DIS_Pos             (2UL)                     /*!< SCU PMCON: CCU_DIS (Bit 2)                            */
#define SCU_PMCON_CCU_DIS_Msk             (0x4UL)                   /*!< SCU PMCON: CCU_DIS (Bitfield-Mask: 0x01)              */
#define SCU_PMCON_SSC1_DIS_Pos            (1UL)                     /*!< SCU PMCON: SSC1_DIS (Bit 1)                           */
#define SCU_PMCON_SSC1_DIS_Msk            (0x2UL)                   /*!< SCU PMCON: SSC1_DIS (Bitfield-Mask: 0x01)             */
#define SCU_PMCON_ADC1_DIS_Pos            (0UL)                     /*!< SCU PMCON: ADC1_DIS (Bit 0)                           */
#define SCU_PMCON_ADC1_DIS_Msk            (0x1UL)                   /*!< SCU PMCON: ADC1_DIS (Bitfield-Mask: 0x01)             */
/* ========================================================  MODSUSP  ======================================================== */
#define SCU_MODSUSP_ADC1_SUSP_Pos         (10UL)                    /*!< SCU MODSUSP: ADC1_SUSP (Bit 10)                       */
#define SCU_MODSUSP_ADC1_SUSP_Msk         (0x400UL)                 /*!< SCU MODSUSP: ADC1_SUSP (Bitfield-Mask: 0x01)          */
#define SCU_MODSUSP_MU_SUSP_Pos           (9UL)                     /*!< SCU MODSUSP: MU_SUSP (Bit 9)                          */
#define SCU_MODSUSP_MU_SUSP_Msk           (0x200UL)                 /*!< SCU MODSUSP: MU_SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_WDT1SUSP_Pos          (7UL)                     /*!< SCU MODSUSP: WDT1SUSP (Bit 7)                         */
#define SCU_MODSUSP_WDT1SUSP_Msk          (0x80UL)                  /*!< SCU MODSUSP: WDT1SUSP (Bitfield-Mask: 0x01)           */
#define SCU_MODSUSP_T21_SUSP_Pos          (6UL)                     /*!< SCU MODSUSP: T21_SUSP (Bit 6)                         */
#define SCU_MODSUSP_T21_SUSP_Msk          (0x40UL)                  /*!< SCU MODSUSP: T21_SUSP (Bitfield-Mask: 0x01)           */
#define SCU_MODSUSP_GPT12_SUSP_Pos        (4UL)                     /*!< SCU MODSUSP: GPT12_SUSP (Bit 4)                       */
#define SCU_MODSUSP_GPT12_SUSP_Msk        (0x10UL)                  /*!< SCU MODSUSP: GPT12_SUSP (Bitfield-Mask: 0x01)         */
#define SCU_MODSUSP_T2_SUSP_Pos           (3UL)                     /*!< SCU MODSUSP: T2_SUSP (Bit 3)                          */
#define SCU_MODSUSP_T2_SUSP_Msk           (0x8UL)                   /*!< SCU MODSUSP: T2_SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_T13SUSP_Pos           (2UL)                     /*!< SCU MODSUSP: T13SUSP (Bit 2)                          */
#define SCU_MODSUSP_T13SUSP_Msk           (0x4UL)                   /*!< SCU MODSUSP: T13SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_T12SUSP_Pos           (1UL)                     /*!< SCU MODSUSP: T12SUSP (Bit 1)                          */
#define SCU_MODSUSP_T12SUSP_Msk           (0x2UL)                   /*!< SCU MODSUSP: T12SUSP (Bitfield-Mask: 0x01)            */
/* =========================================================  BCON1  ========================================================= */
#define SCU_BCON1_BR1_PRE_Pos             (1UL)                     /*!< SCU BCON1: BR1_PRE (Bit 1)                            */
#define SCU_BCON1_BR1_PRE_Msk             (0xeUL)                   /*!< SCU BCON1: BR1_PRE (Bitfield-Mask: 0x07)              */
#define SCU_BCON1_BR1_R_Pos               (0UL)                     /*!< SCU BCON1: BR1_R (Bit 0)                              */
#define SCU_BCON1_BR1_R_Msk               (0x1UL)                   /*!< SCU BCON1: BR1_R (Bitfield-Mask: 0x01)                */
/* =========================================================  BCON2  ========================================================= */
#define SCU_BCON2_BR2_PRE_Pos             (1UL)                     /*!< SCU BCON2: BR2_PRE (Bit 1)                            */
#define SCU_BCON2_BR2_PRE_Msk             (0xeUL)                   /*!< SCU BCON2: BR2_PRE (Bitfield-Mask: 0x07)              */
#define SCU_BCON2_BR2_R_Pos               (0UL)                     /*!< SCU BCON2: BR2_R (Bit 0)                              */
#define SCU_BCON2_BR2_R_Msk               (0x1UL)                   /*!< SCU BCON2: BR2_R (Bitfield-Mask: 0x01)                */
/* =========================================================  BGL1  ========================================================== */
#define SCU_BGL1_BG1_FD_SEL_Pos           (0UL)                     /*!< SCU BGL1: BG1_FD_SEL (Bit 0)                          */
#define SCU_BGL1_BG1_FD_SEL_Msk           (0x1fUL)                  /*!< SCU BGL1: BG1_FD_SEL (Bitfield-Mask: 0x1f)            */
/* =========================================================  BGL2  ========================================================== */
#define SCU_BGL2_BG2_FD_SEL_Pos           (0UL)                     /*!< SCU BGL2: BG2_FD_SEL (Bit 0)                          */
#define SCU_BGL2_BG2_FD_SEL_Msk           (0x1fUL)                  /*!< SCU BGL2: BG2_FD_SEL (Bitfield-Mask: 0x1f)            */
/* ==========================================================  BG1  ========================================================== */
#define SCU_BG1_BG1_BR_VALUE_Pos          (0UL)                     /*!< SCU BG1: BG1_BR_VALUE (Bit 0)                         */
#define SCU_BG1_BG1_BR_VALUE_Msk          (0x7ffUL)                 /*!< SCU BG1: BG1_BR_VALUE (Bitfield-Mask: 0x7ff)          */
/* ==========================================================  BG2  ========================================================== */
#define SCU_BG2_BG2_BR_VALUE_Pos          (0UL)                     /*!< SCU BG2: BG2_BR_VALUE (Bit 0)                         */
#define SCU_BG2_BG2_BR_VALUE_Msk          (0x7ffUL)                 /*!< SCU BG2: BG2_BR_VALUE (Bitfield-Mask: 0x7ff)          */
/* =========================================================  LINST  ========================================================= */
#define SCU_LINST_SYNEN_Pos               (6UL)                     /*!< SCU LINST: SYNEN (Bit 6)                              */
#define SCU_LINST_SYNEN_Msk               (0x40UL)                  /*!< SCU LINST: SYNEN (Bitfield-Mask: 0x01)                */
#define SCU_LINST_ERRSYN_Pos              (5UL)                     /*!< SCU LINST: ERRSYN (Bit 5)                             */
#define SCU_LINST_ERRSYN_Msk              (0x20UL)                  /*!< SCU LINST: ERRSYN (Bitfield-Mask: 0x01)               */
#define SCU_LINST_EOFSYN_Pos              (4UL)                     /*!< SCU LINST: EOFSYN (Bit 4)                             */
#define SCU_LINST_EOFSYN_Msk              (0x10UL)                  /*!< SCU LINST: EOFSYN (Bitfield-Mask: 0x01)               */
#define SCU_LINST_BRK_Pos                 (3UL)                     /*!< SCU LINST: BRK (Bit 3)                                */
#define SCU_LINST_BRK_Msk                 (0x8UL)                   /*!< SCU LINST: BRK (Bitfield-Mask: 0x01)                  */
#define SCU_LINST_BGSEL_Pos               (1UL)                     /*!< SCU LINST: BGSEL (Bit 1)                              */
#define SCU_LINST_BGSEL_Msk               (0x6UL)                   /*!< SCU LINST: BGSEL (Bitfield-Mask: 0x03)                */
#define SCU_LINST_BRDIS_Pos               (0UL)                     /*!< SCU LINST: BRDIS (Bit 0)                              */
#define SCU_LINST_BRDIS_Msk               (0x1UL)                   /*!< SCU LINST: BRDIS (Bitfield-Mask: 0x01)                */
/* ========================================================  LINSCLR  ======================================================== */
#define SCU_LINSCLR_ERRSYNC_Pos           (5UL)                     /*!< SCU LINSCLR: ERRSYNC (Bit 5)                          */
#define SCU_LINSCLR_ERRSYNC_Msk           (0x20UL)                  /*!< SCU LINSCLR: ERRSYNC (Bitfield-Mask: 0x01)            */
#define SCU_LINSCLR_EOFSYNC_Pos           (4UL)                     /*!< SCU LINSCLR: EOFSYNC (Bit 4)                          */
#define SCU_LINSCLR_EOFSYNC_Msk           (0x10UL)                  /*!< SCU LINSCLR: EOFSYNC (Bitfield-Mask: 0x01)            */
#define SCU_LINSCLR_BRKC_Pos              (3UL)                     /*!< SCU LINSCLR: BRKC (Bit 3)                             */
#define SCU_LINSCLR_BRKC_Msk              (0x8UL)                   /*!< SCU LINSCLR: BRKC (Bitfield-Mask: 0x01)               */
/* ========================================================  EDCCON  ========================================================= */
#define SCU_EDCCON_NVMIE_Pos              (2UL)                     /*!< SCU EDCCON: NVMIE (Bit 2)                             */
#define SCU_EDCCON_NVMIE_Msk              (0x4UL)                   /*!< SCU EDCCON: NVMIE (Bitfield-Mask: 0x01)               */
#define SCU_EDCCON_RIE_Pos                (0UL)                     /*!< SCU EDCCON: RIE (Bit 0)                               */
#define SCU_EDCCON_RIE_Msk                (0x1UL)                   /*!< SCU EDCCON: RIE (Bitfield-Mask: 0x01)                 */
/* ========================================================  EDCSTAT  ======================================================== */
#define SCU_EDCSTAT_RSBE_Pos              (4UL)                     /*!< SCU EDCSTAT: RSBE (Bit 4)                             */
#define SCU_EDCSTAT_RSBE_Msk              (0x10UL)                  /*!< SCU EDCSTAT: RSBE (Bitfield-Mask: 0x01)               */
#define SCU_EDCSTAT_NVMDBE_Pos            (2UL)                     /*!< SCU EDCSTAT: NVMDBE (Bit 2)                           */
#define SCU_EDCSTAT_NVMDBE_Msk            (0x4UL)                   /*!< SCU EDCSTAT: NVMDBE (Bitfield-Mask: 0x01)             */
#define SCU_EDCSTAT_RDBE_Pos              (0UL)                     /*!< SCU EDCSTAT: RDBE (Bit 0)                             */
#define SCU_EDCSTAT_RDBE_Msk              (0x1UL)                   /*!< SCU EDCSTAT: RDBE (Bitfield-Mask: 0x01)               */
/* ========================================================  EDCSCLR  ======================================================== */
#define SCU_EDCSCLR_RSBEC_Pos             (4UL)                     /*!< SCU EDCSCLR: RSBEC (Bit 4)                            */
#define SCU_EDCSCLR_RSBEC_Msk             (0x10UL)                  /*!< SCU EDCSCLR: RSBEC (Bitfield-Mask: 0x01)              */
#define SCU_EDCSCLR_NVMDBEC_Pos           (2UL)                     /*!< SCU EDCSCLR: NVMDBEC (Bit 2)                          */
#define SCU_EDCSCLR_NVMDBEC_Msk           (0x4UL)                   /*!< SCU EDCSCLR: NVMDBEC (Bitfield-Mask: 0x01)            */
#define SCU_EDCSCLR_RDBEC_Pos             (0UL)                     /*!< SCU EDCSCLR: RDBEC (Bit 0)                            */
#define SCU_EDCSCLR_RDBEC_Msk             (0x1UL)                   /*!< SCU EDCSCLR: RDBEC (Bitfield-Mask: 0x01)              */
/* ========================================================  PASSWD  ========================================================= */
#define SCU_PASSWD_PASS_Pos               (3UL)                     /*!< SCU PASSWD: PASS (Bit 3)                              */
#define SCU_PASSWD_PASS_Msk               (0xf8UL)                  /*!< SCU PASSWD: PASS (Bitfield-Mask: 0x1f)                */
#define SCU_PASSWD_PROTECT_S_Pos          (2UL)                     /*!< SCU PASSWD: PROTECT_S (Bit 2)                         */
#define SCU_PASSWD_PROTECT_S_Msk          (0x4UL)                   /*!< SCU PASSWD: PROTECT_S (Bitfield-Mask: 0x01)           */
#define SCU_PASSWD_PW_MODE_Pos            (0UL)                     /*!< SCU PASSWD: PW_MODE (Bit 0)                           */
#define SCU_PASSWD_PW_MODE_Msk            (0x3UL)                   /*!< SCU PASSWD: PW_MODE (Bitfield-Mask: 0x03)             */
