zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* ====================================================  SYS_STRTUP_STS  ===================================================== */
#define SCU_SYS_STRTUP_STS_PG100TP_CHKS_ERR_Pos (2UL)               /*!< SCU SYS_STRTUP_STS: PG100TP_CHKS_ERR (Bit 2)          */
#define SCU_SYS_STRTUP_STS_PG100TP_CHKS_ERR_Msk (0x4UL)             /*!< SCU SYS_STRTUP_STS: PG100TP_CHKS_ERR (Bitfield-Mask: 0x01) */
#define SCU_SYS_STRTUP_STS_MRAMINITSTS_Pos (1UL)                    /*!< SCU SYS_STRTUP_STS: MRAMINITSTS (Bit 1)               */
#define SCU_SYS_STRTUP_STS_MRAMINITSTS_Msk (0x2UL)                  /*!< SCU SYS_STRTUP_STS: MRAMINITSTS (Bitfield-Mask: 0x01) */
#define SCU_SYS_STRTUP_STS_INIT_FAIL_Pos  (0UL)                     /*!< SCU SYS_STRTUP_STS: INIT_FAIL (Bit 0)                 */
#define SCU_SYS_STRTUP_STS_INIT_FAIL_Msk  (0x1UL)                   /*!< SCU SYS_STRTUP_STS: INIT_FAIL (Bitfield-Mask: 0x01)   */
/* =====================================================  NVM_PROT_STS  ====================================================== */
#define SCU_NVM_PROT_STS_NVMBSL_Pos       (14UL)                    /*!< SCU NVM_PROT_STS: NVMBSL (Bit 14)                     */
#define SCU_NVM_PROT_STS_NVMBSL_Msk       (0xc000UL)                /*!< SCU NVM_PROT_STS: NVMBSL (Bitfield-Mask: 0x03)        */
#define SCU_NVM_PROT_STS_CBSL_PW_Pos      (13UL)                    /*!< SCU NVM_PROT_STS: CBSL_PW (Bit 13)                    */
#define SCU_NVM_PROT_STS_CBSL_PW_Msk      (0x2000UL)                /*!< SCU NVM_PROT_STS: CBSL_PW (Bitfield-Mask: 0x01)       */
#define SCU_NVM_PROT_STS_LIN_PW_Pos       (12UL)                    /*!< SCU NVM_PROT_STS: LIN_PW (Bit 12)                     */
#define SCU_NVM_PROT_STS_LIN_PW_Msk       (0x1000UL)                /*!< SCU NVM_PROT_STS: LIN_PW (Bitfield-Mask: 0x01)        */
#define SCU_NVM_PROT_STS_NL_PW_Pos        (11UL)                    /*!< SCU NVM_PROT_STS: NL_PW (Bit 11)                      */
#define SCU_NVM_PROT_STS_NL_PW_Msk        (0x800UL)                 /*!< SCU NVM_PROT_STS: NL_PW (Bitfield-Mask: 0x01)         */
#define SCU_NVM_PROT_STS_DIS_RDUS_S0_Pos  (10UL)                    /*!< SCU NVM_PROT_STS: DIS_RDUS_S0 (Bit 10)                */
#define SCU_NVM_PROT_STS_DIS_RDUS_S0_Msk  (0x400UL)                 /*!< SCU NVM_PROT_STS: DIS_RDUS_S0 (Bitfield-Mask: 0x01)   */
#define SCU_NVM_PROT_STS_DIS_RDUS_Pos     (9UL)                     /*!< SCU NVM_PROT_STS: DIS_RDUS (Bit 9)                    */
#define SCU_NVM_PROT_STS_DIS_RDUS_Msk     (0x200UL)                 /*!< SCU NVM_PROT_STS: DIS_RDUS (Bitfield-Mask: 0x01)      */
#define SCU_NVM_PROT_STS_EN_RD_S0_Pos     (8UL)                     /*!< SCU NVM_PROT_STS: EN_RD_S0 (Bit 8)                    */
#define SCU_NVM_PROT_STS_EN_RD_S0_Msk     (0x100UL)                 /*!< SCU NVM_PROT_STS: EN_RD_S0 (Bitfield-Mask: 0x01)      */
#define SCU_NVM_PROT_STS_EN_RD_CBSL_Pos   (5UL)                     /*!< SCU NVM_PROT_STS: EN_RD_CBSL (Bit 5)                  */
#define SCU_NVM_PROT_STS_EN_RD_CBSL_Msk   (0x20UL)                  /*!< SCU NVM_PROT_STS: EN_RD_CBSL (Bitfield-Mask: 0x01)    */
#define SCU_NVM_PROT_STS_EN_RD_LIN_Pos    (4UL)                     /*!< SCU NVM_PROT_STS: EN_RD_LIN (Bit 4)                   */
#define SCU_NVM_PROT_STS_EN_RD_LIN_Msk    (0x10UL)                  /*!< SCU NVM_PROT_STS: EN_RD_LIN (Bitfield-Mask: 0x01)     */
#define SCU_NVM_PROT_STS_EN_RD_NL_Pos     (3UL)                     /*!< SCU NVM_PROT_STS: EN_RD_NL (Bit 3)                    */
#define SCU_NVM_PROT_STS_EN_RD_NL_Msk     (0x8UL)                   /*!< SCU NVM_PROT_STS: EN_RD_NL (Bitfield-Mask: 0x01)      */
#define SCU_NVM_PROT_STS_EN_PRG_CBSL_Pos  (2UL)                     /*!< SCU NVM_PROT_STS: EN_PRG_CBSL (Bit 2)                 */
#define SCU_NVM_PROT_STS_EN_PRG_CBSL_Msk  (0x4UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_CBSL (Bitfield-Mask: 0x01)   */
#define SCU_NVM_PROT_STS_EN_PRG_LIN_Pos   (1UL)                     /*!< SCU NVM_PROT_STS: EN_PRG_LIN (Bit 1)                  */
#define SCU_NVM_PROT_STS_EN_PRG_LIN_Msk   (0x2UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_LIN (Bitfield-Mask: 0x01)    */
#define SCU_NVM_PROT_STS_EN_PRG_NL_Pos    (0UL)                     /*!< SCU NVM_PROT_STS: EN_PRG_NL (Bit 0)                   */
#define SCU_NVM_PROT_STS_EN_PRG_NL_Msk    (0x1UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_NL (Bitfield-Mask: 0x01)     */
/* ======================================================  MEM_ACC_STS  ====================================================== */
#define SCU_MEM_ACC_STS_ROM_PROT_ERR_Pos  (4UL)                     /*!< SCU MEM_ACC_STS: ROM_PROT_ERR (Bit 4)                 */
#define SCU_MEM_ACC_STS_ROM_PROT_ERR_Msk  (0x10UL)                  /*!< SCU MEM_ACC_STS: ROM_PROT_ERR (Bitfield-Mask: 0x01)   */
#define SCU_MEM_ACC_STS_NVM_SFR_ADDR_ERR_Pos (3UL)                  /*!< SCU MEM_ACC_STS: NVM_SFR_ADDR_ERR (Bit 3)             */
#define SCU_MEM_ACC_STS_NVM_SFR_ADDR_ERR_Msk (0x8UL)                /*!< SCU MEM_ACC_STS: NVM_SFR_ADDR_ERR (Bitfield-Mask: 0x01) */
#define SCU_MEM_ACC_STS_NVM_SFR_PROT_ERR_Pos (2UL)                  /*!< SCU MEM_ACC_STS: NVM_SFR_PROT_ERR (Bit 2)             */
#define SCU_MEM_ACC_STS_NVM_SFR_PROT_ERR_Msk (0x4UL)                /*!< SCU MEM_ACC_STS: NVM_SFR_PROT_ERR (Bitfield-Mask: 0x01) */
#define SCU_MEM_ACC_STS_NVM_ADDR_ERR_Pos  (1UL)                     /*!< SCU MEM_ACC_STS: NVM_ADDR_ERR (Bit 1)                 */
#define SCU_MEM_ACC_STS_NVM_ADDR_ERR_Msk  (0x2UL)                   /*!< SCU MEM_ACC_STS: NVM_ADDR_ERR (Bitfield-Mask: 0x01)   */
#define SCU_MEM_ACC_STS_NVM_PROT_ERR_Pos  (0UL)                     /*!< SCU MEM_ACC_STS: NVM_PROT_ERR (Bit 0)                 */
#define SCU_MEM_ACC_STS_NVM_PROT_ERR_Msk  (0x1UL)                   /*!< SCU MEM_ACC_STS: NVM_PROT_ERR (Bitfield-Mask: 0x01)   */
/* ==========================================================  ID  =========================================================== */
#define SCU_ID_PRODID_Pos                 (3UL)                     /*!< SCU ID: PRODID (Bit 3)                                */
#define SCU_ID_PRODID_Msk                 (0xf8UL)                  /*!< SCU ID: PRODID (Bitfield-Mask: 0x1f)                  */
#define SCU_ID_VERID_Pos                  (0UL)                     /*!< SCU ID: VERID (Bit 0)                                 */
#define SCU_ID_VERID_Msk                  (0x7UL)                   /*!< SCU ID: VERID (Bitfield-Mask: 0x07)                   */
/* ========================================================  MEMSTAT  ======================================================== */
#define SCU_MEMSTAT_SASTATUS_Pos          (6UL)                     /*!< SCU MEMSTAT: SASTATUS (Bit 6)                         */
#define SCU_MEMSTAT_SASTATUS_Msk          (0xc0UL)                  /*!< SCU MEMSTAT: SASTATUS (Bitfield-Mask: 0x03)           */
#define SCU_MEMSTAT_SECTORINFO_Pos        (0UL)                     /*!< SCU MEMSTAT: SECTORINFO (Bit 0)                       */
#define SCU_MEMSTAT_SECTORINFO_Msk        (0x3fUL)                  /*!< SCU MEMSTAT: SECTORINFO (Bitfield-Mask: 0x3f)         */
/* =========================================================  EMOP  ========================================================== */
#define SCU_EMOP_EMPROP_Pos               (1UL)                     /*!< SCU EMOP: EMPROP (Bit 1)                              */
#define SCU_EMOP_EMPROP_Msk               (0x2UL)                   /*!< SCU EMOP: EMPROP (Bitfield-Mask: 0x01)                */
#define SCU_EMOP_NVMPROP_Pos              (0UL)                     /*!< SCU EMOP: NVMPROP (Bit 0)                             */
#define SCU_EMOP_NVMPROP_Msk              (0x1UL)                   /*!< SCU EMOP: NVMPROP (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                           SCUPM                                           ================ */
/* =========================================================================================================================== */

