zhanzr/TLE9844-Appkit/RTE/Device/TLE9844-2QX/tle984x.h
/* ====================================================  AMCLK_FREQ_STS  ===================================================== */
#define SCUPM_AMCLK_FREQ_STS_AMCLK2_FREQ_Pos (8UL)                  /*!< SCUPM AMCLK_FREQ_STS: AMCLK2_FREQ (Bit 8)             */
#define SCUPM_AMCLK_FREQ_STS_AMCLK2_FREQ_Msk (0x3f00UL)             /*!< SCUPM AMCLK_FREQ_STS: AMCLK2_FREQ (Bitfield-Mask: 0x3f) */
#define SCUPM_AMCLK_FREQ_STS_AMCLK1_FREQ_Pos (0UL)                  /*!< SCUPM AMCLK_FREQ_STS: AMCLK1_FREQ (Bit 0)             */
#define SCUPM_AMCLK_FREQ_STS_AMCLK1_FREQ_Msk (0x3fUL)               /*!< SCUPM AMCLK_FREQ_STS: AMCLK1_FREQ (Bitfield-Mask: 0x3f) */
/* ======================================================  AMCLK_CTRL  ======================================================= */
#define SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Pos  (0UL)                     /*!< SCUPM AMCLK_CTRL: CLKWDT_PD_N (Bit 0)                 */
#define SCUPM_AMCLK_CTRL_CLKWDT_PD_N_Msk  (0x1UL)                   /*!< SCUPM AMCLK_CTRL: CLKWDT_PD_N (Bitfield-Mask: 0x01)   */
/* =====================================================  AMCLK_TH_HYS  ====================================================== */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_HYS_Pos (30UL)                /*!< SCUPM AMCLK_TH_HYS: AMCLK2_LOW_HYS (Bit 30)           */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_HYS_Msk (0xc0000000UL)        /*!< SCUPM AMCLK_TH_HYS: AMCLK2_LOW_HYS (Bitfield-Mask: 0x03) */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_TH_Pos (24UL)                 /*!< SCUPM AMCLK_TH_HYS: AMCLK2_LOW_TH (Bit 24)            */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_LOW_TH_Msk (0x3f000000UL)         /*!< SCUPM AMCLK_TH_HYS: AMCLK2_LOW_TH (Bitfield-Mask: 0x3f) */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_UP_HYS_Pos (22UL)                 /*!< SCUPM AMCLK_TH_HYS: AMCLK2_UP_HYS (Bit 22)            */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_UP_HYS_Msk (0xc00000UL)           /*!< SCUPM AMCLK_TH_HYS: AMCLK2_UP_HYS (Bitfield-Mask: 0x03) */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_UP_TH_Pos (16UL)                  /*!< SCUPM AMCLK_TH_HYS: AMCLK2_UP_TH (Bit 16)             */
#define SCUPM_AMCLK_TH_HYS_AMCLK2_UP_TH_Msk (0x3f0000UL)            /*!< SCUPM AMCLK_TH_HYS: AMCLK2_UP_TH (Bitfield-Mask: 0x3f) */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_HYS_Pos (14UL)                /*!< SCUPM AMCLK_TH_HYS: AMCLK1_LOW_HYS (Bit 14)           */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_HYS_Msk (0xc000UL)            /*!< SCUPM AMCLK_TH_HYS: AMCLK1_LOW_HYS (Bitfield-Mask: 0x03) */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_TH_Pos (8UL)                  /*!< SCUPM AMCLK_TH_HYS: AMCLK1_LOW_TH (Bit 8)             */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_LOW_TH_Msk (0x3f00UL)             /*!< SCUPM AMCLK_TH_HYS: AMCLK1_LOW_TH (Bitfield-Mask: 0x3f) */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_UP_HYS_Pos (6UL)                  /*!< SCUPM AMCLK_TH_HYS: AMCLK1_UP_HYS (Bit 6)             */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_UP_HYS_Msk (0xc0UL)               /*!< SCUPM AMCLK_TH_HYS: AMCLK1_UP_HYS (Bitfield-Mask: 0x03) */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_UP_TH_Pos (0UL)                   /*!< SCUPM AMCLK_TH_HYS: AMCLK1_UP_TH (Bit 0)              */
#define SCUPM_AMCLK_TH_HYS_AMCLK1_UP_TH_Msk (0x3fUL)                /*!< SCUPM AMCLK_TH_HYS: AMCLK1_UP_TH (Bitfield-Mask: 0x3f) */
/* ========================================================  STCALIB  ======================================================== */
#define SCUPM_STCALIB_STCALIB_Pos         (0UL)                     /*!< SCUPM STCALIB: STCALIB (Bit 0)                        */
#define SCUPM_STCALIB_STCALIB_Msk         (0x3ffffffUL)             /*!< SCUPM STCALIB: STCALIB (Bitfield-Mask: 0x3ffffff)     */
/* ========================================================  SYS_IS  ========================================================= */
#define SCUPM_SYS_IS_SYS_SUPPLY_STS_Pos   (28UL)                    /*!< SCUPM SYS_IS: SYS_SUPPLY_STS (Bit 28)                 */
#define SCUPM_SYS_IS_SYS_SUPPLY_STS_Msk   (0x10000000UL)            /*!< SCUPM SYS_IS: SYS_SUPPLY_STS (Bitfield-Mask: 0x01)    */
#define SCUPM_SYS_IS_SYS_OT_STS_Pos       (25UL)                    /*!< SCUPM SYS_IS: SYS_OT_STS (Bit 25)                     */
#define SCUPM_SYS_IS_SYS_OT_STS_Msk       (0x2000000UL)             /*!< SCUPM SYS_IS: SYS_OT_STS (Bitfield-Mask: 0x01)        */
#define SCUPM_SYS_IS_SYS_OTWARN_STS_Pos   (24UL)                    /*!< SCUPM SYS_IS: SYS_OTWARN_STS (Bit 24)                 */
#define SCUPM_SYS_IS_SYS_OTWARN_STS_Msk   (0x1000000UL)             /*!< SCUPM SYS_IS: SYS_OTWARN_STS (Bitfield-Mask: 0x01)    */
#define SCUPM_SYS_IS_LIN_FAIL_STS_Pos     (22UL)                    /*!< SCUPM SYS_IS: LIN_FAIL_STS (Bit 22)                   */
#define SCUPM_SYS_IS_LIN_FAIL_STS_Msk     (0x400000UL)              /*!< SCUPM SYS_IS: LIN_FAIL_STS (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_IS_HS2_FAIL_STS_Pos     (19UL)                    /*!< SCUPM SYS_IS: HS2_FAIL_STS (Bit 19)                   */
#define SCUPM_SYS_IS_HS2_FAIL_STS_Msk     (0x80000UL)               /*!< SCUPM SYS_IS: HS2_FAIL_STS (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_IS_HS1_FAIL_STS_Pos     (18UL)                    /*!< SCUPM SYS_IS: HS1_FAIL_STS (Bit 18)                   */
#define SCUPM_SYS_IS_HS1_FAIL_STS_Msk     (0x40000UL)               /*!< SCUPM SYS_IS: HS1_FAIL_STS (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_IS_LS2_FAIL_STS_Pos     (17UL)                    /*!< SCUPM SYS_IS: LS2_FAIL_STS (Bit 17)                   */
#define SCUPM_SYS_IS_LS2_FAIL_STS_Msk     (0x20000UL)               /*!< SCUPM SYS_IS: LS2_FAIL_STS (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_IS_LS1_FAIL_STS_Pos     (16UL)                    /*!< SCUPM SYS_IS: LS1_FAIL_STS (Bit 16)                   */
#define SCUPM_SYS_IS_LS1_FAIL_STS_Msk     (0x10000UL)               /*!< SCUPM SYS_IS: LS1_FAIL_STS (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_IS_SYS_SUPPLY_IS_Pos    (12UL)                    /*!< SCUPM SYS_IS: SYS_SUPPLY_IS (Bit 12)                  */
#define SCUPM_SYS_IS_SYS_SUPPLY_IS_Msk    (0x1000UL)                /*!< SCUPM SYS_IS: SYS_SUPPLY_IS (Bitfield-Mask: 0x01)     */
#define SCUPM_SYS_IS_REFBG_UPTHWARN_IS_Pos (11UL)                   /*!< SCUPM SYS_IS: REFBG_UPTHWARN_IS (Bit 11)              */
#define SCUPM_SYS_IS_REFBG_UPTHWARN_IS_Msk (0x800UL)                /*!< SCUPM SYS_IS: REFBG_UPTHWARN_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_IS_REFBG_LOTHWARN_IS_Pos (10UL)                   /*!< SCUPM SYS_IS: REFBG_LOTHWARN_IS (Bit 10)              */
#define SCUPM_SYS_IS_REFBG_LOTHWARN_IS_Msk (0x400UL)                /*!< SCUPM SYS_IS: REFBG_LOTHWARN_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_IS_SYS_OT_IS_Pos        (9UL)                     /*!< SCUPM SYS_IS: SYS_OT_IS (Bit 9)                       */
#define SCUPM_SYS_IS_SYS_OT_IS_Msk        (0x200UL)                 /*!< SCUPM SYS_IS: SYS_OT_IS (Bitfield-Mask: 0x01)         */
#define SCUPM_SYS_IS_SYS_OTWARN_IS_Pos    (8UL)                     /*!< SCUPM SYS_IS: SYS_OTWARN_IS (Bit 8)                   */
#define SCUPM_SYS_IS_SYS_OTWARN_IS_Msk    (0x100UL)                 /*!< SCUPM SYS_IS: SYS_OTWARN_IS (Bitfield-Mask: 0x01)     */
#define SCUPM_SYS_IS_LIN_FAIL_IS_Pos      (6UL)                     /*!< SCUPM SYS_IS: LIN_FAIL_IS (Bit 6)                     */
#define SCUPM_SYS_IS_LIN_FAIL_IS_Msk      (0x40UL)                  /*!< SCUPM SYS_IS: LIN_FAIL_IS (Bitfield-Mask: 0x01)       */
#define SCUPM_SYS_IS_HS2_FAIL_IS_Pos      (3UL)                     /*!< SCUPM SYS_IS: HS2_FAIL_IS (Bit 3)                     */
#define SCUPM_SYS_IS_HS2_FAIL_IS_Msk      (0x8UL)                   /*!< SCUPM SYS_IS: HS2_FAIL_IS (Bitfield-Mask: 0x01)       */
#define SCUPM_SYS_IS_HS1_FAIL_IS_Pos      (2UL)                     /*!< SCUPM SYS_IS: HS1_FAIL_IS (Bit 2)                     */
#define SCUPM_SYS_IS_HS1_FAIL_IS_Msk      (0x4UL)                   /*!< SCUPM SYS_IS: HS1_FAIL_IS (Bitfield-Mask: 0x01)       */
#define SCUPM_SYS_IS_LS2_FAIL_IS_Pos      (1UL)                     /*!< SCUPM SYS_IS: LS2_FAIL_IS (Bit 1)                     */
#define SCUPM_SYS_IS_LS2_FAIL_IS_Msk      (0x2UL)                   /*!< SCUPM SYS_IS: LS2_FAIL_IS (Bitfield-Mask: 0x01)       */
#define SCUPM_SYS_IS_LS1_FAIL_IS_Pos      (0UL)                     /*!< SCUPM SYS_IS: LS1_FAIL_IS (Bit 0)                     */
#define SCUPM_SYS_IS_LS1_FAIL_IS_Msk      (0x1UL)                   /*!< SCUPM SYS_IS: LS1_FAIL_IS (Bitfield-Mask: 0x01)       */
/* ==================================================  SYS_SUPPLY_IRQ_STS  =================================================== */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_STS_Pos (25UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_STS (Bit 25)      */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_STS_Msk (0x2000000UL)    /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_OV_STS_Pos (24UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_OV_STS (Bit 24)      */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_OV_STS_Msk (0x1000000UL)    /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_OV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_OV_STS_Pos (23UL)            /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_OV_STS (Bit 23)       */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_OV_STS_Msk (0x800000UL)      /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_OV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_STS_Pos (22UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_STS (Bit 22)          */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_STS_Msk (0x400000UL)         /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_OV_STS_Pos (21UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_OV_STS (Bit 21)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_OV_STS_Msk (0x200000UL)       /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_OV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_STS_Pos (20UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_STS (Bit 20)      */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_STS_Msk (0x100000UL)     /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_STS_Pos (19UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_STS (Bit 19)      */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_STS_Msk (0x80000UL)      /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_STS_Pos (18UL)            /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_STS (Bit 18)       */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_STS_Msk (0x40000UL)       /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_STS_Pos (17UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_STS (Bit 17)          */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_STS_Msk (0x20000UL)          /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_UV_STS_Pos (16UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_UV_STS (Bit 16)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_UV_STS_Msk (0x10000UL)        /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_UV_STS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_IS_Pos (9UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_IS (Bit 9)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_IS_Msk (0x200UL)         /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_OV_IS_Pos (8UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_OV_IS (Bit 8)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_OV_IS_Msk (0x100UL)         /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_OV_IS_Pos (7UL)              /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_OV_IS (Bit 7)         */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_OV_IS_Msk (0x80UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_IS_Pos (6UL)                 /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_IS (Bit 6)            */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_IS_Msk (0x40UL)              /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_OV_IS_Pos (5UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_OV_IS (Bit 5)          */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_OV_IS_Msk (0x20UL)            /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_IS_Pos (4UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_IS (Bit 4)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_IS_Msk (0x10UL)          /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_IS_Pos (3UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_IS (Bit 3)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_IS_Msk (0x8UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_IS_Pos (2UL)              /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_IS (Bit 2)         */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_IS_Msk (0x4UL)            /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_IS_Pos (1UL)                 /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_IS (Bit 1)            */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_IS_Msk (0x2UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_UV_IS_Pos (0UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_UV_IS (Bit 0)          */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VBAT_UV_IS_Msk (0x1UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VBAT_UV_IS (Bitfield-Mask: 0x01) */
/* =======================================================  SYS_ISCLR  ======================================================= */
#define SCUPM_SYS_ISCLR_SYS_OT_SC_Pos     (25UL)                    /*!< SCUPM SYS_ISCLR: SYS_OT_SC (Bit 25)                   */
#define SCUPM_SYS_ISCLR_SYS_OT_SC_Msk     (0x2000000UL)             /*!< SCUPM SYS_ISCLR: SYS_OT_SC (Bitfield-Mask: 0x01)      */
#define SCUPM_SYS_ISCLR_SYS_OTWARN_SC_Pos (24UL)                    /*!< SCUPM SYS_ISCLR: SYS_OTWARN_SC (Bit 24)               */
#define SCUPM_SYS_ISCLR_SYS_OTWARN_SC_Msk (0x1000000UL)             /*!< SCUPM SYS_ISCLR: SYS_OTWARN_SC (Bitfield-Mask: 0x01)  */
#define SCUPM_SYS_ISCLR_REFBG_UPTHWARN_ISC_Pos (11UL)               /*!< SCUPM SYS_ISCLR: REFBG_UPTHWARN_ISC (Bit 11)          */
#define SCUPM_SYS_ISCLR_REFBG_UPTHWARN_ISC_Msk (0x800UL)            /*!< SCUPM SYS_ISCLR: REFBG_UPTHWARN_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_ISCLR_REFBG_LOTHWARN_ISC_Pos (10UL)               /*!< SCUPM SYS_ISCLR: REFBG_LOTHWARN_ISC (Bit 10)          */
#define SCUPM_SYS_ISCLR_REFBG_LOTHWARN_ISC_Msk (0x400UL)            /*!< SCUPM SYS_ISCLR: REFBG_LOTHWARN_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_ISCLR_SYS_OT_ISC_Pos    (9UL)                     /*!< SCUPM SYS_ISCLR: SYS_OT_ISC (Bit 9)                   */
#define SCUPM_SYS_ISCLR_SYS_OT_ISC_Msk    (0x200UL)                 /*!< SCUPM SYS_ISCLR: SYS_OT_ISC (Bitfield-Mask: 0x01)     */
#define SCUPM_SYS_ISCLR_SYS_OTWARN_ISC_Pos (8UL)                    /*!< SCUPM SYS_ISCLR: SYS_OTWARN_ISC (Bit 8)               */
#define SCUPM_SYS_ISCLR_SYS_OTWARN_ISC_Msk (0x100UL)                /*!< SCUPM SYS_ISCLR: SYS_OTWARN_ISC (Bitfield-Mask: 0x01) */
/* ==================================================  SYS_SUPPLY_IRQ_CLR  =================================================== */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_OV_SC_Pos (25UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_OV_SC (Bit 25)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_OV_SC_Msk (0x2000000UL)     /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_OV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_SC_Pos (24UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_OV_SC (Bit 24)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_SC_Msk (0x1000000UL)     /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_OV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_SC_Pos (23UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_OV_SC (Bit 23)        */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_SC_Msk (0x800000UL)       /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_OV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_SC_Pos (22UL)                /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_OV_SC (Bit 22)           */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_SC_Msk (0x400000UL)          /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_OV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_SC_Pos (21UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_OV_SC (Bit 21)         */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_SC_Msk (0x200000UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_OV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_UV_SC_Pos (20UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_UV_SC (Bit 20)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_UV_SC_Msk (0x100000UL)      /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_UV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_SC_Pos (19UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_UV_SC (Bit 19)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_SC_Msk (0x80000UL)       /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_UV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_SC_Pos (18UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_UV_SC (Bit 18)        */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_SC_Msk (0x40000UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_UV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_SC_Pos (17UL)                /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_UV_SC (Bit 17)           */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_SC_Msk (0x20000UL)           /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_UV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_SC_Pos (16UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_UV_SC (Bit 16)         */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_SC_Msk (0x10000UL)         /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_UV_SC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_OV_ISC_Pos (9UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_OV_ISC (Bit 9)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_OV_ISC_Msk (0x200UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_OV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_ISC_Pos (8UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_OV_ISC (Bit 8)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_ISC_Msk (0x100UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_OV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_ISC_Pos (7UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_OV_ISC (Bit 7)        */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_ISC_Msk (0x80UL)          /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_OV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_ISC_Pos (6UL)                /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_OV_ISC (Bit 6)           */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_ISC_Msk (0x40UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_OV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_ISC_Pos (5UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_OV_ISC (Bit 5)         */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_ISC_Msk (0x20UL)           /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_OV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_UV_ISC_Pos (4UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_UV_ISC (Bit 4)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDDEXT_UV_ISC_Msk (0x10UL)         /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDDEXT_UV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_ISC_Pos (3UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_UV_ISC (Bit 3)       */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_ISC_Msk (0x8UL)          /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD1V5_UV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_ISC_Pos (2UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_UV_ISC (Bit 2)        */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_ISC_Msk (0x4UL)           /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VDD5V_UV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_ISC_Pos (1UL)                /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_UV_ISC (Bit 1)           */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_ISC_Msk (0x2UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VS_UV_ISC (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_ISC_Pos (0UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_UV_ISC (Bit 0)         */
#define SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_ISC_Msk (0x1UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CLR: VBAT_UV_ISC (Bitfield-Mask: 0x01) */
/* =====================================================  SYS_IRQ_CTRL  ====================================================== */
#define SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Pos (11UL)             /*!< SCUPM SYS_IRQ_CTRL: REFBG_UPTHWARN_IE (Bit 11)        */
#define SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Msk (0x800UL)          /*!< SCUPM SYS_IRQ_CTRL: REFBG_UPTHWARN_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Pos (10UL)             /*!< SCUPM SYS_IRQ_CTRL: REFBG_LOTHWARN_IE (Bit 10)        */
#define SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Msk (0x400UL)          /*!< SCUPM SYS_IRQ_CTRL: REFBG_LOTHWARN_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Pos  (9UL)                     /*!< SCUPM SYS_IRQ_CTRL: SYS_OT_IE (Bit 9)                 */
#define SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Msk  (0x200UL)                 /*!< SCUPM SYS_IRQ_CTRL: SYS_OT_IE (Bitfield-Mask: 0x01)   */
#define SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Pos (8UL)                  /*!< SCUPM SYS_IRQ_CTRL: SYS_OTWARN_IE (Bit 8)             */
#define SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Msk (0x100UL)              /*!< SCUPM SYS_IRQ_CTRL: SYS_OTWARN_IE (Bitfield-Mask: 0x01) */
/* ==================================================  SYS_SUPPLY_IRQ_CTRL  ================================================== */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDDEXT_OV_IE_Pos (9UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDDEXT_OV_IE (Bit 9)       */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDDEXT_OV_IE_Msk (0x200UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDDEXT_OV_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD1V5_OV_IE_Pos (8UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDD1V5_OV_IE (Bit 8)       */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD1V5_OV_IE_Msk (0x100UL)        /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDD1V5_OV_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD5V_OV_IE_Pos (7UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDD5V_OV_IE (Bit 7)        */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD5V_OV_IE_Msk (0x80UL)          /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDD5V_OV_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VS_OV_IE_Pos (6UL)                /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VS_OV_IE (Bit 6)           */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VS_OV_IE_Msk (0x40UL)             /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VS_OV_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Pos (5UL)              /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VBAT_OV_IE (Bit 5)         */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Msk (0x20UL)           /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VBAT_OV_IE (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDDEXT_UV_IE_Pos (4UL)            /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDDEXT_UV_IE (Bit 4)       */
#define SCUPM_SYS_SUPPLY_IRQ_CTRL_VDDEXT_UV_IE_Msk (0x10UL)         /*!< SCUPM SYS_SUPPLY_IRQ_CTRL: VDDEXT_UV_IE (Bitfield-Mask: 0x01) */
